#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "Engine_FPoseLink.h"
#include "BasicTypes_FName.h"

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::Ability
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_AbilityLayer_Params
    {
    public:
        Engine::FPoseLink                                            InPose;                                                  //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            AbilityLayer;                                            //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_DeboneIKLayer_Params
    {
    public:
        Engine::FPoseLink                                            InPose_BeforeDeboneIK;                                   //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            DeboneIKLayer;                                           //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_AnimGraph_Params
    {
    public:
        Engine::FPoseLink                                            AnimGraph;                                               //  0x0000(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_GetDeboneSocketAlpha_Params
    {
    public:
        bool                                                         IsValid;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::FName                                            CurveName;                                               //  0x0004(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x4];                                   //  0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        double                                                       OutAlpha;                                                //  0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Ability_AnimGraphNode_ModifyBone_AA5C42214537AEFCC40EBF9DA9392119_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Ability_AnimGraphNode_TwoBoneIK_B4B0F6EF401499235341BA90B93FD58D_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Ability_AnimGraphNode_TwoBoneIK_BEA64D8E4B55E6D85C7AB89473394766_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Ability_AnimGraphNode_ModifyBone_481738B1453FB33739D6B79AC93C425E_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Ability_AnimGraphNode_ModifyBone_A40055744CB7E7C9B3B7E1A09B995FED_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Ability_AnimGraphNode_TwoBoneIK_B756352D4105477522A07485BFF724F7_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Ability_AnimGraphNode_ModifyBone_4F32910A42649A9923A1C48891C53431_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Ability_AnimGraphNode_ModifyBone_C107912D44D33E184ED4B78A91DFFDF7_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Ability_AnimGraphNode_TwoBoneIK_F129509F4AAE478D693D78A1211F52EB_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Ability_M1AnimGraphNode_Reinitialize_33E61B734132A3D62FEEB291DB857B9B_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Ability_M1AnimGraphNode_Reinitialize_49C97505467FB04840E0759E83E8272D_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Ability_AnimGraphNode_BlendListByEnum_302539994305D0447C4A14982E2646E0_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Ability_AnimGraphNode_BlendListByEnum_D11B7C264EF0048B5B18B7932DFC0233_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Ability_AnimGraphNode_BlendListByEnum_E42411AC4C973292B781B589250C10FA_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Ability_AnimGraphNode_TransitionResult_B316C9CB488D7B0AC5A87596224F7D14_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Ability_AnimGraphNode_TransitionResult_983EB16F49ACF347CFE1F7B652174894_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Ability_M1AnimGraphNode_Reinitialize_95F71B144C3CCC2EA03319B6D7A2756C_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Ability_AnimGraphNode_TransitionResult_9A81C87642BF108653B42A8BB964F104_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Ability_AnimGraphNode_TransitionResult_28025AC242DBD88F3C8E2CA0C345E62C_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_C_ExecuteUbergraph_Ability_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
