#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_FString.h"
#include "BasicTypes_TArray.h"
#include "M1_FM1AbilityEvent.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class UCameraModifier; };
namespace CG::Engine { class UAnimMontage; };
namespace CG::CoreUObject { class UObject; };
namespace CG::M1 { class UM1MonsterPartsComponent; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::Ability_Debone
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_DeboneTargetAttacked_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_SetOwnerLocalEnduring_Params
    {
    public:
        bool                                                         InEnduring;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_OnRep_bOwnerAttacking_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_OnRep_bOwnerEnduring_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_IsEnduring_Params
    {
    public:
        bool                                                         bEnduring;                                               //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_TryAbilityEventDeboneEnd_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_OnRep_PartsHPRate_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_DebugIgnoreDeboneStamina_Params
    {
    public:
        BasicTypes::FString                                          Args;                                                    //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_HideDeboneUI_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_ShowDeboneUI_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_DebugIgnoreDeboneCooltime_Params
    {
    public:
        BasicTypes::FString                                          Args;                                                    //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_UnapplyIgnoreLookInput_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_ApplyIgnoreLookInput_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_StopArriveCameraClamp_Params
    {
    public:
        bool                                                         bStop;                                                   //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_ApplyStruggleCamera_Params
    {
    public:
        bool                                                         bApply;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_ApplyArriveCamera_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_ApplyStartCamera_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_GetAllCameras_Params
    {
    public:
        BasicTypes::TArray<Engine::UCameraModifier*>                 OutCameraModifiers;                                      //  0x0000(0x0010)  (Parm, OutParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_ResetCameras_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_DebugPrintStamina_Params
    {
    public:
        float                                                        DeltaSeconds;                                            //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_ShowStamina_Params
    {
    public:
        int32_t                                                      IsEnable;                                                //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_ResetDebone_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_ExecuteDeboneAttackOperation_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_UpdateStamina_Params
    {
    public:
        double                                                       DeltaSeconds;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         bRunOutStamina;                                          //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x7];                                   //  0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_UpdatePositionAndIK_Params
    {
    public:
        double                                                       DeltaSeconds;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0003[0x8];                                   //  0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_DetachFromParts_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_IncrementPartsHangonCount_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_AttachToParts_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_GetArriveCameraModifier_Params
    {
    public:
        Engine::UCameraModifier*                                     OutCameraModifier;                                       //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_GetDeboneSucceedMontage_Params
    {
    public:
        Engine::UAnimMontage*                                        Montage;                                                 //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_GetDeboneAttackMontage_Params
    {
    public:
        Engine::UAnimMontage*                                        Montage;                                                 //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_OnEventReceived_D1EBFD224EC7C71DB2BF95AB4E4FF3AE_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_OnCompleted_D1EBFD224EC7C71DB2BF95AB4E4FF3AE_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_OnBlendOut_D1EBFD224EC7C71DB2BF95AB4E4FF3AE_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_OnEventReceived_11FB4BDF4B03E32FA2E626B37853433C_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_OnCompleted_11FB4BDF4B03E32FA2E626B37853433C_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_OnBlendOut_11FB4BDF4B03E32FA2E626B37853433C_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_OnAbilityEvent_C04518B1422087423B7917B34F50F3BC_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_OnAbilityEvent_792E32904B35F1C03B854FBCAA6B6319_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_OnAbilityEvent_F7D92B584B0C87393F7FFD97C44B9AC9_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_OnAbilityEvent_E8E28EE7440C80A186429789BA43CD6F_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_OnAbilityEvent_50AC98084D5FAC1BCBD9EDA054BAAD2B_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_OnAbilityEvent_1530179148E34C18C2B07C8EA37CF409_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_OnLoaded_DE97FAB246F4BF4917611E837526426C_Params
    {
    public:
        CoreUObject::UObject*                                        Loaded;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_OnLoaded_EFA70D4A40BAE9A5094A22B1E777DFB0_Params
    {
    public:
        CoreUObject::UObject*                                        Loaded;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_OnInput_518A6AE7450A2AC153D6F9B6DA884B21_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_OnInput_E66959964E8DA03AA895E3870B9C7EBB_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_DeboneAttachedTick_Params
    {
    public:
        float                                                        DeltaSeconds;                                            //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_DeboneAttack_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_DeboneSuccess_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_BP_OnDeactivated_Params
    {
    public:
        bool                                                         bCancelled;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_BP_OnActivated_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_AbilityEvent_DeboneEnd_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_AbilityEvent_EpicBossStartStruggle_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_AbilityEvent_EpicBossStopStruggle_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_AbilityEvent_DeboneStart_Params
    {
    public:
        M1::UM1MonsterPartsComponent*                                Parts;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_AbilityEvent_DeboneArrived_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_ServerIgnoreDeboneCooltime_Params
    {
    public:
        bool                                                         bIgnore;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_ServerIgnoreDeboneStamina_Params
    {
    public:
        bool                                                         bIgnore;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_AbilityEvent_DeboneEndureStart_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_AbilityEvent_DeboneEndureEnd_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_ServerOnReceiveAction1Input_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_ServerOnReceiveCancelInput_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAbility_Debone_C_ExecuteUbergraph_Ability_Debone_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
