#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "AnimToTexture_FAnimToTextureInstanceData.h"
#include "AnimToTexture_FAnimToTextureInstancePlaybackData.h"
#include "CoreUObject_FTransform.h"
#include "AnimToTexture_FAnimToTextureAnimState.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class UAnimSequence; };
namespace CG::Engine { class UStaticMesh; };
namespace CG::Engine { class USkeletalMesh; };
namespace CG::Engine { class UTexture2D; };
namespace CG::Engine { class UInstancedStaticMeshComponent; };
namespace CG::AnimToTexture { class UAnimToTextureDataAsset; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::AnimToTexture
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UAnimToTextureDataAsset_ResetInfo_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAnimToTextureDataAsset_GetIndexFromAnimSequence_Params
    {
    public:
        Engine::UAnimSequence*                                       Sequence;                                                //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      ReturnValue;                                             //  0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAnimToTextureDataAsset_BP_GetStaticMesh_Params
    {
    public:
        Engine::UStaticMesh*                                         ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAnimToTextureDataAsset_BP_GetSkeletalMesh_Params
    {
    public:
        Engine::USkeletalMesh*                                       ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAnimToTextureDataAsset_BP_GetBoneWeightTexture_Params
    {
    public:
        Engine::UTexture2D*                                          ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAnimToTextureDataAsset_BP_GetBoneRotationTexture_Params
    {
    public:
        Engine::UTexture2D*                                          ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAnimToTextureDataAsset_BP_GetBonePositionTexture_Params
    {
    public:
        Engine::UTexture2D*                                          ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAnimToTextureInstancePlaybackLibrary_UpdateInstanceData_Params
    {
    public:
        AnimToTexture::FAnimToTextureInstanceData                    InstanceData;                                            //  0x0000(0x0020)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        int32_t                                                      InstanceIndex;                                           //  0x0020(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        AnimToTexture::FAnimToTextureInstancePlaybackData            PlaybackData;                                            //  0x0024(0x0014)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x8];                                   //  0x0038(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FTransform                                      Transform;                                               //  0x0040(0x0030)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0070(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAnimToTextureInstancePlaybackLibrary_SetupInstancedMeshComponent_Params
    {
    public:
        Engine::UInstancedStaticMeshComponent*                       InstancedMeshComponent;                                  //  0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        AnimToTexture::FAnimToTextureInstanceData                    InstanceData;                                            //  0x0008(0x0020)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        int32_t                                                      NumInstances;                                            //  0x0028(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAnimToTextureInstancePlaybackLibrary_GetInstanceTransform_Params
    {
    public:
        AnimToTexture::FAnimToTextureInstanceData                    InstanceData;                                            //  0x0000(0x0020)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        int32_t                                                      InstanceIndex;                                           //  0x0020(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0xC];                                   //  0x0024(0x000C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FTransform                                      InstanceTransform;                                       //  0x0030(0x0030)  (Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0060(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAnimToTextureInstancePlaybackLibrary_GetInstancePlaybackData_Params
    {
    public:
        AnimToTexture::FAnimToTextureInstanceData                    InstanceData;                                            //  0x0000(0x0020)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        int32_t                                                      InstanceIndex;                                           //  0x0020(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        AnimToTexture::FAnimToTextureInstancePlaybackData            InstancePlaybackData;                                    //  0x0024(0x0014)  (Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0038(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAnimToTextureInstancePlaybackLibrary_BatchUpdateInstancedMeshComponent_Params
    {
    public:
        Engine::UInstancedStaticMeshComponent*                       InstancedMeshComponent;                                  //  0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        AnimToTexture::FAnimToTextureInstanceData                    InstanceData;                                            //  0x0008(0x0020)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAnimToTextureInstancePlaybackLibrary_AnimStateFromDataAsset_Params
    {
    public:
        AnimToTexture::UAnimToTextureDataAsset*                      DataAsset;                                               //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      StateIndex;                                              //  0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        AnimToTexture::FAnimToTextureAnimState                       AnimState;                                               //  0x000C(0x0014)  (Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0020(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAnimToTextureInstancePlaybackLibrary_AllocateInstanceData_Params
    {
    public:
        AnimToTexture::FAnimToTextureInstanceData                    InstanceData;                                            //  0x0000(0x0020)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        int32_t                                                      Count;                                                   //  0x0020(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
