#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_TArray.h"
#include "CoreUObject_FVector.h"
#include "BasicTypes_TMap.h"
#include "AugmentedReality_ENUMS.h"
#include "AppleARKitFaceSupport_FNetQuantizeFaceCurve.h"
#include "BasicTypes_FName.h"
#include "CoreUObject_FTransform.h"
#include "CoreUObject_FVector2D.h"

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::AppleARKitFaceSupport
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UAppleARKitFaceMeshComponent_UpdateMeshFromBlendShapes_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAppleARKitFaceMeshComponent_UpdateMesh_Params
    {
    public:
        BasicTypes::TArray<CoreUObject::FVector>                     Vertices;                                                //  0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAppleARKitFaceMeshComponent_SetBlendShapes_Params
    {
    public:
        BasicTypes::TMap<AugmentedReality::EARFaceBlendShape, float> InBlendShapes;                                           //  0x0000(0x0050)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAppleARKitFaceMeshComponent_SetBlendShapeAmount_Params
    {
    public:
        AugmentedReality::EARFaceBlendShape                          BlendShape;                                              //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        Amount;                                                  //  0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAppleARKitFaceMeshComponent_SetAutoBind_Params
    {
    public:
        bool                                                         bAutoBind;                                               //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAppleARKitFaceMeshComponent_ServerUpdateFaceCurves_Params
    {
    public:
        BasicTypes::TArray<AppleARKitFaceSupport::FNetQuantizeFaceCurve> ClientCurves;                                            //  0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAppleARKitFaceMeshComponent_PublishViaLiveLink_Params
    {
    public:
        BasicTypes::FName                                            SubjectName;                                             //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAppleARKitFaceMeshComponent_OnRep_RemoteCurves_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAppleARKitFaceMeshComponent_GetTransform_Params
    {
    public:
        CoreUObject::FTransform                                      ReturnValue;                                             //  0x0000(0x0030)  (Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAppleARKitFaceMeshComponent_GetLastUpdateTimestamp_Params
    {
    public:
        float                                                        ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAppleARKitFaceMeshComponent_GetLastUpdateFrameNumber_Params
    {
    public:
        int32_t                                                      ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAppleARKitFaceMeshComponent_GetFaceBlendShapeAmount_Params
    {
    public:
        AugmentedReality::EARFaceBlendShape                          BlendShape;                                              //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        ReturnValue;                                             //  0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UAppleARKitFaceMeshComponent_CreateMesh_Params
    {
    public:
        BasicTypes::TArray<CoreUObject::FVector>                     Vertices;                                                //  0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::TArray<int32_t>                                  Triangles;                                               //  0x0010(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::TArray<CoreUObject::FVector2D>                   UV0;                                                     //  0x0020(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
