#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "CoreUObject_FBox.h"
#include "Engine_FHitResult.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::BP_AudioZoneBox { class ABP_AudioZoneBox_C; };
namespace CG::AkAudio { class UAkAudioEvent; };
namespace CG::Engine { class UPrimitiveComponent; };
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BP_AudioZoneBox
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_IsIntersect_Params
    {
    public:
        CoreUObject::FBox                                            A;                                                       //  0x0000(0x001C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        CoreUObject::FBox                                            B;                                                       //  0x001C(0x001C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
        bool                                                         bResult;                                                 //  0x0038(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x3];                                   //  0x0039(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_FillAllOverlappedZonesAsSlave_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_GetHighestPriorityMaster_Params
    {
    public:
        BP_AudioZoneBox::ABP_AudioZoneBox_C*                         ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_UpdateMasterOcclusionZones_Params
    {
    public:
        BP_AudioZoneBox::ABP_AudioZoneBox_C*                         InMaster;                                                //  0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
        bool                                                         bAdd;                                                    //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x7];                                   //  0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_EnableAkComponentsTick_Params
    {
    public:
        bool                                                         bEnable;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_Reverb_param_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_Spawn3dEnvEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      AkEvent;                                                 //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
        AkAudio::UAkAudioEvent*                                      PlayedAk;                                                //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
        double                                                       Delay;                                                   //  0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_FindAmbienceSpotPoint_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_setReverb_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_ActiveIndoor_Params
    {
    public:
        bool                                                         ActiveIndoor;                                            //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_CalculateAttenuate_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_CollisionAcitive_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_Bp_EnvZoneEnter_Params
    {
    public:
        BP_AudioZoneBox::ABP_AudioZoneBox_C*                         OverlapedZone;                                           //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_BP_EnvZoneLeave_Params
    {
    public:
        BP_AudioZoneBox::ABP_AudioZoneBox_C*                         LeaveZone;                                               //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_BP_EnvZoneInitActive_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_BP_EnvZoneActiveByPlayer_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_BP_EnvZoneDiscard_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_BndEvt__BP_AudioZoneBox_Visualize_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature_Params
    {
    public:
        Engine::UPrimitiveComponent*                                 OverlappedComponent;                                     //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
        Engine::AActor*                                              OtherActor;                                              //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
        Engine::UPrimitiveComponent*                                 OtherComp;                                               //  0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      OtherBodyIndex;                                          //  0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         bFromSweep;                                              //  0x001C(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0003[0x3];                                   //  0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::FHitResult                                           SweepResult;                                             //  0x0020(0x009C)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_BndEvt__BP_AudioZoneBox_AreaMesh_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature_Params
    {
    public:
        Engine::UPrimitiveComponent*                                 OverlappedComponent;                                     //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
        Engine::AActor*                                              OtherActor;                                              //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
        Engine::UPrimitiveComponent*                                 OtherComp;                                               //  0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      OtherBodyIndex;                                          //  0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_BpSpawnDirecEnvEventStart_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_BpAkZone3dBaseRepeat_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      RepeatAkEvent;                                           //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
        double                                                       Delay;                                                   //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_BpAkZone3dSecodryRepeat_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      RepeatAkEvent;                                           //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
        double                                                       Delay;                                                   //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_CustomEvent_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_OnMyPlayerEnter_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_NotifyOcclusionToSlave_Params
    {
    public:
        bool                                                         bActivated;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_AudioZoneBox_C_ExecuteUbergraph_BP_AudioZoneBox_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0004[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
