#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::BP_AudioZoneBox { class ABP_AudioZoneBox_C; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::BP_GlobalEnvManager
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ABP_GlobalEnvManager_C_SetReverbParam_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_GlobalEnvManager_C_FindInsideZone_Params
    {
    public:
        bool                                                         SuccessFindZone;                                         //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_GlobalEnvManager_C_ZoneLeaveOldZoneOverride_Params
    {
    public:
        BP_AudioZoneBox::ABP_AudioZoneBox_C*                         OverlapedZone;                                           //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_GlobalEnvManager_C_SetEnvOverride_Params
    {
    public:
        BP_AudioZoneBox::ABP_AudioZoneBox_C*                         RefreshOverlapedZone;                                    //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
        bool                                                         Entering;                                                //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_GlobalEnvManager_C_SetEnvInitParameter_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_GlobalEnvManager_C_GlobalEnvEventSpot_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_GlobalEnvManager_C_CollectBPZone_Params
    {
    public:
        BP_AudioZoneBox::ABP_AudioZoneBox_C*                         NewVol;                                                  //  0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_GlobalEnvManager_C_UserConstructionScript_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_GlobalEnvManager_C_BP_EnvZoneInitActive_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_GlobalEnvManager_C_BP_EnvZoneActiveByPlayer_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_GlobalEnvManager_C_BP_EnvZoneDiscard_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_GlobalEnvManager_C_ReceiveBeginPlay_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_GlobalEnvManager_C_Init_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_GlobalEnvManager_C__2DOneShot_Event_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_GlobalEnvManager_C_Bp_EnvZoneEnter_Params
    {
    public:
        BP_AudioZoneBox::ABP_AudioZoneBox_C*                         OverlapedZone;                                           //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_GlobalEnvManager_C_BP_EnvZoneLeave_Params
    {
    public:
        BP_AudioZoneBox::ABP_AudioZoneBox_C*                         LeaveZone;                                               //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_GlobalEnvManager_C_BPStartOmniEnvEvent_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_GlobalEnvManager_C_Debug_String_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ABP_GlobalEnvManager_C_ExecuteUbergraph_BP_GlobalEnvManager_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
