#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "M1_FM1AbilityOpCalcParam.h"
#include "M1_FM1CalcDamageInfo.h"
#include "M1Data_ENUMS.h"
#include "M1Data_FM1ScaledInteger.h"
#include "BasicTypes_FName.h"
#include "M1_FM1AbilityOpExecCalcOutput.h"

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::CalcDamageBase
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_ApplySkillCritical_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1::FM1CalcDamageInfo                                        DamageInfo;                                              //  0x0008(0x0138)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_DetermineSkillCritical_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1::FM1CalcDamageInfo                                        DamageInfo;                                              //  0x0008(0x0138)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_DetermineElemetalDEF_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1Data::EM1ElementalDamageChannel                            ElementalChannel;                                        //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1Data::FM1ScaledInteger                                     ElementalDEF;                                            //  0x0010(0x0008)  (Parm, OutParm, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_DetermineMonsterSkillDEF_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1Data::FM1ScaledInteger                                     SkillDEF;                                                //  0x0008(0x0008)  (Parm, OutParm, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_DetermineGaugeStatMultiplier_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1Data::EM1StatType                                          WatchStat;                                               //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        M1Data::EM1StatType                                          MaxStat;                                                 //  0x0009(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x2];                                   //  0x000A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::FName                                            MinValue;                                                //  0x000C(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::FName                                            MaxValue;                                                //  0x0014(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::FName                                            AddPower;                                                //  0x001C(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::FName                                            AddAttack;                                               //  0x0024(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x4];                                   //  0x002C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1Data::FM1ScaledInteger                                     AddPowerValue;                                           //  0x0030(0x0008)  (Parm, OutParm, NoDestructor, HasGetValueTypeHash)
        M1Data::FM1ScaledInteger                                     AddAttackValue;                                          //  0x0038(0x0008)  (Parm, OutParm, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_DetermineGaugeStatMultiplier_Bunny_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1Data::EM1StatType                                          WatchStat;                                               //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        M1Data::EM1StatType                                          MaxStat;                                                 //  0x0009(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0003[0x2];                                   //  0x000A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::FName                                            MinValue;                                                //  0x000C(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::FName                                            MaxValue;                                                //  0x0014(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::FName                                            AddPower;                                                //  0x001C(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::FName                                            AddAttack;                                               //  0x0024(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0004[0x4];                                   //  0x002C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1Data::FM1ScaledInteger                                     AddPowerValue;                                           //  0x0030(0x0008)  (Parm, OutParm, NoDestructor, HasGetValueTypeHash)
        M1Data::FM1ScaledInteger                                     AddAttackValue;                                          //  0x0038(0x0008)  (Parm, OutParm, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_ApplySkillATK_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1::FM1CalcDamageInfo                                        DamageInfo;                                              //  0x0008(0x0138)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
        M1Data::EM1ElementalDamageChannel                            ElementalChannel;                                        //  0x0140(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        M1Data::EM1SkillArcheType                                    ArcheType;                                               //  0x0141(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0005[0x6];                                   //  0x0142(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1Data::FM1ScaledInteger                                     AddPower;                                                //  0x0148(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
        M1Data::FM1ScaledInteger                                     AddAttack;                                               //  0x0150(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_ApplyDEFOnlyWeapon_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1::FM1CalcDamageInfo                                        DamageInfo;                                              //  0x0008(0x0138)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_ApplyDamageCoefficient_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1::FM1CalcDamageInfo                                        DamageInfo;                                              //  0x0008(0x0138)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_ApplyDEFWithInflection_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1::FM1CalcDamageInfo                                        DamageInfo;                                              //  0x0008(0x0138)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
        M1Data::FM1ScaledInteger                                     AttackerLevelValue;                                      //  0x0140(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
        M1Data::FM1ScaledInteger                                     DEFInflection_VarX1;                                     //  0x0148(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
        M1Data::FM1ScaledInteger                                     DEFInflection_VarX2;                                     //  0x0150(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
        M1Data::FM1ScaledInteger                                     DEFInflection_VarX3;                                     //  0x0158(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_ApplyInvokeChanceElementalSE_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1::FM1CalcDamageInfo                                        DamageInfo;                                              //  0x0008(0x0138)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_ApplyATKMultiplierByExplosionRadius_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1::FM1CalcDamageInfo                                        DamageInfo;                                              //  0x0008(0x0138)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
        double                                                       ExplosionRadius;                                         //  0x0140(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_ApplyCritical_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1::FM1CalcDamageInfo                                        DamageInfo;                                              //  0x0008(0x0138)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_ApplyATKMultiplierByCharge_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1::FM1CalcDamageInfo                                        DanageInfo;                                              //  0x0008(0x0138)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
        float                                                        ATKMultiplierByCharge;                                   //  0x0140(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0006[0x4];                                   //  0x0144(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_ApplyATKMultiplierByDistance_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1::FM1CalcDamageInfo                                        DamageInfo;                                              //  0x0008(0x0138)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
        M1Data::FM1ScaledInteger                                     ATKMultiplierByDistance;                                 //  0x0140(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_DetermineCritical_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1::FM1CalcDamageInfo                                        DanageInfo;                                              //  0x0008(0x0138)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_DetermineATKMultiplierByDistance_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1Data::FM1ScaledInteger                                     RetATKMultiplierByDistance;                              //  0x0008(0x0008)  (Parm, OutParm, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_ApplyATK_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1::FM1CalcDamageInfo                                        DamageInfo;                                              //  0x0008(0x0138)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
        BasicTypes::FName                                            ATKType;                                                 //  0x0140(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_DoCalculation_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1::FM1CalcDamageInfo                                        DamageInfo;                                              //  0x0008(0x0138)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_SetAdditionalDamageInfo_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1::FM1CalcDamageInfo                                        DamageInfo;                                              //  0x0008(0x0138)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCalcDamageBase_C_Execute_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
        M1::FM1AbilityOpExecCalcOutput                               Output;                                                  //  0x0008(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
