#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "CinematicCamera_FCameraLensSettings.h"
#include "BasicTypes_FString.h"
#include "CinematicCamera_FCameraFocusSettings.h"
#include "CinematicCamera_FCameraFilmbackSettings.h"
#include "CinematicCamera_FPlateCropSettings.h"
#include "BasicTypes_TArray.h"
#include "CinematicCamera_FNamedLensPreset.h"
#include "CinematicCamera_FNamedFilmbackPreset.h"
#include "CinematicCamera_FNamedPlateCropPreset.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class USplineComponent; };
namespace CG::CinematicCamera { class UCineCameraComponent; };
namespace CG::CinematicCamera { class UCineCameraSettings; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::CinematicCamera
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ACameraRig_Rail_GetRailSplineComponent_Params
    {
    public:
        Engine::USplineComponent*                                    ReturnValue;                                             //  0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ACineCameraActor_GetCineCameraComponent_Params
    {
    public:
        CinematicCamera::UCineCameraComponent*                       ReturnValue;                                             //  0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraComponent_SetLensSettings_Params
    {
    public:
        CinematicCamera::FCameraLensSettings                         NewLensSettings;                                         //  0x0000(0x001C)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraComponent_SetLensPresetByName_Params
    {
    public:
        BasicTypes::FString                                          InPresetName;                                            //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraComponent_SetFocusSettings_Params
    {
    public:
        CinematicCamera::FCameraFocusSettings                        NewFocusSettings;                                        //  0x0000(0x0058)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraComponent_SetFilmbackPresetByName_Params
    {
    public:
        BasicTypes::FString                                          InPresetName;                                            //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraComponent_SetFilmback_Params
    {
    public:
        CinematicCamera::FCameraFilmbackSettings                     NewFilmback;                                             //  0x0000(0x000C)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraComponent_SetCustomNearClippingPlane_Params
    {
    public:
        float                                                        NewCustomNearClippingPlane;                              //  0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraComponent_SetCurrentFocalLength_Params
    {
    public:
        float                                                        InFocalLength;                                           //  0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraComponent_SetCurrentAperture_Params
    {
    public:
        float                                                        NewCurrentAperture;                                      //  0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraComponent_SetCropSettings_Params
    {
    public:
        CinematicCamera::FPlateCropSettings                          NewCropSettings;                                         //  0x0000(0x0004)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraComponent_SetCropPresetByName_Params
    {
    public:
        BasicTypes::FString                                          InPresetName;                                            //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraComponent_GetVerticalFieldOfView_Params
    {
    public:
        float                                                        ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraComponent_GetLensPresetsCopy_Params
    {
    public:
        BasicTypes::TArray<CinematicCamera::FNamedLensPreset>        ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraComponent_GetLensPresetName_Params
    {
    public:
        BasicTypes::FString                                          ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraComponent_GetHorizontalFieldOfView_Params
    {
    public:
        float                                                        ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraComponent_GetFilmbackPresetsCopy_Params
    {
    public:
        BasicTypes::TArray<CinematicCamera::FNamedFilmbackPreset>    ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraComponent_GetFilmbackPresetName_Params
    {
    public:
        BasicTypes::FString                                          ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraComponent_GetDefaultFilmbackPresetName_Params
    {
    public:
        BasicTypes::FString                                          ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraComponent_GetCropPresetName_Params
    {
    public:
        BasicTypes::FString                                          ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraSettings_SetLensPresets_Params
    {
    public:
        BasicTypes::TArray<CinematicCamera::FNamedLensPreset>        InLensPresets;                                           //  0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraSettings_SetFilmbackPresets_Params
    {
    public:
        BasicTypes::TArray<CinematicCamera::FNamedFilmbackPreset>    InFilmbackPresets;                                       //  0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraSettings_SetDefaultLensPresetName_Params
    {
    public:
        BasicTypes::FString                                          InDefaultLensPresetName;                                 //  0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraSettings_SetDefaultLensFStop_Params
    {
    public:
        float                                                        InDefaultLensFStop;                                      //  0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraSettings_SetDefaultLensFocalLength_Params
    {
    public:
        float                                                        InDefaultLensFocalLength;                                //  0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraSettings_SetDefaultFilmbackPreset_Params
    {
    public:
        BasicTypes::FString                                          InDefaultFilmbackPreset;                                 //  0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraSettings_SetDefaultCropPresetName_Params
    {
    public:
        BasicTypes::FString                                          InDefaultCropPresetName;                                 //  0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraSettings_SetCropPresets_Params
    {
    public:
        BasicTypes::TArray<CinematicCamera::FNamedPlateCropPreset>   InCropPresets;                                           //  0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraSettings_GetLensPresetNames_Params
    {
    public:
        BasicTypes::TArray<BasicTypes::FString>                      ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraSettings_GetLensPresetByName_Params
    {
    public:
        BasicTypes::FString                                          PresetName;                                              //  0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CinematicCamera::FCameraLensSettings                         LensSettings;                                            //  0x0010(0x001C)  (Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x002C(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraSettings_GetFilmbackPresetNames_Params
    {
    public:
        BasicTypes::TArray<BasicTypes::FString>                      ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraSettings_GetFilmbackPresetByName_Params
    {
    public:
        BasicTypes::FString                                          PresetName;                                              //  0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CinematicCamera::FCameraFilmbackSettings                     FilmbackSettings;                                        //  0x0010(0x000C)  (Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x001C(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraSettings_GetCropPresetNames_Params
    {
    public:
        BasicTypes::TArray<BasicTypes::FString>                      ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraSettings_GetCropPresetByName_Params
    {
    public:
        BasicTypes::FString                                          PresetName;                                              //  0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CinematicCamera::FPlateCropSettings                          CropSettings;                                            //  0x0010(0x0004)  (Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0014(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UCineCameraSettings_GetCineCameraSettings_Params
    {
    public:
        CinematicCamera::UCineCameraSettings*                        ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
