#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_TMap.h"
#include "BasicTypes_FName.h"
#include "IKRig_FIKRigGoal.h"
#include "CoreUObject_FTransform.h"
#include "CoreUObject_FVector.h"
#include "CoreUObject_FQuat.h"
#include "IKRig_FRetargetProfile.h"
#include "IKRig_FTargetRootSettings.h"
#include "IKRig_FRetargetGlobalSettings.h"
#include "IKRig_FTargetChainSpeedPlantSettings.h"
#include "IKRig_FTargetChainSettings.h"
#include "IKRig_FTargetChainIKSettings.h"
#include "IKRig_FTargetChainFKSettings.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::IKRig { class UIKRetargeter; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::IKRig
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class IIKGoalCreatorInterface_AddIKGoals_Params
    {
    public:
        BasicTypes::TMap<BasicTypes::FName, IKRig::FIKRigGoal>       OutGoals;                                                //  0x0000(0x0050)  (Parm, OutParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UIKRigComponent_SetIKRigGoalTransform_Params
    {
    public:
        BasicTypes::FName                                            GoalName;                                                //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x8];                                   //  0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FTransform                                      Transform;                                               //  0x0010(0x0030)  (ConstParm, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        PositionAlpha;                                           //  0x0040(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        RotationAlpha;                                           //  0x0044(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UIKRigComponent_SetIKRigGoalPositionAndRotation_Params
    {
    public:
        BasicTypes::FName                                            GoalName;                                                //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FVector                                         Position;                                                //  0x0008(0x000C)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0xC];                                   //  0x0014(0x000C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FQuat                                           Rotation;                                                //  0x0020(0x0010)  (ConstParm, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        PositionAlpha;                                           //  0x0030(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        RotationAlpha;                                           //  0x0034(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UIKRigComponent_SetIKRigGoal_Params
    {
    public:
        IKRig::FIKRigGoal                                            Goal;                                                    //  0x0000(0x0060)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UIKRigComponent_ClearAllGoals_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UIKRetargeter_SetRootSettingsInRetargetProfile_Params
    {
    public:
        IKRig::FRetargetProfile                                      RetargetProfile;                                         //  0x0000(0x00D8)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        IKRig::FTargetRootSettings                                   RootSettings;                                            //  0x00D8(0x0040)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UIKRetargeter_SetGlobalSettingsInRetargetProfile_Params
    {
    public:
        IKRig::FRetargetProfile                                      RetargetProfile;                                         //  0x0000(0x00D8)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        IKRig::FRetargetGlobalSettings                               GlobalSettings;                                          //  0x00D8(0x0020)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UIKRetargeter_SetChainSpeedPlantSettingsInRetargetProfile_Params
    {
    public:
        IKRig::FRetargetProfile                                      RetargetProfile;                                         //  0x0000(0x00D8)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        IKRig::FTargetChainSpeedPlantSettings                        SpeedPlantSettings;                                      //  0x00D8(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            TargetChainName;                                         //  0x00F0(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UIKRetargeter_SetChainSettingsInRetargetProfile_Params
    {
    public:
        IKRig::FRetargetProfile                                      RetargetProfile;                                         //  0x0000(0x00D8)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        IKRig::FTargetChainSettings                                  ChainSettings;                                           //  0x00D8(0x0074)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            TargetChainName;                                         //  0x014C(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UIKRetargeter_SetChainIKSettingsInRetargetProfile_Params
    {
    public:
        IKRig::FRetargetProfile                                      RetargetProfile;                                         //  0x0000(0x00D8)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        IKRig::FTargetChainIKSettings                                IKSettings;                                              //  0x00D8(0x0044)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            TargetChainName;                                         //  0x011C(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UIKRetargeter_SetChainFKSettingsInRetargetProfile_Params
    {
    public:
        IKRig::FRetargetProfile                                      RetargetProfile;                                         //  0x0000(0x00D8)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        IKRig::FTargetChainFKSettings                                FKSettings;                                              //  0x00D8(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            TargetChainName;                                         //  0x00F0(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UIKRetargeter_GetRootSettingsFromRetargetProfile_Params
    {
    public:
        IKRig::FRetargetProfile                                      RetargetProfile;                                         //  0x0000(0x00D8)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        IKRig::FTargetRootSettings                                   ReturnValue;                                             //  0x00D8(0x0040)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UIKRetargeter_GetRootSettingsFromRetargetAsset_Params
    {
    public:
        IKRig::UIKRetargeter*                                        RetargetAsset;                                           //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            OptionalProfileName;                                     //  0x0008(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        IKRig::FTargetRootSettings                                   OutSettings;                                             //  0x0010(0x0040)  (Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UIKRetargeter_GetGlobalSettingsFromRetargetProfile_Params
    {
    public:
        IKRig::FRetargetProfile                                      RetargetProfile;                                         //  0x0000(0x00D8)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        IKRig::FRetargetGlobalSettings                               ReturnValue;                                             //  0x00D8(0x0020)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UIKRetargeter_GetGlobalSettingsFromRetargetAsset_Params
    {
    public:
        IKRig::UIKRetargeter*                                        RetargetAsset;                                           //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            OptionalProfileName;                                     //  0x0008(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        IKRig::FRetargetGlobalSettings                               OutSettings;                                             //  0x0010(0x0020)  (Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UIKRetargeter_GetChainUsingGoalFromRetargetAsset_Params
    {
    public:
        IKRig::UIKRetargeter*                                        RetargetAsset;                                           //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            IKGoalName;                                              //  0x0008(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        IKRig::FTargetChainSettings                                  ReturnValue;                                             //  0x0010(0x0074)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UIKRetargeter_GetChainSettingsFromRetargetProfile_Params
    {
    public:
        IKRig::FRetargetProfile                                      RetargetProfile;                                         //  0x0000(0x00D8)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            TargetChainName;                                         //  0x00D8(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        IKRig::FTargetChainSettings                                  ReturnValue;                                             //  0x00E0(0x0074)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UIKRetargeter_GetChainSettingsFromRetargetAsset_Params
    {
    public:
        IKRig::UIKRetargeter*                                        RetargetAsset;                                           //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            TargetChainName;                                         //  0x0008(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            OptionalProfileName;                                     //  0x0010(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        IKRig::FTargetChainSettings                                  ReturnValue;                                             //  0x0018(0x0074)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
