#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "MovieScene_FMovieSceneSequencePlaybackSettings.h"
#include "BasicTypes_FName.h"
#include "BasicTypes_TArray.h"
#include "MovieScene_FMovieSceneObjectBindingID.h"
#include "CoreUObject_FSoftClassPath.h"
#include "CoreUObject_FQualifiedFrameTime.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::CoreUObject { class UObject; };
namespace CG::Engine { class UCameraComponent; };
namespace CG::LevelSequence { class ULevelSequence; };
namespace CG::LevelSequence { class ALevelSequenceActor; };
namespace CG::LevelSequence { class ULevelSequencePlayer; };
namespace CG::Engine { class AActor; };
namespace CG::LevelSequence { class ULevelSequenceBurnInInitSettings; };
namespace CG::MovieScene { class UMovieSceneSequence; };
namespace CG::MediaAssets { class UMediaComponent; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::LevelSequence
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ULevelSequence_RemoveMetaDataByClass_Params
    {
    public:
        CoreUObject::UObject*                                        InClass;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULevelSequence_FindOrAddMetaDataByClass_Params
    {
    public:
        CoreUObject::UObject*                                        InClass;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::UObject*                                        ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULevelSequence_FindMetaDataByClass_Params
    {
    public:
        CoreUObject::UObject*                                        InClass;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::UObject*                                        ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULevelSequence_CopyMetaData_Params
    {
    public:
        CoreUObject::UObject*                                        InMetaData;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::UObject*                                        ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULevelSequencePlayer_GetActiveCameraComponent_Params
    {
    public:
        Engine::UCameraComponent*                                    ReturnValue;                                             //  0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULevelSequencePlayer_CreateLevelSequencePlayer_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        LevelSequence::ULevelSequence*                               LevelSequence;                                           //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieScene::FMovieSceneSequencePlaybackSettings              Settings;                                                //  0x0010(0x0024)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0034(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        LevelSequence::ALevelSequenceActor*                          OutActor;                                                //  0x0038(0x0008)  (Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        LevelSequence::ULevelSequencePlayer*                         ReturnValue;                                             //  0x0040(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceActor_ShowBurnin_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceActor_SetSequence_Params
    {
    public:
        LevelSequence::ULevelSequence*                               InSequence;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceActor_SetReplicatePlayback_Params
    {
    public:
        bool                                                         ReplicatePlayback;                                       //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceActor_SetBindingByTag_Params
    {
    public:
        BasicTypes::FName                                            BindingTag;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::TArray<Engine::AActor*>                          Actors;                                                  //  0x0008(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
        bool                                                         bAllowBindingsFromAsset;                                 //  0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceActor_SetBinding_Params
    {
    public:
        MovieScene::FMovieSceneObjectBindingID                       Binding;                                                 //  0x0000(0x0018)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::TArray<Engine::AActor*>                          Actors;                                                  //  0x0018(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
        bool                                                         bAllowBindingsFromAsset;                                 //  0x0028(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceActor_ResetBindings_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceActor_ResetBinding_Params
    {
    public:
        MovieScene::FMovieSceneObjectBindingID                       Binding;                                                 //  0x0000(0x0018)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceActor_RemoveBindingByTag_Params
    {
    public:
        BasicTypes::FName                                            Tag;                                                     //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::AActor*                                              Actor;                                                   //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceActor_RemoveBinding_Params
    {
    public:
        MovieScene::FMovieSceneObjectBindingID                       Binding;                                                 //  0x0000(0x0018)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::AActor*                                              Actor;                                                   //  0x0018(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceActor_OnLevelSequenceLoaded__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceActor_LoadSequence_Params
    {
    public:
        LevelSequence::ULevelSequence*                               ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceActor_HideBurnin_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceActor_GetSequencePlayer_Params
    {
    public:
        LevelSequence::ULevelSequencePlayer*                         ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceActor_GetSequence_Params
    {
    public:
        LevelSequence::ULevelSequence*                               ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceActor_FindNamedBindings_Params
    {
    public:
        BasicTypes::FName                                            Tag;                                                     //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::TArray<MovieScene::FMovieSceneObjectBindingID>   ReturnValue;                                             //  0x0008(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceActor_FindNamedBinding_Params
    {
    public:
        BasicTypes::FName                                            Tag;                                                     //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieScene::FMovieSceneObjectBindingID                       ReturnValue;                                             //  0x0008(0x0018)  (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceActor_AddBindingByTag_Params
    {
    public:
        BasicTypes::FName                                            BindingTag;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::AActor*                                              Actor;                                                   //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bAllowBindingsFromAsset;                                 //  0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceActor_AddBinding_Params
    {
    public:
        MovieScene::FMovieSceneObjectBindingID                       Binding;                                                 //  0x0000(0x0018)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::AActor*                                              Actor;                                                   //  0x0018(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bAllowBindingsFromAsset;                                 //  0x0020(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULevelSequenceBurnInOptions_SetBurnIn_Params
    {
    public:
        CoreUObject::FSoftClassPath                                  InBurnInClass;                                           //  0x0000(0x0020)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULevelSequenceBurnIn_SetSettings_Params
    {
    public:
        CoreUObject::UObject*                                        InSettings;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULevelSequenceBurnIn_GetSettingsClass_Params
    {
    public:
        LevelSequence::ULevelSequenceBurnInInitSettings*             ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULevelSequenceDirector_OnCreated_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULevelSequenceDirector_GetSequence_Params
    {
    public:
        MovieScene::UMovieSceneSequence*                             ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULevelSequenceDirector_GetRootSequenceTime_Params
    {
    public:
        CoreUObject::FQualifiedFrameTime                             ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULevelSequenceDirector_GetMasterSequenceTime_Params
    {
    public:
        CoreUObject::FQualifiedFrameTime                             ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULevelSequenceDirector_GetCurrentTime_Params
    {
    public:
        CoreUObject::FQualifiedFrameTime                             ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULevelSequenceDirector_GetBoundObjects_Params
    {
    public:
        MovieScene::FMovieSceneObjectBindingID                       ObjectBinding;                                           //  0x0000(0x0018)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::TArray<CoreUObject::UObject*>                    ReturnValue;                                             //  0x0018(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULevelSequenceDirector_GetBoundObject_Params
    {
    public:
        MovieScene::FMovieSceneObjectBindingID                       ObjectBinding;                                           //  0x0000(0x0018)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::UObject*                                        ReturnValue;                                             //  0x0018(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULevelSequenceDirector_GetBoundActors_Params
    {
    public:
        MovieScene::FMovieSceneObjectBindingID                       ObjectBinding;                                           //  0x0000(0x0018)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::TArray<Engine::AActor*>                          ReturnValue;                                             //  0x0018(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULevelSequenceDirector_GetBoundActor_Params
    {
    public:
        MovieScene::FMovieSceneObjectBindingID                       ObjectBinding;                                           //  0x0000(0x0018)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::AActor*                                              ReturnValue;                                             //  0x0018(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceMediaController_SynchronizeToServer_Params
    {
    public:
        float                                                        DesyncThresholdSeconds;                                  //  0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceMediaController_Play_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceMediaController_OnRep_ServerStartTimeSeconds_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceMediaController_GetSequence_Params
    {
    public:
        LevelSequence::ALevelSequenceActor*                          ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ALevelSequenceMediaController_GetMediaComponent_Params
    {
    public:
        MediaAssets::UMediaComponent*                                ReturnValue;                                             //  0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
