#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "LiveLinkInterface_FLiveLinkBaseStaticData.h"
#include "LiveLinkInterface_FLiveLinkBaseFrameData.h"
#include "LiveLinkInterface_FSubjectFrameHandle.h"
#include "BasicTypes_TArray.h"
#include "BasicTypes_FName.h"
#include "LiveLinkInterface_FLiveLinkTransform.h"
#include "LiveLinkInterface_FLiveLinkSubjectKey.h"
#include "LiveLinkInterface_FLiveLinkSourceHandle.h"
#include "CoreUObject_FTransform.h"
#include "LiveLinkInterface_FLiveLinkSubjectName.h"
#include "CoreUObject_FGuid.h"
#include "BasicTypes_FText.h"
#include "LiveLinkInterface_FLiveLinkBasicBlueprintData.h"
#include "LiveLinkInterface_FSubjectMetadata.h"
#include "BasicTypes_TMap.h"
#include "LiveLinkInterface_FLiveLinkSkeletonStaticData.h"
#include "LiveLinkInterface_FLiveLinkAnimationFrameData.h"
#include "LiveLinkInterface_FLiveLinkBaseBlueprintData.h"
#include "CoreUObject_FTimecode.h"
#include "LiveLinkInterface_FLiveLinkSubjectRepresentation.h"
#include "Engine_FLatentActionInfo.h"
#include "LiveLink_FProviderPollResult.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::LiveLinkInterface { class ULiveLinkRole; };
namespace CG::CoreUObject { class UObject; };
namespace CG::LiveLink { class ULiveLinkMessageBusFinder; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::LiveLink
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintVirtualSubject_UpdateVirtualSubjectStaticData_Internal_Params
    {
    public:
        LiveLinkInterface::FLiveLinkBaseStaticData                   InStruct;                                                //  0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintVirtualSubject_UpdateVirtualSubjectFrameData_Internal_Params
    {
    public:
        LiveLinkInterface::FLiveLinkBaseFrameData                    InStruct;                                                //  0x0000(0x00A0)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        bool                                                         bInShouldStampCurrentTime;                               //  0x00A0(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x00A1(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintVirtualSubject_OnUpdate_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintVirtualSubject_OnInitialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_TransformNames_Params
    {
    public:
        LiveLinkInterface::FSubjectFrameHandle                       SubjectFrameHandle;                                      //  0x0000(0x0018)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::TArray<BasicTypes::FName>                        TransformNames;                                          //  0x0018(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_TransformName_Params
    {
    public:
        LiveLinkInterface::FLiveLinkTransform                        LiveLinkTransform;                                       //  0x0000(0x0020)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            Name;                                                    //  0x0020(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_SetLiveLinkSubjectEnabled_Params
    {
    public:
        LiveLinkInterface::FLiveLinkSubjectKey                       SubjectKey;                                              //  0x0000(0x0018)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bEnabled;                                                //  0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_RemoveSource_Params
    {
    public:
        LiveLinkInterface::FLiveLinkSourceHandle                     SourceHandle;                                            //  0x0000(0x0018)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_ParentBoneSpaceTransform_Params
    {
    public:
        LiveLinkInterface::FLiveLinkTransform                        LiveLinkTransform;                                       //  0x0000(0x0020)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        CoreUObject::FTransform                                      Transform;                                               //  0x0020(0x0030)  (Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_NumberOfTransforms_Params
    {
    public:
        LiveLinkInterface::FSubjectFrameHandle                       SubjectFrameHandle;                                      //  0x0000(0x0018)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        int32_t                                                      ReturnValue;                                             //  0x0018(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_IsSpecificLiveLinkSubjectEnabled_Params
    {
    public:
        LiveLinkInterface::FLiveLinkSubjectKey                       SubjectKey;                                              //  0x0000(0x0018)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bForThisFrame;                                           //  0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0019(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_IsSourceStillValid_Params
    {
    public:
        LiveLinkInterface::FLiveLinkSourceHandle                     SourceHandle;                                            //  0x0000(0x0018)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_IsLiveLinkSubjectEnabled_Params
    {
    public:
        LiveLinkInterface::FLiveLinkSubjectName                      SubjectName;                                             //  0x0000(0x0008)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_HasParent_Params
    {
    public:
        LiveLinkInterface::FLiveLinkTransform                        LiveLinkTransform;                                       //  0x0000(0x0020)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0020(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_GetTransformByName_Params
    {
    public:
        LiveLinkInterface::FSubjectFrameHandle                       SubjectFrameHandle;                                      //  0x0000(0x0018)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            TransformName;                                           //  0x0018(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        LiveLinkInterface::FLiveLinkTransform                        LiveLinkTransform;                                       //  0x0020(0x0020)  (Parm, OutParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_GetTransformByIndex_Params
    {
    public:
        LiveLinkInterface::FSubjectFrameHandle                       SubjectFrameHandle;                                      //  0x0000(0x0018)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        int32_t                                                      TransformIndex;                                          //  0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        LiveLinkInterface::FLiveLinkTransform                        LiveLinkTransform;                                       //  0x0020(0x0020)  (Parm, OutParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_GetSpecificLiveLinkSubjectRole_Params
    {
    public:
        LiveLinkInterface::FLiveLinkSubjectKey                       SubjectKey;                                              //  0x0000(0x0018)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        LiveLinkInterface::ULiveLinkRole*                            ReturnValue;                                             //  0x0018(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_GetSourceTypeFromGuid_Params
    {
    public:
        CoreUObject::FGuid                                           SourceGuid;                                              //  0x0000(0x0010)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FText                                            ReturnValue;                                             //  0x0010(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_GetSourceType_Params
    {
    public:
        LiveLinkInterface::FLiveLinkSourceHandle                     SourceHandle;                                            //  0x0000(0x0018)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::FText                                            ReturnValue;                                             //  0x0018(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_GetSourceStatus_Params
    {
    public:
        LiveLinkInterface::FLiveLinkSourceHandle                     SourceHandle;                                            //  0x0000(0x0018)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::FText                                            ReturnValue;                                             //  0x0018(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_GetSourceMachineName_Params
    {
    public:
        LiveLinkInterface::FLiveLinkSourceHandle                     SourceHandle;                                            //  0x0000(0x0018)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::FText                                            ReturnValue;                                             //  0x0018(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_GetRootTransform_Params
    {
    public:
        LiveLinkInterface::FSubjectFrameHandle                       SubjectFrameHandle;                                      //  0x0000(0x0018)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        LiveLinkInterface::FLiveLinkTransform                        LiveLinkTransform;                                       //  0x0018(0x0020)  (Parm, OutParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_GetPropertyValue_Params
    {
    public:
        LiveLinkInterface::FLiveLinkBasicBlueprintData               BasicData;                                               //  0x0000(0x00B8)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            PropertyName;                                            //  0x00B8(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        Value;                                                   //  0x00C0(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x00C4(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_GetParent_Params
    {
    public:
        LiveLinkInterface::FLiveLinkTransform                        LiveLinkTransform;                                       //  0x0000(0x0020)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        LiveLinkInterface::FLiveLinkTransform                        Parent;                                                  //  0x0020(0x0020)  (Parm, OutParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_GetMetadata_Params
    {
    public:
        LiveLinkInterface::FSubjectFrameHandle                       SubjectFrameHandle;                                      //  0x0000(0x0018)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        LiveLinkInterface::FSubjectMetadata                          MetaData;                                                //  0x0018(0x0070)  (Parm, OutParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_GetLiveLinkSubjects_Params
    {
    public:
        bool                                                         bIncludeDisabledSubject;                                 //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bIncludeVirtualSubject;                                  //  0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0x6];                                   //  0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::TArray<LiveLinkInterface::FLiveLinkSubjectKey>   ReturnValue;                                             //  0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_GetLiveLinkSubjectRole_Params
    {
    public:
        LiveLinkInterface::FLiveLinkSubjectName                      SubjectName;                                             //  0x0000(0x0008)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        LiveLinkInterface::ULiveLinkRole*                            ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_GetLiveLinkEnabledSubjectNames_Params
    {
    public:
        bool                                                         bIncludeVirtualSubject;                                  //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0002[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::TArray<LiveLinkInterface::FLiveLinkSubjectName>  ReturnValue;                                             //  0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_GetCurves_Params
    {
    public:
        LiveLinkInterface::FSubjectFrameHandle                       SubjectFrameHandle;                                      //  0x0000(0x0018)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::TMap<BasicTypes::FName, float>                   Curves;                                                  //  0x0018(0x0050)  (Parm, OutParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_GetChildren_Params
    {
    public:
        LiveLinkInterface::FLiveLinkTransform                        LiveLinkTransform;                                       //  0x0000(0x0020)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::TArray<LiveLinkInterface::FLiveLinkTransform>    Children;                                                //  0x0020(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_GetBasicData_Params
    {
    public:
        LiveLinkInterface::FSubjectFrameHandle                       SubjectFrameHandle;                                      //  0x0000(0x0018)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        LiveLinkInterface::FLiveLinkBasicBlueprintData               BasicBlueprintData;                                      //  0x0018(0x00B8)  (Parm, OutParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_GetAnimationStaticData_Params
    {
    public:
        LiveLinkInterface::FSubjectFrameHandle                       SubjectFrameHandle;                                      //  0x0000(0x0018)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        LiveLinkInterface::FLiveLinkSkeletonStaticData               AnimationStaticData;                                     //  0x0018(0x0030)  (Parm, OutParm, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0048(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_GetAnimationFrameData_Params
    {
    public:
        LiveLinkInterface::FSubjectFrameHandle                       SubjectFrameHandle;                                      //  0x0000(0x0018)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        LiveLinkInterface::FLiveLinkAnimationFrameData               AnimationFrameData;                                      //  0x0018(0x00B0)  (Parm, OutParm, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x00C8(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_EvaluateLiveLinkFrameWithSpecificRole_Params
    {
    public:
        LiveLinkInterface::FLiveLinkSubjectName                      SubjectName;                                             //  0x0000(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        LiveLinkInterface::ULiveLinkRole*                            Role;                                                    //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        LiveLinkInterface::FLiveLinkBaseBlueprintData                OutBlueprintData;                                        //  0x0010(0x0008)  (Parm, OutParm, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_EvaluateLiveLinkFrameAtWorldTimeOffset_Params
    {
    public:
        LiveLinkInterface::FLiveLinkSubjectName                      SubjectName;                                             //  0x0000(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        LiveLinkInterface::ULiveLinkRole*                            Role;                                                    //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        WorldTimeOffset;                                         //  0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0003[0x4];                                   //  0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        LiveLinkInterface::FLiveLinkBaseBlueprintData                OutBlueprintData;                                        //  0x0018(0x0008)  (Parm, OutParm, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0020(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_EvaluateLiveLinkFrameAtSceneTime_Params
    {
    public:
        LiveLinkInterface::FLiveLinkSubjectName                      SubjectName;                                             //  0x0000(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        LiveLinkInterface::ULiveLinkRole*                            Role;                                                    //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FTimecode                                       SceneTime;                                               //  0x0010(0x0014)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0004[0x4];                                   //  0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        LiveLinkInterface::FLiveLinkBaseBlueprintData                OutBlueprintData;                                        //  0x0028(0x0008)  (Parm, OutParm, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0030(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_EvaluateLiveLinkFrame_Params
    {
    public:
        LiveLinkInterface::FLiveLinkSubjectRepresentation            SubjectRepresentation;                                   //  0x0000(0x0010)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
        LiveLinkInterface::FLiveLinkBaseBlueprintData                OutBlueprintData;                                        //  0x0010(0x0008)  (Parm, OutParm, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_ComponentSpaceTransform_Params
    {
    public:
        LiveLinkInterface::FLiveLinkTransform                        LiveLinkTransform;                                       //  0x0000(0x0020)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        CoreUObject::FTransform                                      Transform;                                               //  0x0020(0x0030)  (Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkBlueprintLibrary_ChildCount_Params
    {
    public:
        LiveLinkInterface::FLiveLinkTransform                        LiveLinkTransform;                                       //  0x0000(0x0020)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        int32_t                                                      ReturnValue;                                             //  0x0020(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkComponent_GetSubjectDataAtWorldTime_Params
    {
    public:
        BasicTypes::FName                                            SubjectName;                                             //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        WorldTime;                                               //  0x0008(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bSuccess;                                                //  0x000C(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x3];                                   //  0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        LiveLinkInterface::FSubjectFrameHandle                       SubjectFrameHandle;                                      //  0x0010(0x0018)  (Parm, OutParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkComponent_GetSubjectDataAtSceneTime_Params
    {
    public:
        BasicTypes::FName                                            SubjectName;                                             //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FTimecode                                       SceneTime;                                               //  0x0008(0x0014)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bSuccess;                                                //  0x001C(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0x3];                                   //  0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        LiveLinkInterface::FSubjectFrameHandle                       SubjectFrameHandle;                                      //  0x0020(0x0018)  (Parm, OutParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkComponent_GetSubjectData_Params
    {
    public:
        BasicTypes::FName                                            SubjectName;                                             //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bSuccess;                                                //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0002[0x7];                                   //  0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        LiveLinkInterface::FSubjectFrameHandle                       SubjectFrameHandle;                                      //  0x0010(0x0018)  (Parm, OutParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkComponent_GetAvailableSubjectNames_Params
    {
    public:
        BasicTypes::TArray<BasicTypes::FName>                        SubjectNames;                                            //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkMessageBusFinder_GetAvailableProviders_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::FLatentActionInfo                                    LatentInfo;                                              //  0x0008(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
        float                                                        Duration;                                                //  0x0020(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::TArray<LiveLink::FProviderPollResult>            AvailableProviders;                                      //  0x0028(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkMessageBusFinder_ConstructMessageBusFinder_Params
    {
    public:
        LiveLink::ULiveLinkMessageBusFinder*                         ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkMessageBusFinder_ConnectToProvider_Params
    {
    public:
        LiveLink::FProviderPollResult                                Provider;                                                //  0x0000(0x0040)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        LiveLinkInterface::FLiveLinkSourceHandle                     SourceHandle;                                            //  0x0040(0x0018)  (Parm, OutParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkPreset_BuildFromClient_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkPreset_ApplyToClientLatent_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::FLatentActionInfo                                    LatentInfo;                                              //  0x0008(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkPreset_ApplyToClient_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULiveLinkPreset_AddToClient_Params
    {
    public:
        bool                                                         bRecreatePresets;                                        //  0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
