#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "Engine_FPoseLink.h"

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::Locomotion
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_UpperBody_U_R_Params
    {
    public:
        Engine::FPoseLink                                            InPose_UpperBody_U_R;                                    //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            UpperBody_U_R;                                           //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_UpperBody_L_Additive_Params
    {
    public:
        Engine::FPoseLink                                            InPose_UpperBody_L_Additive;                             //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            UpperBody_L_Additive;                                    //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_UpperBody_L_Params
    {
    public:
        Engine::FPoseLink                                            InPose_UpperBody_L;                                      //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            UpperBody_L;                                             //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_UpperBody_U_Params
    {
    public:
        Engine::FPoseLink                                            InPose_UpperBody_U;                                      //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            UpperBody_U;                                             //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_FullBody_Params
    {
    public:
        Engine::FPoseLink                                            InPose_FullBody;                                         //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            FullBody;                                                //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_Motion_M_Params
    {
    public:
        Engine::FPoseLink                                            InPose_Motion_M;                                         //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            Motion_M;                                                //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_LocomotionLayer_Params
    {
    public:
        Engine::FPoseLink                                            LocomotionLayer;                                         //  0x0000(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_AnimGraph_Params
    {
    public:
        Engine::FPoseLink                                            AnimGraph;                                               //  0x0000(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Locomotion_AnimGraphNode_TransitionResult_7F129FD34DE4117A482F4E8AED6CB5AB_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Locomotion_AnimGraphNode_TransitionResult_1B39928646F76AC14F3489A1B3BCFBA8_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Locomotion_AnimGraphNode_TransitionResult_65AFBFE243EF0F7F205E2CA1625599D5_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Locomotion_AnimGraphNode_TransitionResult_0020D1864BF4D6D7C898FA8EE8E6EFF1_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Locomotion_AnimGraphNode_TransitionResult_1DA365E94B956F802CED7E95385B811F_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Locomotion_AnimGraphNode_TransitionResult_0C9F309748BD162A17FE6886105BA852_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Locomotion_AnimGraphNode_TransitionResult_4493892A496BF91BB06913BFD7170CA3_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Locomotion_AnimGraphNode_TransitionResult_9017B1284AC02C7BAFB3F7916C7A557D_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Locomotion_AnimGraphNode_TransitionResult_B15439DD4FD91319C4E162A9385EF8BC_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Locomotion_AnimGraphNode_BlendSpacePlayer_0DC123FE4FED828A22CDB99DAF40B074_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Locomotion_AnimGraphNode_TransitionResult_92DD829D485854F9C94643A7328F5570_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Locomotion_AnimGraphNode_TransitionResult_D5FAE7AE4C4919BFF2E5A7B3C90226F1_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Locomotion_AnimGraphNode_TransitionResult_EED622AF46FD21CEAF10A5ACB107F11A_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Locomotion_AnimGraphNode_TransitionResult_5697533E43E5DFA3C950C0B8CBF953CF_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Locomotion_AnimGraphNode_TransitionResult_B19CA08F40BE2A5ED07AC6A7724C0F06_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Locomotion_AnimGraphNode_TransitionResult_77C7FE8046D148AD611334A70AB08352_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Locomotion_AnimGraphNode_TransitionResult_3319593F410F82EB051771A9EE2CEDD7_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Locomotion_AnimGraphNode_TransitionResult_940F3DB042FB2C7F415F2BB3A3ADF1D6_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Locomotion_AnimGraphNode_TransitionResult_30D34C2D4BB47EEE55DBC69B126E8C97_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Locomotion_AnimGraphNode_TransitionResult_494777FB409D12D3E9688FAC46AFC835_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_BlueprintUpdateAnimation_Params
    {
    public:
        float                                                        DeltaTimeX;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_BlueprintLinkedAnimationLayersInitialized_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ULocomotion_C_ExecuteUbergraph_Locomotion_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
