#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "M1_FM1AbilityProjectilePathData_NetQuantize.h"
#include "M1_FM1AbilityProjectilePathData.h"
#include "M1_FM1AbilityProjectilePathPredictionParams_CustomArc.h"
#include "M1_FM1AbilityProjectilePathFollowDebugDrawParams.h"
#include "M1_FM1AbilityEvent.h"
#include "BasicTypes_TArray.h"
#include "Engine_FHitResult.h"
#include "BasicTypes_FName.h"
#include "CoreUObject_FVector.h"
#include "Engine_ENUMS.h"
#include "GameplayTags_FGameplayTagContainer.h"
#include "M1_FM1AbilityId.h"
#include "GameplayTags_FGameplayTag.h"
#include "M1Data_ENUMS.h"
#include "M1_FM1CalcDamageInfo.h"
#include "M1_ENUMS.h"
#include "M1_FM1AbilityTargetInfoHandle.h"
#include "M1_FM1AbilityContextHandle.h"
#include "M1_FM1AbilityOwnerInfo.h"
#include "M1Data_FM1AbilityData.h"
#include "M1_FM1ActiveAbilityOperationId.h"
#include "M1_FM1AbilityOperationParam.h"
#include "M1_FM1AbilityAssetPreload.h"
#include "CoreUObject_FTransform.h"
#include "CoreUObject_FRotator.h"
#include "M1_FM1FXParam.h"
#include "M1_FM1AbilityCollisionTargetingRule.h"
#include "M1Data_FM1AbilityActorData.h"

namespace CG::M1 { class AM1MissionTaskActorMultiCollection; };
namespace CG::M1 { class AM1MissionTaskActorMultiAssassination; };
namespace CG::M1 { class UM1UIStatGroupItem; };
namespace CG::M1 { class UM1UIInvasionDungeonScoreItem; };
namespace CG::M1 { class UM1UIJunkFilterIndividual; };
namespace CG::M1 { class UM1UIDataItemInfo_Rune; };
namespace CG::M1 { class UM1RequestSupportData; };
namespace CG::M1 { class UM1UIDialog; };
namespace CG::M1 { class UM1RepTestComponent; };
namespace CG::M1 { class AM1MissionTaskActorDynamicGoalActor; };
namespace CG::M1 { class UM1UIDataTaskSteal; };
namespace CG::M1 { class UM1InventoryItemRune; };
namespace CG::M1 { class UM1UIDataStatusEffectInfo; };
namespace CG::M1 { class UM1UIPixelHitTestImage; };
namespace CG::M1 { class UM1UIGameplayDebugViewer; };
namespace CG::M1 { class UM1UIDataMapInfo; };
namespace CG::M1 { class UM1MissionControlComponent; };
namespace CG::M1 { class UM1Notification; };
namespace CG::M1 { class UM1Account; };
namespace CG::M1 { class UM1UIDataShopGoodsInfo_BattlePass; };
namespace CG::M1 { class AM1RotatableUpperBody; };
namespace CG::M1 { class UM1TextBlock; };
namespace CG::M1 { class UM1UITabButton; };
namespace CG::M1 { class UM1UIDataAccountInfo; };
namespace CG::M1 { class UM1OverflowTextBlock; };
namespace CG::M1 { class UM1UIChildMissionGuide; };
namespace CG::M1 { class UM1UIPresetLoadoutSlot; };
namespace CG::M1 { class UM1UIEquipmentSlot; };
namespace CG::M1 { class UM1UIDataQuest; };
namespace CG::M1 { class UM1UIRadialMenuButton; };
namespace CG::M1 { class UM1UICurrency; };
namespace CG::M1 { class UM1UIDataItemInfo_Equipment; };
namespace CG::M1 { class UM1UIEquipmentItemDetails; };
namespace CG::M1 { class UM1UIDataTooltip; };
namespace CG::M1 { class UM1UIDataTooltip2; };
namespace CG::M1 { class UM1UIDataTooltip3; };
namespace CG::M1 { class UM1UITabControlContent; };
namespace CG::M1 { class UM1UIDataItemInfo_Consumable; };
namespace CG::Engine { class UMaterialInstance; };
namespace CG::M1 { class UM1UIDataRuneSocket; };
namespace CG::M1 { class UM1UIRune; };
namespace CG::M1 { class UM1UIDataEliteMonsterAbility; };
namespace CG::M1 { class UM1UIToggle; };
namespace CG::Paper2D { class UPaperFlipbook; };
namespace CG::M1 { class UM1UIDataMissionInfo; };
namespace CG::M1 { class UM1UIRuneSocket; };
namespace CG::M1 { class UM1PerkAbility; };
namespace CG::M1 { class UM1Toast; };
namespace CG::M1 { class UM1UIWorldMapObject; };
namespace CG::M1 { class UM1MapEntity; };
namespace CG::M1 { class AM1AbilityProjectile; };
namespace CG::UMG { class UImage; };
namespace CG::UMG { class UTextLayoutWidget; };
namespace CG::UMG { class UWidgetTree; };
namespace CG::M1 { class AM1WireDestination; };
namespace CG::M1 { class UM1MonsterPartsComponent; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::M1
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AM1ActorPreviewStage_UseStageCamera_Params
    {
    public:
        CinematicCamera::UCineCameraComponent*                       ReturnValue;                                             //  0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1ActorPreviewStage_UseControlledPawnCamera_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1ActorPreviewStage_SetZoomAlpha_Params
    {
    public:
        float                                                        InZoomAlpha;                                             //  0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1ActorPreviewStage_RotatePreviewActor_Params
    {
    public:
        float                                                        InAngle;                                                 //  0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1ActorPreviewStage_GetPreviewingActor_Params
    {
    public:
        Engine::AActor*                                              ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1ActorPreviewStage_BP_GetCameraComponent_Params
    {
    public:
        CinematicCamera::UCineCameraComponent*                       ReturnValue;                                             //  0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityProjectilePathFollowComponent_NetMulticast_BeginPathSimulation_Params
    {
    public:
        M1::FM1AbilityProjectilePathData_NetQuantize                 PathData;                                                //  0x0000(0x0020)  (ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
        float                                                        MovementSpeed;                                           //  0x0020(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityProjectilePathFollowComponent_ModifyPathData_Params
    {
    public:
        M1::FM1AbilityProjectilePathData                             PathData;                                                //  0x0000(0x0010)  (Parm, NativeAccessSpecifierPublic)
        float                                                        MovementSpeed;                                           //  0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::FM1AbilityProjectilePathData                             ReturnValue;                                             //  0x0018(0x0010)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityProjectilePathFollowComponent_BeginPathSimulation_CustomArc_Params
    {
    public:
        M1::FM1AbilityProjectilePathPredictionParams_CustomArc       PredictionParams;                                        //  0x0000(0x0048)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        float                                                        MovementSpeed;                                           //  0x0048(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1AbilityProjectilePathFollowDebugDrawParams            DebugDrawParams;                                         //  0x004C(0x0064)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x00B0(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTarget_GetTargets_Params
    {
    public:
        Engine::AActor*                                              TargetingActor;                                          //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0008(0x0040)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::TArray<Engine::FHitResult>                       OutHitResults;                                           //  0x0048(0x0010)  (Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
        BasicTypes::TArray<Engine::AActor*>                          OutActors;                                               //  0x0058(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_ApplyRootMotionMoveToForce_ApplyRootMotionMoveToForce_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            TaskInstanceName;                                        //  0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FVector                                         TargetLocation;                                          //  0x0010(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        Duration;                                                //  0x001C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bSetNewMovementMode;                                     //  0x0020(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::EMovementMode                                        MovementMode;                                            //  0x0021(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bRestrictSpeedToExpected;                                //  0x0022(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x5];                                   //  0x0023(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::UCurveVector*                                        PathOffsetCurve;                                         //  0x0028(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UCurveFloat*                                         TimeMappingCurve;                                        //  0x0030(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UCurveVector*                                        MovePathFractionCurve;                                   //  0x0038(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::ERootMotionFinishVelocityMode                        VelocityOnFinishMode;                                    //  0x0040(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0x3];                                   //  0x0041(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FVector                                         SetVelocityOnFinish;                                     //  0x0044(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        ClampVelocityOnFinish;                                   //  0x0050(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bDisableDestinationReachedInterrupt;                     //  0x0054(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bEnableGravity;                                          //  0x0055(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bEnableGravityWhenFalling;                               //  0x0056(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0002[0x1];                                   //  0x0057(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityTask_ApplyRootMotionMoveToForce*               ReturnValue;                                             //  0x0058(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_ApplyRootMotionMoveToForce_ApplyRootMotionMoveToActorForce_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            TaskInstanceName;                                        //  0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::AActor*                                              TargetActor;                                             //  0x0010(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FVector                                         TargetLocationOffset;                                    //  0x0018(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0003[0x4];                                   //  0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::UCurveFloat*                                         TargetLerpSpeedHorizontal;                               //  0x0028(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UCurveFloat*                                         TargetLerpSpeedVertical;                                 //  0x0030(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        Duration;                                                //  0x0038(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bSetNewMovementMode;                                     //  0x003C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::EMovementMode                                        MovementMode;                                            //  0x003D(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bRestrictSpeedToExpected;                                //  0x003E(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0004[0x1];                                   //  0x003F(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::UCurveVector*                                        PathOffsetCurve;                                         //  0x0040(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UCurveFloat*                                         TimeMappingCurve;                                        //  0x0048(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UCurveVector*                                        MovePathFractionCurve;                                   //  0x0050(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::ERootMotionFinishVelocityMode                        VelocityOnFinishMode;                                    //  0x0058(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0005[0x3];                                   //  0x0059(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FVector                                         SetVelocityOnFinish;                                     //  0x005C(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        ClampVelocityOnFinish;                                   //  0x0068(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bDisableDestinationReachedInterrupt;                     //  0x006C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bEnableGravity;                                          //  0x006D(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bEnableGravityWhenFalling;                               //  0x006E(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0006[0x1];                                   //  0x006F(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityTask_ApplyRootMotionMoveToForce*               ReturnValue;                                             //  0x0070(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_MoveToLocation_MoveToLocation_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FVector                                         Location;                                                //  0x0008(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        Duration;                                                //  0x0014(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UCurveFloat*                                         OptionalInterpolationCurve;                              //  0x0018(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UCurveVector*                                        OptionalVectorInterpolationCurve;                        //  0x0020(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bFinishImmediatelyOnReachedTargetLocation;               //  0x0028(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0029(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityTask_MoveToLocation*                           ReturnValue;                                             //  0x0030(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_PlayMontageAndWait_StopMontage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_PlayMontageAndWait_PlayMontageAndWaitForEvent_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UAnimMontage*                                        MontageToPlay;                                           //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        GameplayTags::FGameplayTagContainer                          EventTags;                                               //  0x0010(0x0020)  (Parm, NativeAccessSpecifierPublic)
        float                                                        Rate;                                                    //  0x0030(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            StartSection;                                            //  0x0034(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bRotateToViewDir;                                        //  0x003C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bStopWhenAbilityEnds;                                    //  0x003D(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bDisableUpdateRateOptimizations;                         //  0x003E(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x1];                                   //  0x003F(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        AnimRootMotionTranslationScale;                          //  0x0040(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0x4];                                   //  0x0044(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityTask_PlayMontageAndWait*                       ReturnValue;                                             //  0x0048(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_PlayMontageAndWait_PlayLoopMontageAndWaitForEvent_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UAnimMontage*                                        MontageToPlay;                                           //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        GameplayTags::FGameplayTagContainer                          EventTags;                                               //  0x0010(0x0020)  (Parm, NativeAccessSpecifierPublic)
        float                                                        Rate;                                                    //  0x0030(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        TotalDuration;                                           //  0x0034(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bRotateToViewDir;                                        //  0x0038(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bStopWhenAbilityEnds;                                    //  0x0039(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bDisableUpdateRateOptimizations;                         //  0x003A(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0002[0x1];                                   //  0x003B(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        AnimRootMotionTranslationScale;                          //  0x003C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::UM1AbilityTask_PlayMontageAndWait*                       ReturnValue;                                             //  0x0040(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_PlayMontageAndWait_PlayLoopCountMontageAndWaitForEvent_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UAnimMontage*                                        MontageToPlay;                                           //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        GameplayTags::FGameplayTagContainer                          EventTags;                                               //  0x0010(0x0020)  (Parm, NativeAccessSpecifierPublic)
        float                                                        Rate;                                                    //  0x0030(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            StartSection;                                            //  0x0034(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      LoopCount;                                               //  0x003C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bUseJumpSectionFromLoop;                                 //  0x0040(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0003[0x3];                                   //  0x0041(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::FName                                            JumpSectionFromLoop;                                     //  0x0044(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bRotateToViewDir;                                        //  0x004C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bStopWhenAbilityEnds;                                    //  0x004D(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bDisableUpdateRateOptimizations;                         //  0x004E(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0004[0x1];                                   //  0x004F(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        AnimRootMotionTranslationScale;                          //  0x0050(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0005[0x4];                                   //  0x0054(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityTask_PlayMontageAndWait*                       ReturnValue;                                             //  0x0058(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_PlayMontageAndWait_JumpSection_Params
    {
    public:
        BasicTypes::FName                                            SectionName;                                             //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_PlayMontageAndWait_JumpEndSection_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitAbilityDeactivated_WaitAbilityDeactivated_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1AbilityId                                             TargetAbilityId;                                         //  0x0008(0x0010)  (ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::AActor*                                              OptionalExternalTarget;                                  //  0x0018(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::UM1AbilityTask_WaitAbilityDeactivated*                   ReturnValue;                                             //  0x0020(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitAbilityDeactivated_OnAbilityDeactivatedCallback_Params
    {
    public:
        M1::FM1AbilityId                                             InAbilityId;                                             //  0x0000(0x0010)  (ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         InbCanceled;                                             //  0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitAbilityEventBase_OnTargetActorDestroyed_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitAbilityEventBase_OnAbilityEventCallback_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        Engine::AActor*                                              EventActor;                                              //  0x0040(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitAbilityEvent_WaitAbilityEventFromTargetQuery_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        GameplayTags::FGameplayTagContainer                          Tags;                                                    //  0x0008(0x0020)  (Parm, NativeAccessSpecifierPublic)
        GameplayTags::FGameplayTag                                   TargetQueryTag;                                          //  0x0028(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1Data::EM1RelationsCheckType                                RelationsCheckType;                                      //  0x0030(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bOnlyTriggerOnce;                                        //  0x0031(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x6];                                   //  0x0032(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityTask_WaitAbilityEvent*                         ReturnValue;                                             //  0x0038(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitAbilityEvent_WaitAbilityEvent_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        GameplayTags::FGameplayTagContainer                          Tags;                                                    //  0x0008(0x0020)  (Parm, NativeAccessSpecifierPublic)
        Engine::AActor*                                              OptionalExternalTarget;                                  //  0x0028(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bOnlyTriggerOnce;                                        //  0x0030(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0x7];                                   //  0x0031(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityTask_WaitAbilityEvent*                         ReturnValue;                                             //  0x0038(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitDamageEvent_WaitGiveDamageEvent_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        GameplayTags::FGameplayTagContainer                          FilterDamageTraitTags;                                   //  0x0008(0x0020)  (Parm, NativeAccessSpecifierPublic)
        bool                                                         bTraitTagHasAny;                                         //  0x0028(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bIncludeImmuneDamage;                                    //  0x0029(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x6];                                   //  0x002A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::AActor*                                              OptionalExternalTarget;                                  //  0x0030(0x0008)  (Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bOnlyTriggerOnce;                                        //  0x0038(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0x7];                                   //  0x0039(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityTask_WaitDamageEvent*                          ReturnValue;                                             //  0x0040(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitDamageEvent_WaitGetDamageEvent_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        GameplayTags::FGameplayTagContainer                          FilterDamageTraitTags;                                   //  0x0008(0x0020)  (Parm, NativeAccessSpecifierPublic)
        bool                                                         bTraitTagHasAny;                                         //  0x0028(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bIncludeImmuneDamage;                                    //  0x0029(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0002[0x6];                                   //  0x002A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::AActor*                                              OptionalExternalTarget;                                  //  0x0030(0x0008)  (Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bOnlyTriggerOnce;                                        //  0x0038(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0003[0x7];                                   //  0x0039(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityTask_WaitDamageEvent*                          ReturnValue;                                             //  0x0040(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitDamageEvent_M1AbilityWaitDamageEventDelegate__DelegateSignature_Params
    {
    public:
        M1::FM1CalcDamageInfo                                        DamageInfo;                                              //  0x0000(0x0138)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitDelay_WaitDelay_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        InTime;                                                  //  0x0008(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      InNumLoops;                                              //  0x000C(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::UM1AbilityTask_WaitDelay*                                ReturnValue;                                             //  0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitDelay_TaskDelayDelegate__DelegateSignature_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitTick_WaitTick_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::UM1AbilityTask_WaitTick*                                 ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitTick_TaskWaitTickDelegate__DelegateSignature_Params
    {
    public:
        float                                                        DeltaTime;                                               //  0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitTimeLineEvent_WaitTimelineMultiEvent_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UCurveFloat*                                         InTimeline;                                              //  0x0008(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::TArray<float>                                    InGraceTimes;                                            //  0x0010(0x0010)  (ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
        bool                                                         InbLooping;                                              //  0x0020(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0021(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityTask_WaitTimeLineEvent*                        ReturnValue;                                             //  0x0028(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitTimeLineEvent_WaitTimelineEvent_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UCurveFloat*                                         InTimeline;                                              //  0x0008(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        InGraceTime;                                             //  0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         InbLooping;                                              //  0x0014(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0x3];                                   //  0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityTask_WaitTimeLineEvent*                        ReturnValue;                                             //  0x0018(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitTimeLineEvent_TaskWaitTimeLineEventDelegate__DelegateSignature_Params
    {
    public:
        float                                                        GraceTime;                                               //  0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        EventTime;                                               //  0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        PassedTime;                                              //  0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitTimeLineEvent_SetTimePosition_Params
    {
    public:
        float                                                        InPos;                                                   //  0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bCalcDelta;                                              //  0x0004(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitTimeLineEvent_SetTimeline_Params
    {
    public:
        Engine::UCurveFloat*                                         InTimeline;                                              //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitTimeLineEvent_Reset_Params
    {
    public:
        bool                                                         bCalcDelta;                                              //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitTimeLineEvent_GetTimePosition_Params
    {
    public:
        float                                                        ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_LocalWaitInput_OnInputCallback_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_LocalWaitInput_LocalWaitInput_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::EM1BattleKey                                             InGameKey;                                               //  0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::EInputEvent                                          InInputEvent;                                            //  0x0009(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bTaskEndOnInput;                                         //  0x000A(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x5];                                   //  0x000B(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityTask_LocalWaitInput*                           ReturnValue;                                             //  0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitQueryTagEvent_WaitQueryTagRemoved_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        GameplayTags::FGameplayTag                                   QueryTag;                                                //  0x0008(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::AActor*                                              OptionalExternalTarget;                                  //  0x0010(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bOnlyTriggerOnce;                                        //  0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0019(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityTask_WaitQueryTagEvent*                        ReturnValue;                                             //  0x0020(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitQueryTagEvent_WaitQueryTagAddOrRemove_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        GameplayTags::FGameplayTag                                   QueryTag;                                                //  0x0008(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::AActor*                                              OptionalExternalTarget;                                  //  0x0010(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bOnlyTriggerOnce;                                        //  0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0x7];                                   //  0x0019(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityTask_WaitQueryTagEvent*                        ReturnValue;                                             //  0x0020(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitQueryTagEvent_WaitQueryTagAdded_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        GameplayTags::FGameplayTag                                   QueryTag;                                                //  0x0008(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::AActor*                                              OptionalExternalTarget;                                  //  0x0010(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bOnlyTriggerOnce;                                        //  0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0002[0x7];                                   //  0x0019(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityTask_WaitQueryTagEvent*                        ReturnValue;                                             //  0x0020(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitQueryTagEvent_OnQueryTagEvent__DelegateSignature_Params
    {
    public:
        GameplayTags::FGameplayTag                                   InTag;                                                   //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         InAdded;                                                 //  0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitStatusEffectBlocked_WaitStatusEffectBlocked_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        GameplayTags::FGameplayTagContainer                          BlockedStatusEffectIdTags;                               //  0x0008(0x0020)  (Parm, NativeAccessSpecifierPublic)
        Engine::AActor*                                              OptionalExternalTarget;                                  //  0x0028(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bOnlyTriggerOnce;                                        //  0x0030(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0031(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityTask_WaitStatusEffectBlocked*                  ReturnValue;                                             //  0x0038(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitStatusEffectBlocked_OnWaitStatusEffectBlocked__DelegateSignature_Params
    {
    public:
        GameplayTags::FGameplayTag                                   BlockedTagId;                                            //  0x0000(0x0008)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitStatusEffectBlocked_OnStatusEffectRemoved_Params
    {
    public:
        GameplayTags::FGameplayTagContainer                          InBlockedStatusEffectIdTags;                             //  0x0000(0x0020)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitStatusEffectBlocked_OnStatusEffectImmuned_Params
    {
    public:
        GameplayTags::FGameplayTagContainer                          InBlockedStatusEffectIdTags;                             //  0x0000(0x0020)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_SetContextTargetInfo_Params
    {
    public:
        M1::FM1AbilityTargetInfoHandle                               TargetInfoHandle;                                        //  0x0000(0x0020)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_ServerRequestCancelAbility_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_ServerDeferredApplyTask_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_RemoveTaggedVariant_Params
    {
    public:
        GameplayTags::FGameplayTag                                   Tag;                                                     //  0x0000(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            VariantName;                                             //  0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_NetMulticastDeactivateAbility_Params
    {
    public:
        bool                                                         InbCanceled;                                             //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_NetMulticastActivateAbility_Params
    {
    public:
        M1::FM1AbilityContextHandle                                  InHandle;                                                //  0x0000(0x0010)  (Parm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_IsSimulated_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_IsRemoteAutonomous_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_IsLocallyControlled_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_IsAutonomous_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_IsActive_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_IncrementTaggedIntVariant_Params
    {
    public:
        GameplayTags::FGameplayTag                                   Tag;                                                     //  0x0000(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            VariantName;                                             //  0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_HasTraitTag_Params
    {
    public:
        GameplayTags::FGameplayTag                                   InTraitTag;                                              //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_GetVelocityAndRangeMultiplier_Params
    {
    public:
        float                                                        ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_GetQueryServiceComponent_Params
    {
    public:
        M1::UM1QueryServiceComponent*                                ReturnValue;                                             //  0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_GetOwnerPlayerController_Params
    {
    public:
        Engine::APlayerController*                                   ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_GetOwnerInfo_Params
    {
    public:
        M1::FM1AbilityOwnerInfo                                      ReturnValue;                                             //  0x0000(0x0038)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_GetOwnerController_Params
    {
    public:
        Engine::AController*                                         ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_GetOwnerActor_Params
    {
    public:
        Engine::AActor*                                              ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_GetMovementComponent_Params
    {
    public:
        Engine::UMovementComponent*                                  ReturnValue;                                             //  0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_GetDurationMultiplier_Params
    {
    public:
        float                                                        ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_GetAbilityTargetInfo_Params
    {
    public:
        M1::FM1AbilityTargetInfoHandle                               ReturnValue;                                             //  0x0000(0x0020)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_GetAbilityInstigator_Params
    {
    public:
        Engine::AActor*                                              ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_GetAbilityId_Params
    {
    public:
        M1::FM1AbilityId                                             ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_GetAbilityData_Params
    {
    public:
        M1Data::FM1AbilityData                                       ReturnValue;                                             //  0x0000(0x0070)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_GetAbilityContextHandle_Params
    {
    public:
        M1::FM1AbilityContextHandle                                  ReturnValue;                                             //  0x0000(0x0010)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_GetAbilityComponent_Params
    {
    public:
        M1::UM1AbilityComponent*                                     ReturnValue;                                             //  0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_EndOperationsFromSelfByTag_Params
    {
    public:
        GameplayTags::FGameplayTagContainer                          InTags;                                                  //  0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_EndOperationsFromSelf_Params
    {
    public:
        BasicTypes::TArray<M1::FM1ActiveAbilityOperationId>          ActiveOperationIds;                                      //  0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_EndOperationFromSelf_Params
    {
    public:
        M1::FM1ActiveAbilityOperationId                              ActiveOperationId;                                       //  0x0000(0x0010)  (Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_EndAllOperationsFromSelf_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_BP_StartOperationsToSelfByTag_Params
    {
    public:
        GameplayTags::FGameplayTagContainer                          InTags;                                                  //  0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
        M1::FM1AbilityOperationParam                                 OpParam;                                                 //  0x0020(0x00B0)  (Parm, ContainsInstancedReference, AdvancedDisplay, NativeAccessSpecifierPublic)
        BasicTypes::TArray<M1::FM1ActiveAbilityOperationId>          ReturnValue;                                             //  0x00D0(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_BP_OnDeactivated_Params
    {
    public:
        bool                                                         bCancelled;                                              //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_BP_OnActivated_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_BP_MakePreloadAssetList_Params
    {
    public:
        M1::FM1AbilityAssetPreload                                   OutAbilityAssetPreload;                                  //  0x0000(0x0040)  (Parm, OutParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_BP_IsNetAuthority_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_BP_EndAbility_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_BP_CancelAbility_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_AddTaggedVectorVariant_Params
    {
    public:
        GameplayTags::FGameplayTag                                   Tag;                                                     //  0x0000(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            VariantName;                                             //  0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FVector                                         Value;                                                   //  0x0010(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_AddTaggedTransformVariant_Params
    {
    public:
        GameplayTags::FGameplayTag                                   Tag;                                                     //  0x0000(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            VariantName;                                             //  0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FTransform                                      Value;                                                   //  0x0010(0x0030)  (Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_AddTaggedRotatorVariant_Params
    {
    public:
        GameplayTags::FGameplayTag                                   Tag;                                                     //  0x0000(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            VariantName;                                             //  0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FRotator                                        Value;                                                   //  0x0010(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_AddTaggedNameVariant_Params
    {
    public:
        GameplayTags::FGameplayTag                                   Tag;                                                     //  0x0000(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            VariantName;                                             //  0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            Value;                                                   //  0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_AddTaggedIntVariant_Params
    {
    public:
        GameplayTags::FGameplayTag                                   Tag;                                                     //  0x0000(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            VariantName;                                             //  0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      Value;                                                   //  0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_AddTaggedFloatVariant_Params
    {
    public:
        GameplayTags::FGameplayTag                                   Tag;                                                     //  0x0000(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            VariantName;                                             //  0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        Value;                                                   //  0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1Ability_AddTaggedBoolVariant_Params
    {
    public:
        GameplayTags::FGameplayTag                                   Tag;                                                     //  0x0000(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            VariantName;                                             //  0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         Value;                                                   //  0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1Actor_OnRepDataKey_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1Actor_OnComponentCollisionSettingsChanged_Params
    {
    public:
        Engine::UPrimitiveComponent*                                 InComponent;                                             //  0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_StartOverlaps_Params
    {
    public:
        Engine::UPrimitiveComponent*                                 CollisionComponent;                                      //  0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_OnComponentEndOverlap_Params
    {
    public:
        Engine::UPrimitiveComponent*                                 OverlappedComponent;                                     //  0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::AActor*                                              OtherActor;                                              //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UPrimitiveComponent*                                 OtherComp;                                               //  0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      OtherBodyIndex;                                          //  0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_OnComponentBeginOverlap_Params
    {
    public:
        Engine::UPrimitiveComponent*                                 OverlappedComponent;                                     //  0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::AActor*                                              OtherActor;                                              //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UPrimitiveComponent*                                 OtherComp;                                               //  0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      OtherBodyIndex;                                          //  0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bFromSweep;                                              //  0x001C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x3];                                   //  0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::FHitResult                                           SweepResult;                                             //  0x0020(0x009C)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_NetMulticast_DamageEvent_Params
    {
    public:
        M1::FM1CalcDamageInfo                                        InDamageInfo;                                            //  0x0000(0x0138)  (ConstParm, Parm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_NetMulticast_AbilityActorSpawnFXsForAbility_Params
    {
    public:
        BasicTypes::TArray<Engine::AActor*>                          InTargets;                                               //  0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            InName;                                                  //  0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1FXParam                                               InFXParam;                                               //  0x0018(0x0030)  (Parm, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0x8];                                   //  0x0048(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FTransform                                      InTransform;                                             //  0x0050(0x0030)  (Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        InAOEScaleMultiplier;                                    //  0x0080(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_M1AbilityActorComponentEndOverlapDelegate__DelegateSignature_Params
    {
    public:
        Engine::UPrimitiveComponent*                                 OverlappedComponent;                                     //  0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::AActor*                                              OtherActor;                                              //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UPrimitiveComponent*                                 OtherComp;                                               //  0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      OtherBodyIndex;                                          //  0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_GetTargetingRule_Params
    {
    public:
        Engine::UPrimitiveComponent*                                 InCollision;                                             //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1AbilityCollisionTargetingRule                         ReturnValue;                                             //  0x0008(0x000C)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_GetCollisionOverlappingActors_Params
    {
    public:
        Engine::UPrimitiveComponent*                                 InCollision;                                             //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::TArray<Engine::AActor*>                          OverlappingActors;                                       //  0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_GetAbilityTargetInfo_Params
    {
    public:
        M1::FM1AbilityTargetInfoHandle                               ReturnValue;                                             //  0x0000(0x0020)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_GetAbilityInstigator_Params
    {
    public:
        Engine::AActor*                                              ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_GetAbilityContextHandle_Params
    {
    public:
        M1::FM1AbilityContextHandle                                  ReturnValue;                                             //  0x0000(0x0010)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_GetAbilityActorData_Params
    {
    public:
        M1Data::FM1AbilityActorData                                  ReturnValue;                                             //  0x0000(0x0068)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_BP_TryApplyDamageElsewhere_Params
    {
    public:
        M1::FM1CalcDamageInfo                                        InDamageInfo;                                            //  0x0000(0x0138)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0138(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_BP_ReconcileDamage_Params
    {
    public:
        M1::FM1CalcDamageInfo                                        DamageInfo;                                              //  0x0000(0x0138)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
        M1Data::FM1ScaledInteger                                     Damage;                                                  //  0x0138(0x0008)  (Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_BP_OnPostSpawnAbilityActor_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_BP_OnNonImmuneDamaged_Params
    {
    public:
        M1::FM1CalcDamageInfo                                        InDamageInfo;                                            //  0x0000(0x0138)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_BP_OnInstigatorDeath_Params
    {
    public:
        M1::FM1CalcDamageInfo                                        DamageInfo;                                              //  0x0000(0x0138)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_BP_OnDeath_Params
    {
    public:
        M1::FM1CalcDamageInfo                                        InDamageInfo;                                            //  0x0000(0x0138)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_BP_MakePreloadAssetList_Params
    {
    public:
        M1::FM1AbilityAssetPreload                                   OutAbilityAssetPreload;                                  //  0x0000(0x0040)  (Parm, OutParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_BP_GetSimpleCollisionCylinder_Params
    {
    public:
        float                                                        CollisionRadius;                                         //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        CollisionHalfHeight;                                     //  0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_BP_CanBeWiredTo_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_BP_CanAppliedDamage_Params
    {
    public:
        M1::FM1CalcDamageInfo                                        InDamageInfo;                                            //  0x0000(0x0138)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0138(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityActor_AbilityActorComponentBeginOverlapDelegate__DelegateSignature_Params
    {
    public:
        Engine::UPrimitiveComponent*                                 OverlappedComponent;                                     //  0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::AActor*                                              OtherActor;                                              //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UPrimitiveComponent*                                 OtherComp;                                               //  0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      OtherBodyIndex;                                          //  0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bFromSweep;                                              //  0x001C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0002[0x3];                                   //  0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::FHitResult                                           SweepResult;                                             //  0x0020(0x009C)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityAsync_OnOwningAbilityActorDestroyed_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityAsync_EndAction_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityAsync_WaitAbilityEventBase_OnTargetActorDestroyed_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityAsync_WaitAbilityEventBase_OnAbilityEventCallback_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        Engine::AActor*                                              EventActor;                                              //  0x0040(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityAsync_WaitAbilityEvent_WaitAbilityEventToActor_Params
    {
    public:
        M1::AM1AbilityActor*                                         OwningAbilityActor;                                      //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        GameplayTags::FGameplayTagContainer                          Tags;                                                    //  0x0008(0x0020)  (Parm, NativeAccessSpecifierPublic)
        Engine::AActor*                                              OptionalExternalTarget;                                  //  0x0028(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bOnlyTriggerOnce;                                        //  0x0030(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0031(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityAsync_WaitAbilityEvent*                        ReturnValue;                                             //  0x0038(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityAsync_WaitAbilityEvent_WaitAbilityEventFromTargetQuery_Params
    {
    public:
        M1::AM1AbilityActor*                                         OwningAbilityActor;                                      //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        GameplayTags::FGameplayTagContainer                          Tags;                                                    //  0x0008(0x0020)  (Parm, NativeAccessSpecifierPublic)
        GameplayTags::FGameplayTag                                   TargetQueryTag;                                          //  0x0028(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1Data::EM1RelationsCheckType                                RelationsCheckType;                                      //  0x0030(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bOnlyTriggerOnce;                                        //  0x0031(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0x6];                                   //  0x0032(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityAsync_WaitAbilityEvent*                        ReturnValue;                                             //  0x0038(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityAsync_WaitDamageEvent_WaitGiveDamageEventToActor_Params
    {
    public:
        M1::AM1AbilityActor*                                         OwningAbilityActor;                                      //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        GameplayTags::FGameplayTagContainer                          FilterDamageTraitTags;                                   //  0x0008(0x0020)  (Parm, NativeAccessSpecifierPublic)
        bool                                                         bTraitTagHasAny;                                         //  0x0028(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bIncludeImmuneDamage;                                    //  0x0029(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x6];                                   //  0x002A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::AActor*                                              OptionalExternalTarget;                                  //  0x0030(0x0008)  (Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bOnlyTriggerOnce;                                        //  0x0038(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0x7];                                   //  0x0039(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityAsync_WaitDamageEvent*                         ReturnValue;                                             //  0x0040(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityAsync_WaitDamageEvent_WaitGetDamageEventToActor_Params
    {
    public:
        M1::AM1AbilityActor*                                         OwningAbilityActor;                                      //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        GameplayTags::FGameplayTagContainer                          FilterDamageTraitTags;                                   //  0x0008(0x0020)  (Parm, NativeAccessSpecifierPublic)
        bool                                                         bTraitTagHasAny;                                         //  0x0028(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bIncludeImmuneDamage;                                    //  0x0029(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0002[0x6];                                   //  0x002A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::AActor*                                              OptionalExternalTarget;                                  //  0x0030(0x0008)  (Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bOnlyTriggerOnce;                                        //  0x0038(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0003[0x7];                                   //  0x0039(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityAsync_WaitDamageEvent*                         ReturnValue;                                             //  0x0040(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityAsync_WaitDamageEvent_M1AbilityWaitDamageEventDelegate__DelegateSignature_Params
    {
    public:
        M1::FM1CalcDamageInfo                                        DamageInfo;                                              //  0x0000(0x0138)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityAsync_WaitOverlapEvent_WaitOverlapEvent_Params
    {
    public:
        M1::AM1AbilityActor*                                         OwningAbilityActor;                                      //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UPrimitiveComponent*                                 InCollision;                                             //  0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bClearOverlaps;                                          //  0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bStartOverlap;                                           //  0x0011(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bCallEndOverlapWhenTaskEnd;                              //  0x0012(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bOnlyTriggerOnce;                                        //  0x0013(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityAsync_WaitOverlapEvent*                        ReturnValue;                                             //  0x0018(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityAsync_WaitOverlapEvent_OnComponentEndOverlap_Params
    {
    public:
        Engine::UPrimitiveComponent*                                 OverlappedComponent;                                     //  0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::AActor*                                              OtherActor;                                              //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UPrimitiveComponent*                                 OtherComp;                                               //  0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      OtherBodyIndex;                                          //  0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityAsync_WaitOverlapEvent_OnComponentBeginOverlap_Params
    {
    public:
        Engine::UPrimitiveComponent*                                 OverlappedComponent;                                     //  0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::AActor*                                              OtherActor;                                              //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UPrimitiveComponent*                                 OtherComp;                                               //  0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      OtherBodyIndex;                                          //  0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bFromSweep;                                              //  0x001C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0x3];                                   //  0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::FHitResult                                           SweepResult;                                             //  0x0020(0x009C)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityAsync_WaitOverlapEvent_GetOverlappingActors_Params
    {
    public:
        BasicTypes::TArray<Engine::AActor*>                          ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AIPerceptionComponent_OnPerceptionUpdateInfo_Params
    {
    public:
        AIModule::FActorPerceptionUpdateInfo                         InUpdatedInfo;                                           //  0x0000(0x0048)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AIPerceptionComponent_OnPeceptionActorForgotten_Params
    {
    public:
        Engine::AActor*                                              InForgottenActor;                                        //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1ActorSensorComponent_SetDetectionRange_Params
    {
    public:
        float                                                        InRange;                                                 //  0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1ActorSensorComponent_SetDetectionInterval_Params
    {
    public:
        float                                                        InInterval;                                              //  0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1ActorSensorComponent_SetDetectionDegree_Params
    {
    public:
        float                                                        InDegree;                                                //  0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1ActorSensorComponent_SetActorClassesToDetect_Params
    {
    public:
        BasicTypes::TArray<Engine::AActor*>                          InClasses;                                               //  0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, UObjectWrapper, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1ActorSensorComponent_OverrideGetActorDirection_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  InGetActorDirection;                                     //  0x0000(0x0010)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1ActorSensorComponent_GetActorsBeingTraced_Params
    {
    public:
        BasicTypes::TArray<Engine::AActor*>                          ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1ActorSensorComponent_FindActorsInRange_Params
    {
    public:
        BasicTypes::TArray<Engine::AActor*>                          ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1ActorSpawnRule_OnActorDestroyed_Params
    {
    public:
        Engine::AActor*                                              InDestroyedActor;                                        //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1ActorWidgetComponent_ShowWidget_Params
    {
    public:
        bool                                                         InVisible;                                               //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1ActorWidgetComponent_GetActorWidget_Params
    {
    public:
        M1::UM1UIActorWidget*                                        ReturnValue;                                             //  0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1ActorWidgetComponent_CreateActorWidget_Params
    {
    public:
        M1::UM1UIActorWidget*                                        ReturnValue;                                             //  0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BaseAnimInstance_IsMachineInState_Params
    {
    public:
        BasicTypes::FName                                            MachineName;                                             //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            StateName;                                               //  0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BaseAnimInstance_GetSlotMontageWeight_Params
    {
    public:
        BasicTypes::FName                                            SlotName;                                                //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        ReturnValue;                                             //  0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BaseAnimInstance_GetMachineStateWeight_Params
    {
    public:
        BasicTypes::FName                                            MachineName;                                             //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            StateName;                                               //  0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        ReturnValue;                                             //  0x0010(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BaseAnimInstance_FindLinkedAnimLayerInstanceByClass_Params
    {
    public:
        Engine::UAnimInstance*                                       InClass;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            LayerName;                                               //  0x0008(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UAnimInstance*                                       ReturnValue;                                             //  0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityComponent_ServerCancelAbility_Params
    {
    public:
        M1::FM1AbilityId                                             Handle;                                                  //  0x0000(0x0010)  (Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityComponent_NetMulticast_SpawnFXsForAbility_Params
    {
    public:
        M1::UM1Ability*                                              InAbilityCDO;                                            //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::TArray<Engine::AActor*>                          InTargets;                                               //  0x0008(0x0010)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            InName;                                                  //  0x0018(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1FXParam                                               InFXParam;                                               //  0x0020(0x0030)  (Parm, NativeAccessSpecifierPublic)
        CoreUObject::FTransform                                      InTransform;                                             //  0x0050(0x0030)  (Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        InAOEScaleMultiplier;                                    //  0x0080(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1RepSubObject_IsDataInitialized_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1RepSubObject_Initialize_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1RepSubObject_HasAuthority_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1RepSubObject_GetDataRowName_Params
    {
    public:
        BasicTypes::FName                                            ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityEventInterface_HandleAbilityEvent_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        int32_t                                                      ReturnValue;                                             //  0x0040(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityOpModValueCalc_CalculateValue_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
        M1Data::FM1ScaledInteger                                     ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityOpExecCalc_GetTraitTags_Params
    {
    public:
        GameplayTags::FGameplayTagContainer                          ReturnValue;                                             //  0x0000(0x0020)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityOpExecCalc_Execute_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
        M1::FM1AbilityOpExecCalcOutput                               Output;                                                  //  0x0008(0x0010)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityOpExecCalc_Damage_BP_MakeEventObject_Params
    {
    public:
        M1::UM1AbilityEventObject*                                   ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityOpExecCalc_Damage_ApplyWeakness_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
        M1::FM1CalcDamageInfo                                        DamageInfo;                                              //  0x0008(0x0138)  (Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityOpExecCalc_Damage_ApplyElementalDamageByDistance_Params
    {
    public:
        M1Data::EM1ElementalDamageChannel                            Channel;                                                 //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0008(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
        M1Data::FM1ScaledInteger                                     ATKMultiplierByDistance;                                 //  0x0010(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1CalcDamageInfo                                        DamageInfo;                                              //  0x0018(0x0138)  (Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityOpExecCalc_Damage_ApplyAdvantage_Params
    {
    public:
        M1::FM1AbilityOpCalcParam                                    Param;                                                   //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
        M1::FM1CalcDamageInfo                                        DamageInfo;                                              //  0x0008(0x0138)  (Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_StopVFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_SetTrailFX_Params
    {
    public:
        Niagara::UNiagaraSystem*                                     NewTrailFX;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_SetMainFX_Params
    {
    public:
        Niagara::UNiagaraSystem*                                     NewMainFX;                                               //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_SetHomingInfo_Params
    {
    public:
        bool                                                         bEnableHoming;                                           //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::USceneComponent*                                     HomingTargetComponent;                                   //  0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        HomingMagnitude;                                         //  0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_SetExplosionFX_Params
    {
    public:
        Niagara::UNiagaraSystem*                                     NewExplosionFX;                                          //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_ServerWeaponProcessExplosion_Params
    {
    public:
        Engine::FHitResult                                           ExplosionCause;                                          //  0x0000(0x009C)  (ConstParm, Parm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0x4];                                   //  0x009C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::TArray<Engine::FHitResult>                       InExplosionResults;                                      //  0x00A0(0x0010)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
        bool                                                         InbDestroy;                                              //  0x00B0(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_ServerProcessHit_Params
    {
    public:
        Engine::FHitResult                                           HitResult;                                               //  0x0000(0x009C)  (ConstParm, Parm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
        bool                                                         bPenetrated;                                             //  0x009C(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_ServerProcessAttachToActor_Params
    {
    public:
        Engine::FHitResult                                           HitResult;                                               //  0x0000(0x009C)  (ConstParm, Parm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_ProcessHit_Params
    {
    public:
        Engine::AActor*                                              OtherActor;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::FHitResult                                           HitResult;                                               //  0x0008(0x009C)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
        bool                                                         bPenetrated;                                             //  0x00A4(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_ProcessExplosionToActor_Params
    {
    public:
        Engine::AActor*                                              OtherActor;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::FHitResult                                           ExplosionResult;                                         //  0x0008(0x009C)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_ProcessExplosion_Params
    {
    public:
        Engine::AActor*                                              OtherActor;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::FHitResult                                           HitResult;                                               //  0x0008(0x009C)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_ProcessAttachToActor_Params
    {
    public:
        Engine::FHitResult                                           HitResult;                                               //  0x0000(0x009C)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_PlayExplosionVFX_Params
    {
    public:
        CoreUObject::FVector                                         InExplosionLocation;                                     //  0x0000(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_PlayAttachEffect_Params
    {
    public:
        Engine::FHitResult                                           HitResult;                                               //  0x0000(0x009C)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_OnRep_ExploseLocation_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_OnProjectilePassByPlayer_Params
    {
    public:
        Engine::UPrimitiveComponent*                                 OverlappedComponent;                                     //  0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::AActor*                                              OtherActor;                                              //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UPrimitiveComponent*                                 OtherComp;                                               //  0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      OtherBodyIndex;                                          //  0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bFromSweep;                                              //  0x001C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0002[0x3];                                   //  0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::FHitResult                                           SweepResult;                                             //  0x0020(0x009C)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_OnProjectileBounce_Params
    {
    public:
        Engine::FHitResult                                           ImpactResult;                                            //  0x0000(0x009C)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
        CoreUObject::FVector                                         ImpactVelocity;                                          //  0x009C(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_OnDamageCalcBeforeExecute_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_OnAttachedMissionTargetActorDestructed_Params
    {
    public:
        M1::AM1MissionTargetActor*                                   MissionTargetActor;                                      //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::EM1ResetType                                             ResetType;                                               //  0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_OnAttachedFieldInteractableActorDamaged_Params
    {
    public:
        bool                                                         Damaged;                                                 //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_OnAttachedDestructibleActorDestructed_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_OnAttachedCharacterDieOrDBNO_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_NetMulticastProcessAttachToActor_Params
    {
    public:
        Engine::FHitResult                                           HitResult;                                               //  0x0000(0x009C)  (ConstParm, Parm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_NetMulticastDeactivateProjectile_Params
    {
    public:
        Engine::FHitResult                                           HitResult;                                               //  0x0000(0x009C)  (ConstParm, Parm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_NetMulticast_InitializeForPoppedPool_Params
    {
    public:
        CoreUObject::FTransform                                      SpawnTransform;                                          //  0x0000(0x0030)  (ConstParm, Parm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_NetMulticast_FinalizeForPushToPool_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_NetMulticast_DrawDebug_Params
    {
    public:
        CoreUObject::FVector                                         Center;                                                  //  0x0000(0x000C)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        Radius;                                                  //  0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      Segments;                                                //  0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FColor                                          Color;                                                   //  0x0014(0x0004)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        LifeTime;                                                //  0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_MakeWeaponParams_Params
    {
    public:
        BasicTypes::TArray<M1Data::FM1AbilityParamData>              ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_IsAttached_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_IsActivated_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_GetMainFX_Params
    {
    public:
        Niagara::UNiagaraComponent*                                  ReturnValue;                                             //  0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_ExplosionAfterAttached_Params
    {
    public:
        float                                                        InExplosionDelayAfterAttached;                           //  0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_DetachFromAttachedActor_Params
    {
    public:
        Engine::AActor*                                              DestroyedActor;                                          //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_DeactivateProjectile_Params
    {
    public:
        Engine::AActor*                                              HitActor;                                                //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::FHitResult                                           HitResult;                                               //  0x0008(0x009C)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_BP_OnPreProcessHit_Params
    {
    public:
        Engine::AActor*                                              OtherActor;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::FHitResult                                           HitResult;                                               //  0x0008(0x009C)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
        bool                                                         bPenetrated;                                             //  0x00A4(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_BP_OnPostProcessHit_Params
    {
    public:
        Engine::AActor*                                              OtherActor;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::FHitResult                                           HitResult;                                               //  0x0008(0x009C)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
        bool                                                         bPenetrated;                                             //  0x00A4(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_BP_OnDeactivateProjectile_Params
    {
    public:
        Engine::AActor*                                              OtherActor;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::FHitResult                                           HitResult;                                               //  0x0008(0x009C)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_BP_InitializeProjectile_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1AbilityProjectile_BP_CanProcessHit_Params
    {
    public:
        Engine::AActor*                                              OtherActor;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::FHitResult                                           HitResult;                                               //  0x0008(0x009C)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
        bool                                                         bPenetrated;                                             //  0x00A4(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x00A5(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityEventObject_BeforeWeaponExplosionExecute_MakeBeforeWeaponExplosionExecuteEventObject_Params
    {
    public:
        CoreUObject::UObject*                                        InOuter;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::UM1AbilityEventObject_BeforeWeaponExplosionExecute*      ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_SpawnFXsForAbilityToTarget_Params
    {
    public:
        Engine::AActor*                                              InTarget;                                                //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            InName;                                                  //  0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1FXParam                                               InFXParam;                                               //  0x0010(0x0030)  (Parm, AdvancedDisplay, NativeAccessSpecifierPublic)
        CoreUObject::FTransform                                      InTransform;                                             //  0x0040(0x0030)  (Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::TArray<Niagara::UNiagaraComponent*>              ReturnValue;                                             //  0x0070(0x0010)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_SpawnFXsForAbility_Params
    {
    public:
        BasicTypes::FName                                            InName;                                                  //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1FXParam                                               InFXParam;                                               //  0x0008(0x0030)  (Parm, AdvancedDisplay, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x8];                                   //  0x0038(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FTransform                                      InTransform;                                             //  0x0040(0x0030)  (Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::TArray<Niagara::UNiagaraComponent*>              ReturnValue;                                             //  0x0070(0x0010)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_SpawnFirstAbilityActorByTag_Params
    {
    public:
        GameplayTags::FGameplayTagContainer                          InTags;                                                  //  0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
        CoreUObject::FTransform                                      SpawnTransform;                                          //  0x0020(0x0030)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1AbilityContextHandle                                  ForwardingContext;                                       //  0x0050(0x0010)  (Parm, NativeAccessSpecifierPublic)
        M1::AM1AbilityActor*                                         ReturnValue;                                             //  0x0060(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_SpawnAbilityActorDataRowName_Params
    {
    public:
        BasicTypes::FName                                            SpawnAbilityActorRowName;                                //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1Data::EM1AbilityCreatedObjectRemovalPolicy                 RemovalPolicy;                                           //  0x0008(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0x7];                                   //  0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::TArray<M1Data::FM1AbilityParamData>              SpawnParams;                                             //  0x0010(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
        CoreUObject::FTransform                                      SpawnTransform;                                          //  0x0020(0x0030)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1AbilityContextHandle                                  ForwardingContext;                                       //  0x0050(0x0010)  (Parm, NativeAccessSpecifierPublic)
        M1::AM1AbilityActor*                                         ReturnValue;                                             //  0x0060(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_SpawnAbilityActorData_Params
    {
    public:
        M1Data::FM1SpawnAbilityActorData                             SpawnAbilityActorData;                                   //  0x0000(0x0048)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0002[0x8];                                   //  0x0048(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FTransform                                      SpawnTransform;                                          //  0x0050(0x0030)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1AbilityContextHandle                                  ForwardingContext;                                       //  0x0080(0x0010)  (Parm, NativeAccessSpecifierPublic)
        M1::AM1AbilityActor*                                         ReturnValue;                                             //  0x0090(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_RemoveVFXsFromTarget_Params
    {
    public:
        BasicTypes::FName                                            InName;                                                  //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::AActor*                                              InTarget;                                                //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_RemoveVFX_Params
    {
    public:
        BasicTypes::FName                                            InName;                                                  //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_NetMulticast_SpawnHitFXsForAbility_Params
    {
    public:
        BasicTypes::TArray<Engine::AActor*>                          InTargets;                                               //  0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            InName;                                                  //  0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1FXParam                                               InFXParam;                                               //  0x0018(0x0030)  (Parm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_NetMulticast_SpawnFXsForAbility_Params
    {
    public:
        Engine::AActor*                                              InTarget;                                                //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            InName;                                                  //  0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1FXParam                                               InFXParam;                                               //  0x0010(0x0030)  (Parm, NativeAccessSpecifierPublic)
        CoreUObject::FTransform                                      InTransform;                                             //  0x0040(0x0030)  (Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_MakeNiagarasSphereParameter_Params
    {
    public:
        float                                                        InDuration;                                              //  0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        InRadius;                                                //  0x0004(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bScaled;                                                 //  0x0008(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0003[0x7];                                   //  0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::FM1FXParam                                               ReturnValue;                                             //  0x0010(0x0030)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_MakeNiagarasDecalParameter_Params
    {
    public:
        float                                                        InDuration;                                              //  0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        InSize;                                                  //  0x0004(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        InHeight;                                                //  0x0008(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bScaled;                                                 //  0x000C(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0004[0x3];                                   //  0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::FM1FXParam                                               ReturnValue;                                             //  0x0010(0x0030)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_MakeNiagarasBoxParameter_Params
    {
    public:
        float                                                        InDuration;                                              //  0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FVector                                         InBoxExtent;                                             //  0x0004(0x000C)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bScaled;                                                 //  0x0010(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0005[0x7];                                   //  0x0011(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::FM1FXParam                                               ReturnValue;                                             //  0x0018(0x0030)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_InvokeStatusEffectDataToTarget_Params
    {
    public:
        M1Data::FM1InvokeStatusEffectData                            InvokeStatusEffectData;                                  //  0x0000(0x0048)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        Engine::AActor*                                              TargetActor;                                             //  0x0048(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1AbilityContextHandle                                  ForwardingContext;                                       //  0x0050(0x0010)  (Parm, NativeAccessSpecifierPublic)
        M1::FM1AbilityId                                             ReturnValue;                                             //  0x0060(0x0010)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_InvokeStatusEffectDataToSelf_Params
    {
    public:
        M1Data::FM1InvokeStatusEffectData                            InvokeStatusEffectData;                                  //  0x0000(0x0048)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        M1::FM1AbilityContextHandle                                  ForwardingContext;                                       //  0x0048(0x0010)  (Parm, NativeAccessSpecifierPublic)
        M1::FM1AbilityId                                             ReturnValue;                                             //  0x0058(0x0010)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_InvokeFirstStatusEffectToTargetByTag_Params
    {
    public:
        GameplayTags::FGameplayTagContainer                          InTags;                                                  //  0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
        Engine::AActor*                                              TargetActor;                                             //  0x0020(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1AbilityContextHandle                                  ForwardingContext;                                       //  0x0028(0x0010)  (Parm, NativeAccessSpecifierPublic)
        M1::FM1AbilityId                                             ReturnValue;                                             //  0x0038(0x0010)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_InvokeFirstStatusEffectToSelfByTag_Params
    {
    public:
        GameplayTags::FGameplayTagContainer                          InTags;                                                  //  0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
        M1::FM1AbilityContextHandle                                  ForwardingContext;                                       //  0x0020(0x0010)  (Parm, NativeAccessSpecifierPublic)
        M1::FM1AbilityId                                             ReturnValue;                                             //  0x0030(0x0010)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_InvokeAllStatusEffectToTargetsByTag_Params
    {
    public:
        GameplayTags::FGameplayTagContainer                          InTags;                                                  //  0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
        BasicTypes::TArray<Engine::AActor*>                          TargetActors;                                            //  0x0020(0x0010)  (ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
        M1::FM1AbilityContextHandle                                  ForwardingContext;                                       //  0x0030(0x0010)  (Parm, NativeAccessSpecifierPublic)
        BasicTypes::TMap<Engine::AActor*, M1::FM1AbilityIDList>      ReturnValue;                                             //  0x0040(0x0050)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_InvokeAllStatusEffectToTargetByTag_Params
    {
    public:
        GameplayTags::FGameplayTagContainer                          InTags;                                                  //  0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
        Engine::AActor*                                              TargetActor;                                             //  0x0020(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1AbilityContextHandle                                  ForwardingContext;                                       //  0x0028(0x0010)  (Parm, NativeAccessSpecifierPublic)
        BasicTypes::TArray<M1::FM1AbilityId>                         ReturnValue;                                             //  0x0038(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_InvokeAllStatusEffectToSelfByTag_Params
    {
    public:
        GameplayTags::FGameplayTagContainer                          InTags;                                                  //  0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
        M1::FM1AbilityContextHandle                                  ForwardingContext;                                       //  0x0020(0x0010)  (Parm, NativeAccessSpecifierPublic)
        BasicTypes::TArray<M1::FM1AbilityId>                         ReturnValue;                                             //  0x0030(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_GetVelocityAndRangeMultiplier_Params
    {
    public:
        float                                                        ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_GetFirstStatusEffectMaxStackCount_Params
    {
    public:
        GameplayTags::FGameplayTag                                   Tag;                                                     //  0x0000(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      ReturnValue;                                             //  0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_GetDurationMultiplier_Params
    {
    public:
        float                                                        ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_GetAOEScaleMultiplier_Params
    {
    public:
        float                                                        ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_FindSpawnAbilityActorData_Params
    {
    public:
        GameplayTags::FGameplayTagContainer                          InTags;                                                  //  0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
        BasicTypes::TArray<M1Data::FM1SpawnAbilityActorData>         ReturnValue;                                             //  0x0020(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_FindInvokeStatusEffectData_Params
    {
    public:
        GameplayTags::FGameplayTagContainer                          InTags;                                                  //  0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
        BasicTypes::TArray<M1Data::FM1InvokeStatusEffectData>        ReturnValue;                                             //  0x0020(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_EndStatusEffectToTarget_Params
    {
    public:
        Engine::AActor*                                              TargetActor;                                             //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1AbilityId                                             StatusEffectId;                                          //  0x0008(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bCancelled;                                              //  0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_EndStatusEffectToSelf_Params
    {
    public:
        M1::FM1AbilityId                                             StatusEffectId;                                          //  0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bCancelled;                                              //  0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_DecreaseStatusEffectStackCountFromTarget_Params
    {
    public:
        Engine::AActor*                                              TargetActor;                                             //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1AbilityId                                             InvokedStatusEffectId;                                   //  0x0008(0x0010)  (Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      ReturnValue;                                             //  0x0018(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_DecreaseStatusEffectStackCountFromSelf_Params
    {
    public:
        M1::FM1AbilityId                                             InvokedStatusEffectId;                                   //  0x0000(0x0010)  (Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      ReturnValue;                                             //  0x0010(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_BP_TryExecuteCostOperation_Params
    {
    public:
        GameplayTags::FGameplayTag                                   InCostTag;                                               //  0x0000(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1AbilityOperationParam                                 OpParam;                                                 //  0x0008(0x00B0)  (Parm, ContainsInstancedReference, AdvancedDisplay, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x00B8(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_BP_MakeForwardingContext_Params
    {
    public:
        GameplayTags::FGameplayTagContainer                          ForwardingOperationTags;                                 //  0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
        BasicTypes::TArray<BasicTypes::FName>                        ForwardingParamNames;                                    //  0x0020(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::TArray<M1Data::FM1TaggedAbilityParamData>        TaggedParams;                                            //  0x0030(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
        M1::FM1AbilityContextHandle                                  ReturnValue;                                             //  0x0040(0x0010)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_BP_FindFirstSpawnAbilityActorData_Params
    {
    public:
        GameplayTags::FGameplayTagContainer                          InTags;                                                  //  0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
        M1Data::FM1SpawnAbilityActorData                             SpawnAbilityActorData;                                   //  0x0020(0x0048)  (Parm, OutParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_BP_FindFirstInvokeStatusEffectData_Params
    {
    public:
        GameplayTags::FGameplayTagContainer                          InTags;                                                  //  0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
        M1Data::FM1InvokeStatusEffectData                            InvokeStatusEffectData;                                  //  0x0020(0x0048)  (Parm, OutParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_BP_ExecuteOperationsToTargetsByTag_Params
    {
    public:
        GameplayTags::FGameplayTagContainer                          InTags;                                                  //  0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
        BasicTypes::TArray<Engine::AActor*>                          TargetActors;                                            //  0x0020(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
        M1::FM1AbilityOperationParam                                 OpParam;                                                 //  0x0030(0x00B0)  (Parm, ContainsInstancedReference, AdvancedDisplay, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_BP_ExecuteOperationsToTargetByTag_Params
    {
    public:
        GameplayTags::FGameplayTagContainer                          InTags;                                                  //  0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
        Engine::AActor*                                              TargetActor;                                             //  0x0020(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1AbilityOperationParam                                 OpParam;                                                 //  0x0028(0x00B0)  (Parm, ContainsInstancedReference, AdvancedDisplay, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_BP_ExecuteOperationsToSelfByTag_Params
    {
    public:
        GameplayTags::FGameplayTagContainer                          InTags;                                                  //  0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
        M1::FM1AbilityOperationParam                                 OpParam;                                                 //  0x0020(0x00B0)  (Parm, ContainsInstancedReference, AdvancedDisplay, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_ApplyNiagarasSphereParameter_Params
    {
    public:
        BasicTypes::TArray<Niagara::UNiagaraComponent*>              InNiagaras;                                              //  0x0000(0x0010)  (Parm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
        float                                                        InDuration;                                              //  0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        InRadius;                                                //  0x0014(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bScaled;                                                 //  0x0018(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_ApplyNiagarasDecalParameter_Params
    {
    public:
        BasicTypes::TArray<Niagara::UNiagaraComponent*>              InNiagaras;                                              //  0x0000(0x0010)  (Parm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
        float                                                        InDuration;                                              //  0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        InSize;                                                  //  0x0014(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        InHeight;                                                //  0x0018(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bScaled;                                                 //  0x001C(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class IM1AbilityBase_ApplyNiagarasBoxParameter_Params
    {
    public:
        BasicTypes::TArray<Niagara::UNiagaraComponent*>              InNiagaras;                                              //  0x0000(0x0010)  (Parm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
        float                                                        InDuration;                                              //  0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FVector                                         InBoxExtent;                                             //  0x0014(0x000C)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bScaled;                                                 //  0x0020(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AnimInstance_OnHeadAnimInstanceChanged_Params
    {
    public:
        M1::UM1HeadAnimInstance*                                     HeadAnimInstance;                                        //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AnimInstance_OnAnimTypeChanged_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AnimInstance_LinkAnimClassLayersWithLinkedInstances_Params
    {
    public:
        Engine::UAnimInstance*                                       InClass;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AnimInstance_IsLinkiedLayerMachineInState_Params
    {
    public:
        Engine::UAnimInstance*                                       LayerClass;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            MachineName;                                             //  0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            StateName;                                               //  0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AnimInstance_IsInField_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AnimInstance_GetMontageSlotWeight_Params
    {
    public:
        BasicTypes::FName                                            SlotName;                                                //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        ReturnValue;                                             //  0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AnimInstance_GetCurrentAnimLayer_Params
    {
    public:
        M1::EM1LayerAnimSetType                                      InType;                                                  //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Engine::UAnimInstance*                                       ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1BattlePassPreviewStage_SetViewTargetForPreview_Params
    {
    public:
        M1::EM1BattlePassPreviewStageCameraType                      InType;                                                  //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         InBlend;                                                 //  0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1BattlePassPreviewStage_GetViewTargets_Params
    {
    public:
        BasicTypes::TArray<Engine::AActor*>                          ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1CameraModifier_IsFadeOut_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1CameraModifier_IsFadeIn_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BattleStateComponent_OnRepBattleState_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BattleStateComponent_OnRemovedStatusEffect_Params
    {
    public:
        M1::UM1StatusEffect*                                         InStatusEffect;                                          //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BattleStateComponent_OnAddedStatusEffect_Params
    {
    public:
        M1::UM1StatusEffect*                                         InStatusEffect;                                          //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BattleStateComponent_IsInBattleState_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BeamComponent_SetTargetActor_Params
    {
    public:
        Engine::AActor*                                              InTargetActor;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BeamComponent_SetResetHitIntervalOnEscape_Params
    {
    public:
        bool                                                         bInResetHitIntervalOnEscape;                             //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BeamComponent_SetPenetrableType_Params
    {
    public:
        M1::EM1BeamPenetrableType                                    PenetrableType;                                          //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BeamComponent_SetInvertBeamRotation_Params
    {
    public:
        bool                                                         bInvert;                                                 //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BeamComponent_SetHitInterval_Params
    {
    public:
        float                                                        InHitInterval;                                           //  0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BeamComponent_SetBeamLength_Params
    {
    public:
        float                                                        BeamLength;                                              //  0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BeamComponent_SetBeamFXVectorParam_Params
    {
    public:
        BasicTypes::FName                                            ParamName;                                               //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FVector                                         Value;                                                   //  0x0008(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BeamComponent_SetBeamFXFloatParam_Params
    {
    public:
        BasicTypes::FName                                            ParamName;                                               //  0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        Value;                                                   //  0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BeamComponent_SetAimType_Params
    {
    public:
        M1::EM1BeamAimType                                           AimType;                                                 //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bUpdateOnTick;                                           //  0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BeamComponent_SetAdditionalTargetCheckFunction_Params
    {
    public:
        BasicTypes::UScriptDelegate                                  Fn;                                                      //  0x0000(0x0010)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BeamComponent_ServerInstantHits_Params
    {
    public:
        BasicTypes::TArray<Engine::FHitResult>                       HitResults;                                              //  0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BeamComponent_NetMulticastServerBeamScanTrace_Params
    {
    public:
        BasicTypes::TArray<Engine::FHitResult>                       HitResults;                                              //  0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
        CoreUObject::FVector                                         Start;                                                   //  0x0010(0x000C)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FVector                                         End;                                                     //  0x001C(0x000C)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x8];                                   //  0x0028(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FQuat                                           Quat;                                                    //  0x0030(0x0010)  (ConstParm, Parm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BeamComponent_GetCurrentBeamLength_Params
    {
    public:
        float                                                        ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1BeamComponent_GetBeamFXComponent_Params
    {
    public:
        Niagara::UNiagaraComponent*                                  ReturnValue;                                             //  0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1SplineBlocker_SetCollisionProfile_Params
    {
    public:
        Engine::UPrimitiveComponent*                                 InComponent;                                             //  0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1SplineBlocker_GetSplitSize_Params
    {
    public:
        float                                                        ReturnValue;                                             //  0x0000(0x0004)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1SplineBlocker_GetExtrudeSize_Params
    {
    public:
        float                                                        ReturnValue;                                             //  0x0000(0x0004)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1SplineBlocker_GetBlockerSize_Params
    {
    public:
        float                                                        ReturnValue;                                             //  0x0000(0x0004)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitStatusEffectStackChanged_WaitStatusEffectStackChangedByIdTag_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        GameplayTags::FGameplayTagContainer                          StatusEffectIdTags;                                      //  0x0008(0x0020)  (ConstParm, Parm, NativeAccessSpecifierPublic)
        Engine::AActor*                                              OptionalExternalTarget;                                  //  0x0028(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bOnlyTriggerOnce;                                        //  0x0030(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0031(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityTask_WaitStatusEffectStackChanged*             ReturnValue;                                             //  0x0038(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitStatusEffectStackChanged_WaitStatusEffectStackChangedByAbilityId_Params
    {
    public:
        M1::UM1Ability*                                              OwningAbility;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::FM1AbilityId                                             AbilityId;                                               //  0x0008(0x0010)  (ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::AActor*                                              OptionalExternalTarget;                                  //  0x0018(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bOnlyTriggerOnce;                                        //  0x0020(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0x7];                                   //  0x0021(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AbilityTask_WaitStatusEffectStackChanged*             ReturnValue;                                             //  0x0028(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitStatusEffectStackChanged_OnWaitStackCountChanged__DelegateSignature_Params
    {
    public:
        int32_t                                                      CurrentStackCount;                                       //  0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      DeltaStackCount;                                         //  0x0004(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         BMax;                                                    //  0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AbilityTask_WaitStatusEffectStackChanged_OnStackCountChanged_Params
    {
    public:
        GameplayTags::FGameplayTag                                   InStatusEffectIdTag;                                     //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      CurrentStackCount;                                       //  0x0008(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      DeltaStackCount;                                         //  0x000C(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         BMax;                                                    //  0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AccountInfoFunctionLibrary_GetLoginServerAddress_Params
    {
    public:
        M1::AM1PlayerController*                                     InPlayerController;                                      //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FString                                          ReturnValue;                                             //  0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponentBase_OnPostEventCallBack_Params
    {
    public:
        AkAudio::EAkCallbackType                                     InCallbackType;                                          //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        AkAudio::UAkCallbackInfo*                                    InCallbackInfo;                                          //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_StopAllAkEventOfOwner_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_SpawnAkComponentAtLocation_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        AkAudio::UAkAudioEvent*                                      InAkEvent;                                               //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FString                                          InEventName;                                             //  0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FVector                                         InLocation;                                              //  0x0020(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FRotator                                        InRotation;                                              //  0x002C(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         bAutoPost;                                               //  0x0038(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bAutoDestroy;                                            //  0x0039(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x6];                                   //  0x003A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AkComponent*                                          ReturnValue;                                             //  0x0040(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_ResumeAll_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_PlayGlobalAkEventByName_Params
    {
    public:
        BasicTypes::FString                                          InEventName;                                             //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      ReturnValue;                                             //  0x0010(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_PlayGlobalAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      AkEvent;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      ReturnValue;                                             //  0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_PlayDynamicDialogue_Params
    {
    public:
        BasicTypes::FString                                          InEventName;                                             //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::TArray<BasicTypes::FString>                      ArgPathes;                                               //  0x0010(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_PlayAkEventByName_Params
    {
    public:
        BasicTypes::FString                                          InEventName;                                             //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_PlayAkEventAtLocationByName_Params
    {
    public:
        BasicTypes::FString                                          InEventName;                                             //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FVector                                         Location;                                                //  0x0010(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FRotator                                        Rotation;                                                //  0x001C(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_PlayAkEventAtLocation_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      AkEvent;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FVector                                         Location;                                                //  0x0008(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FRotator                                        Rotation;                                                //  0x0014(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_PlayAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      AkEvent;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_PauseAll_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnUIPlayAkEventByName_Params
    {
    public:
        BasicTypes::FString                                          InEventName;                                             //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::EUIEventType                                             UIType;                                                  //  0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnUIPlayAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      AkEvent;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::EUIEventType                                             UIType;                                                  //  0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnUIInGameContentOpened_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      AkEvent;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnUIInGameContentClosed_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      AkEvent;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnPlayerStartDebone_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnPlayerRegisteredCamp_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnPlayerReceiveFootStepAnimNotify_Params
    {
    public:
        PhysicsCore::EPhysicalSurface                                SurfaceType;                                             //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      PlayerFootStepAction;                                    //  0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnPlayerReceiveAnimNotify_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      AkEvent;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bIsFollowComponent;                                      //  0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnPlayerNeedToPlayLocalSound_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      LocalSoundToPlay;                                        //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnPlayerLanded_Params
    {
    public:
        bool                                                         Hard;                                                    //  0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnPlayerFalling_Params
    {
    public:
        float                                                        VelocityZ;                                               //  0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnPlayerEnterArea_Params
    {
    public:
        BasicTypes::FString                                          LocationString;                                          //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnPlayerEndDebone_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnMonsterStartRush_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnMonsterStartNormalRangedAttack_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnMonsterStartNormalMeleeAttack_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnMonsterReceiveFootStepAnimNotify_Params
    {
    public:
        PhysicsCore::EPhysicalSurface                                SurfaceType;                                             //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      PlayerFootStepAction;                                    //  0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnMonsterReceiveAnimNotifyEnd_Params
    {
    public:
        AkAudio::UAkComponent*                                       TargetAkComponent;                                       //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        AkAudio::UAkAudioEvent*                                      AkEvent;                                                 //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnMonsterReceiveAnimNotify_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      AkEvent;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bIsFollowComponent;                                      //  0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0x7];                                   //  0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::FString                                          AttachTargetName;                                        //  0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::USkeletalMeshComponent*                              TargetMesh;                                              //  0x0020(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bIsDebugNotify;                                          //  0x0028(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0002[0x3];                                   //  0x0029(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FVector                                         Offset;                                                  //  0x002C(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnMonsterGainKnockStatusEffect_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnMonsterAIMontageSound_Params
    {
    public:
        M1::EM1MonsterMontageSoundType                               MonsterMontageSoundType;                                 //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnCharacterReceiveFootStepAnimNotify_Params
    {
    public:
        BasicTypes::FString                                          SurfaceType;                                             //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FString                                          CharacterFootStepAction;                                 //  0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnCharacterReceiveDynamicDialogueAnimNotify_Params
    {
    public:
        M1::EM1DynamicDialogueStimulus                               Stimulus;                                                //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0003[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::FString                                          InEventName;                                             //  0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::TArray<BasicTypes::FString>                      ArgPaths;                                                //  0x0018(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnCharacterMeleeHit_Params
    {
    public:
        M1::UM1DataSoundEffects*                                     OptionalSoundEffects;                                    //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        PhysicsCore::EPhysicalSurface                                HitSurfaceType;                                          //  0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0004[0x3];                                   //  0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FVector                                         Location;                                                //  0x000C(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnChangeUseGamepadVibration_Params
    {
    public:
        bool                                                         bUse;                                                    //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnChangeGamePadVibrationAmount_Params
    {
    public:
        float                                                        InMount;                                                 //  0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_OnChangedTimeDilation_Params
    {
    public:
        float                                                        Rate;                                                    //  0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_IsEventActive_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      InEvent;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetWireMissAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetWireHookSuccessAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetWireHookHitAkEvents_Params
    {
    public:
        M1::UM1DataSoundEffects*                                     ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetWireHookFailAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetUIWeaknessKillHitMarkerAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetUIDefaultHitMarkerAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetTrapStartAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetTrapLoopAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetTrapHitAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetTrapEndAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetPlayerStartBattleAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetPlayerReviveUIAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetPlayerEndBattleAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetPlayerDieUIAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetPlayerDBNOUIAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetNpcPlayerApproachedAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetNpcLookedAtPlayerAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetNpcInteractionStartedAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMovingActorSpawnAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMovingActorMoveStartAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMovingActorMoveEndAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMovingActorDespawnAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMonsterStartRushAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMonsterStartNormalRangedAttackAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMonsterStartNormalMeleeAttackAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMonsterStartMoveWithDamageAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMonsterStartJumpAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMonsterStartIdleInBattleAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMonsterStartBattleAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMonsterSearchAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMonsterOtherMovingDuringBattleAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMonsterLandAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMonsterHideAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMonsterGainedKnockStatusEffectAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMonsterEndBattleAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMonsterDamagedAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMonsterChaseAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMonsterBackMovingAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMonsterAIThreatOnTargetLostAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMonsterAIThreatAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMonsterAIReloadAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMonsterAIEvadeAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetMissionTargetSupplyStolenAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetDropItemObtainedAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetDoorOpenStartAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetDoorOpenEndAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetDoorCloseStartAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetDoorCloseEndAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetDefaultCharacterMeleeHitAkEvents_Params
    {
    public:
        M1::UM1DataSoundEffects*                                     ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetCharacterFootStepAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetCharacterDieAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetAbilityProjectilePassByAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetAbilityProjectileHitAkEvents_Params
    {
    public:
        M1::UM1DataSoundEffects*                                     ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetAbilityProjectileExplosionAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetAbilityProjectileBounceAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetAbilityActorSpawnAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetAbilityActorDestroyAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_GetAbilityActorActiveAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_FindAkComponentWithValid_Params
    {
    public:
        Engine::AActor*                                              Target;                                                  //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::EValidOutputPin                                          OutputPins;                                              //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0005[0x7];                                   //  0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        M1::UM1AkComponent*                                          ReturnValue;                                             //  0x0010(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_ConvertPhysicalSurfaceToString_Params
    {
    public:
        PhysicsCore::EPhysicalSurface                                PhysicalSurface;                                         //  0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0006[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::FString                                          ReturnValue;                                             //  0x0008(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_StopAllAkEventOfOwner_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_ResumeAll_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_PauseAll_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnWireMiss_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnWireHooked_Params
    {
    public:
        PhysicsCore::EPhysicalSurface                                HitSurfaceType;                                          //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bHookSuccess;                                            //  0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnUIShowLoadingScreen_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnUIPlayWeaknessKillHitMarkerSound_Params
    {
    public:
        M1::EUIEventType                                             UIType;                                                  //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnUIPlayDefaultHitMarkerSound_Params
    {
    public:
        M1::EUIEventType                                             UIType;                                                  //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnUIPlayAkEventByName_Params
    {
    public:
        BasicTypes::FString                                          InEventName;                                             //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::EUIEventType                                             UIType;                                                  //  0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnUIPlayAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      AkEvent;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1::EUIEventType                                             UIType;                                                  //  0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnUIInGameContentOpened_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      AkEvent;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnUIInGameContentClosed_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      AkEvent;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnUIHideLoadingScreen_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnTrapStart_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnTrapLoop_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnTrapHit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnTrapEnd_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnTimingMiss_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnTimingHit_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnRoundStarted_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnRemainingTimeAlertStarted_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerWireHooked_Params
    {
    public:
        CoreUObject::FVector                                         HookedLocation;                                          //  0x0000(0x000C)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerUpdateCameraTransform_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerSuccessRescue_Params
    {
    public:
        M1::AM1Player*                                               RescueTarget;                                            //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerStartDebone_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerSelectHero_Params
    {
    public:
        BasicTypes::FString                                          SelectedHeroStringID;                                    //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerReviveByRespawn_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerReviveByRescue_Params
    {
    public:
        M1::AM1Player*                                               HelperPlayer;                                            //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerRegisteredCamp_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerReceiveFootStepAnimNotify_Params
    {
    public:
        PhysicsCore::EPhysicalSurface                                SurfaceType;                                             //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      PlayerFootStepAction;                                    //  0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerReceiveAnimNotify_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      AkEvent;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bIsFollowComponent;                                      //  0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerRangedWeaponStopFire_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerRangedWeaponFired_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      AkEvent;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        fireinterval;                                            //  0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        RoundRate;                                               //  0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      ChargeLevel;                                             //  0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerOutPlayableArea_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      InActivatedEvent;                                        //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerNeedToPlayLocalSound_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      LocalSoundToPlay;                                        //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerLanded_Params
    {
    public:
        bool                                                         Hard;                                                    //  0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerKilledEpicMonster_Params
    {
    public:
        BasicTypes::FString                                          EpicMonsterName;                                         //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerJumped_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerJoinMission_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerInitSound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerFirstFailedOfAutoReload_Params
    {
    public:
        M1::EM1DynamicDialogueStimulus                               EmptyRoundsStimulus;                                     //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerFalling_Params
    {
    public:
        float                                                        VelocityZ;                                               //  0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerExitEpicMonsterRange_Params
    {
    public:
        BasicTypes::FString                                          EpicMonsterName;                                         //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerEnterEpicMonsterRange_Params
    {
    public:
        BasicTypes::FString                                          EpicMonsterName;                                         //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerEnterArea_Params
    {
    public:
        BasicTypes::FString                                          LocationString;                                          //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerEndDebone_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerDamagedFromDirection_Params
    {
    public:
        float                                                        Angle;                                                   //  0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerDamaged_Params
    {
    public:
        M1::EM1DynamicDialogueStimulus                               DamageStimulus;                                          //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerChangedWireState_Params
    {
    public:
        M1::EM1WireState                                             State;                                                   //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerBattleStateChanged_Params
    {
    public:
        bool                                                         bInBattleState;                                          //  0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnPlayerActiveDBNO_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnNpcPlayerApproached_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnNpcLookedAtPlayer_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnNpcInteractionStarted_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnMovingActorSpawn_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnMovingActorMoveStart_Params
    {
    public:
        float                                                        Speed;                                                   //  0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnMovingActorMoveEnd_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnMovingActorDespawn_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnMonsterStopMoveByPurpose_Params
    {
    public:
        M1::EM1AIMovePurpose                                         MovePurpose;                                             //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bInBattle;                                               //  0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bIdle;                                                   //  0x0002(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnMonsterStartRush_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnMonsterStartNormalRangedAttack_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnMonsterStartNormalMeleeAttack_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnMonsterStartMoveWithDamage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnMonsterStartMoveByPurpose_Params
    {
    public:
        M1::EM1AIMovePurpose                                         MovePurpose;                                             //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bInBattle;                                               //  0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnMonsterReceiveFootStepAnimNotify_Params
    {
    public:
        PhysicsCore::EPhysicalSurface                                SurfaceType;                                             //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      PlayerFootStepAction;                                    //  0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnMonsterReceiveAnimNotifyEnd_Params
    {
    public:
        AkAudio::UAkComponent*                                       TargetAkComponent;                                       //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        AkAudio::UAkAudioEvent*                                      AkEvent;                                                 //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnMonsterReceiveAnimNotify_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      AkEvent;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bIsFollowComponent;                                      //  0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0007[0x7];                                   //  0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::FString                                          AttachTargetName;                                        //  0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::USkeletalMeshComponent*                              TargetMesh;                                              //  0x0020(0x0008)  (Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bIsDebugNotify;                                          //  0x0028(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0008[0x3];                                   //  0x0029(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FVector                                         Offset;                                                  //  0x002C(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnMonsterGainKnockStatusEffect_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnMonsterDamaged_Params
    {
    public:
        bool                                                         bIsHitWeakPoint;                                         //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnMonsterBattleStateChanged_Params
    {
    public:
        bool                                                         bInBattleState;                                          //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnMonsterAIMontageSound_Params
    {
    public:
        M1::EM1MonsterMontageSoundType                               MonsterMontageSoundType;                                 //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnMissionTargetSupplyStolen_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnMiniGameStartedBySpecialCharacter_Params
    {
    public:
        M1Data::EM1MiniGameType                                      InMiniGameType;                                          //  0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnMiniGameFinished_Params
    {
    public:
        bool                                                         bIsSuccess;                                              //  0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnHookChangedWireState_Params
    {
    public:
        M1::EM1WireState                                             State;                                                   //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnDropItemSpawned_Params
    {
    public:
        M1Data::EM1ImportanceType                                    InImportanceType;                                        //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnDropItemObtained_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnDoorOpenStart_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnDoorOpenEnd_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnDoorCloseStart_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnDoorCloseEnd_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnCharacterReceiveFootStepAnimNotify_Params
    {
    public:
        BasicTypes::FString                                          SurfaceType;                                             //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FString                                          CharacterFootStepAction;                                 //  0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnCharacterReceiveDynamicDialogueAnimNotify_Params
    {
    public:
        M1::EM1DynamicDialogueStimulus                               Stimulus;                                                //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0009[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::FString                                          InEventName;                                             //  0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::TArray<BasicTypes::FString>                      ArgPaths;                                                //  0x0018(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnCharacterRangeHit_Params
    {
    public:
        M1::UM1DataSoundEffects*                                     SoundEffects;                                            //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        PhysicsCore::EPhysicalSurface                                HitSurfaceType;                                          //  0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0010[0x3];                                   //  0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FVector                                         Location;                                                //  0x000C(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FRotator                                        Rotation;                                                //  0x0018(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnCharacterMeleeHit_Params
    {
    public:
        M1::UM1DataSoundEffects*                                     OptionalSoundEffects;                                    //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        PhysicsCore::EPhysicalSurface                                HitSurfaceType;                                          //  0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0011[0x3];                                   //  0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FVector                                         Location;                                                //  0x000C(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnCharacterDie_Params
    {
    public:
        bool                                                         bWeakness;                                               //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnChangeUseGamepadVibration_Params
    {
    public:
        bool                                                         bUse;                                                    //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnChangeGamePadVibrationAmount_Params
    {
    public:
        float                                                        InMount;                                                 //  0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnChangedWeaponByHold_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnChangedTimeDilation_Params
    {
    public:
        float                                                        Rate;                                                    //  0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnChangeAudioMixOption_Params
    {
    public:
        M1::EM1AudioMix                                              InOption;                                                //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnApplyBattleVoice_Params
    {
    public:
        bool                                                         InActivate;                                              //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnAbilityProjectilePassBy_Params
    {
    public:
        CoreUObject::FVector                                         Velocity;                                                //  0x0000(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnAbilityProjectileHit_Params
    {
    public:
        PhysicsCore::EPhysicalSurface                                HitSurfaceType;                                          //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0012[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FVector                                         Location;                                                //  0x0004(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FRotator                                        Rotation;                                                //  0x0010(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnAbilityProjectileExplosion_Params
    {
    public:
        CoreUObject::FVector                                         Location;                                                //  0x0000(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FRotator                                        Rotation;                                                //  0x000C(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnAbilityProjectileBounce_Params
    {
    public:
        CoreUObject::FVector                                         Velocity;                                                //  0x0000(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnAbilityActorSpawned_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AkComponent_BP_OnAbilityActorDestroyed_Params
    {
    public:
        CoreUObject::FVector                                         Location;                                                //  0x0000(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FRotator                                        Rotation;                                                //  0x000C(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1DataHitEffects_GetHitEffect_Params
    {
    public:
        PhysicsCore::EPhysicalSurface                                Type;                                                    //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        Niagara::UNiagaraSystem*                                     ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1CinematicPlayerInLobbyAnimInstance_GetRandomPlayableAnimSequence_Params
    {
    public:
        Engine::UAnimSequence*                                       ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AM1CinematicSkelMesh_SetClothGravityScale_Params
    {
    public:
        float                                                        InClothGravityScale;                                     //  0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1AnimNotify_SlidingVFX_GetSpawnedEffect_Params
    {
    public:
        Engine::UFXSystemComponent*                                  ReturnValue;                                             //  0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1CheatExtensionFeatureTester_StatusEffect_Params
    {
    public:
        BasicTypes::FString                                          CharacterIdStr;                                          //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FString                                          DataRowName;                                             //  0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FString                                          OverrideParamStr;                                        //  0x0020(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1CheatExtensionFeatureTester_StatMod_Params
    {
    public:
        BasicTypes::FString                                          CharacterIdStr;                                          //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1Data::EM1StatType                                          StatType;                                                //  0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1Data::EM1StatModifierOp                                    Op;                                                      //  0x0011(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x2];                                   //  0x0012(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        Value;                                                   //  0x0014(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1CheatExtensionFeatureTester_Stat_Params
    {
    public:
        BasicTypes::FString                                          CharacterIdStr;                                          //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1Data::EM1StatType                                          StatType;                                                //  0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0x3];                                   //  0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        NewStatValue;                                            //  0x0014(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1CheatExtensionFeatureTester_SpawnAbilityActor_Params
    {
    public:
        BasicTypes::FString                                          CharacterIdStr;                                          //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FString                                          DataRowName;                                             //  0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FString                                          SpawnDistanceStr;                                        //  0x0020(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1CheatExtensionFeatureTester_Spawn_Params
    {
    public:
        BasicTypes::FString                                          DataIdorRowName;                                         //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      Level;                                                   //  0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0002[0x4];                                   //  0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::FString                                          SpawnGroupIdStr;                                         //  0x0018(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      SpawnCount;                                              //  0x0028(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      SpawnDistance;                                           //  0x002C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1CheatExtensionFeatureTester_Skill_Params
    {
    public:
        BasicTypes::FString                                          CharacterIdStr;                                          //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      SkillIndex;                                              //  0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0003[0x4];                                   //  0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::FString                                          TargetCharacterIdsStr;                                   //  0x0018(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1CheatExtensionFeatureTester_ServerStatsEffect_Params
    {
    public:
        BasicTypes::FString                                          CharacterIdStr;                                          //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FString                                          DataRowName;                                             //  0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FString                                          OverrideParamStr;                                        //  0x0020(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1CheatExtensionFeatureTester_ServerStatMod_Params
    {
    public:
        BasicTypes::FString                                          CharacterIdStr;                                          //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1Data::EM1StatType                                          StatType;                                                //  0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1Data::EM1StatModifierOp                                    Op;                                                      //  0x0011(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0004[0x2];                                   //  0x0012(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        NewStatValue;                                            //  0x0014(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1CheatExtensionFeatureTester_ServerStat_Params
    {
    public:
        BasicTypes::FString                                          CharacterIdStr;                                          //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        M1Data::EM1StatType                                          StatType;                                                //  0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0005[0x3];                                   //  0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        NewStatValue;                                            //  0x0014(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UM1CheatExtensionFeatureTester_ServerSpawnAbilityActor_Params
    {
    public:
        BasicTypes::FString                                          CharacterIdStr;                                          //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
