#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "Engine_FPoseLink.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class UAnimInstance; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::Main
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_UpperBody_U_R_Params
    {
    public:
        Engine::FPoseLink                                            InPose_UpperBody_U_R;                                    //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            UpperBody_U_R;                                           //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_UpperBody_L_Additive_Params
    {
    public:
        Engine::FPoseLink                                            InPose_UpperBody_L_Additive;                             //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            UpperBody_L_Additive;                                    //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_UpperBody_L_Params
    {
    public:
        Engine::FPoseLink                                            InPose_UpperBody_L;                                      //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            UpperBody_L;                                             //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_UpperBody_U_Params
    {
    public:
        Engine::FPoseLink                                            InPose_UpperBody_U;                                      //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            UpperBody_U;                                             //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_FullBody_Params
    {
    public:
        Engine::FPoseLink                                            InPose_FullBody;                                         //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            FullBody;                                                //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_Motion_M_Params
    {
    public:
        Engine::FPoseLink                                            InPose_Motion_M;                                         //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            Motion_M;                                                //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_SpecificationLayer_Params
    {
    public:
        Engine::FPoseLink                                            InPose;                                                  //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            SpecificationLayer;                                      //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_AbilityLayer_Params
    {
    public:
        Engine::FPoseLink                                            InPose;                                                  //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            AbilityLayer;                                            //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_WireLayer_Params
    {
    public:
        Engine::FPoseLink                                            InPose;                                                  //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            WireLayer;                                               //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_UpperBodyLayer_Params
    {
    public:
        Engine::FPoseLink                                            InputPose;                                               //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            UpperBodyLayer;                                          //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_AimOffsetLayer_Params
    {
    public:
        Engine::FPoseLink                                            InPose;                                                  //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            AimOffsetLayer;                                          //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_LocomotionLayer_Params
    {
    public:
        Engine::FPoseLink                                            LocomotionLayer;                                         //  0x0000(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_AnimGraph_Params
    {
    public:
        Engine::FPoseLink                                            AnimGraph;                                               //  0x0000(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_NewFunction_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_GetWireAnimLayer_Params
    {
    public:
        Engine::UAnimInstance*                                       Ret;                                                     //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_GetAbilityAnimLayer_Params
    {
    public:
        Engine::UAnimInstance*                                       Ret;                                                     //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_GetLocomotionAnimLayer_Params
    {
    public:
        Engine::UAnimInstance*                                       Ret;                                                     //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Main_AnimGraphNode_LayeredBoneBlend_5955D63F4365733784B35D92B01C0402_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Main_AnimGraphNode_LayeredBoneBlend_A250DE804BFC293A006A2F93E0E0819D_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Main_AnimGraphNode_TwoWayBlend_738D14A944C8ABEB516B26BF23ADF934_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_OnAnimTypeChanged_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_BlueprintLinkedAnimationLayersInitialized_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMain_C_ExecuteUbergraph_Main_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
