#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "MovieRenderPipelineCore_FMoviePipelineFormatArgs.h"
#include "CoreUObject_FDateTime.h"
#include "BasicTypes_FString.h"
#include "BasicTypes_TMap.h"
#include "BasicTypes_FText.h"
#include "BasicTypes_TArray.h"
#include "CoreUObject_FFrameRate.h"
#include "CoreUObject_FSoftObjectPath.h"
#include "MovieRenderPipelineCore_FMoviePipelineFilenameResolveParams.h"
#include "CoreUObject_FTimecode.h"
#include "CoreUObject_FFrameNumber.h"
#include "MovieRenderPipelineCore_ENUMS.h"
#include "CoreUObject_FTimespan.h"
#include "CoreUObject_FIntPoint.h"
#include "MovieRenderPipelineCore_FMoviePipelineSegmentWorkMetrics.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::MovieRenderPipelineCore { class UMoviePipeline; };
namespace CG::MovieRenderPipelineCore { class UMoviePipelineExecutorJob; };
namespace CG::Engine { class UTexture; };
namespace CG::MovieRenderPipelineCore { class UMoviePipelinePrimaryConfig; };
namespace CG::CoreUObject { class UObject; };
namespace CG::MovieRenderPipelineCore { class UMoviePipelineQueue; };
namespace CG::MovieRenderPipelineCore { class UMoviePipelineSetting; };
namespace CG::LevelSequence { class ULevelSequence; };
namespace CG::Engine { class UWorld; };
namespace CG::MovieRenderPipelineCore { class UMoviePipelineShotConfig; };
namespace CG::MovieRenderPipelineCore { class UMovieRenderDebugWidget; };
namespace CG::MovieRenderPipelineCore { class UMoviePipelineExecutorBase; };
namespace CG::MovieRenderPipelineCore { class UMoviePipelineExecutorShot; };
namespace CG::MovieScene { class UMovieSceneSequence; };
namespace CG::MovieRenderPipelineCore { class UMoviePipelineConfigBase; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::MovieRenderPipelineCore
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineSetting_BlueprintBase_ReceiveTeardownForPipelineImpl_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InPipeline;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineSetting_BlueprintBase_ReceiveSetupForPipelineImpl_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InPipeline;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineSetting_BlueprintBase_ReceiveGetFormatArguments_Params
    {
    public:
        MovieRenderPipelineCore::FMoviePipelineFormatArgs            InOutFormatArgs;                                         //  0x0000(0x00A8)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        MovieRenderPipelineCore::FMoviePipelineFormatArgs            ReturnValue;                                             //  0x00A8(0x00A8)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineSetting_BlueprintBase_OnEngineTickBeginFrame_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMovieRenderDebugWidget_OnInitializedForPipeline_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     ForPipeline;                                             //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipeline_Shutdown_Params
    {
    public:
        bool                                                         bError;                                                  //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipeline_SetInitializationTime_Params
    {
    public:
        CoreUObject::FDateTime                                       InDateTime;                                              //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipeline_RequestShutdown_Params
    {
    public:
        bool                                                         bIsError;                                                //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipeline_OnMoviePipelineFinishedImpl_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipeline_IsShutdownRequested_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipeline_Initialize_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineExecutorJob*          InJob;                                                   //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipeline_GetPreviewTexture_Params
    {
    public:
        Engine::UTexture*                                            ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipeline_GetPipelinePrimaryConfig_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelinePrimaryConfig*        ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipeline_GetPipelineMasterConfig_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelinePrimaryConfig*        ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipeline_GetInitializationTime_Params
    {
    public:
        CoreUObject::FDateTime                                       ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipeline_GetCurrentJob_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineExecutorJob*          ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorBase_SetStatusProgress_Params
    {
    public:
        float                                                        InProgress;                                              //  0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorBase_SetStatusMessage_Params
    {
    public:
        BasicTypes::FString                                          InStatus;                                                //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorBase_SetMoviePipelineClass_Params
    {
    public:
        CoreUObject::UObject*                                        InPipelineClass;                                         //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorBase_SendSocketMessage_Params
    {
    public:
        BasicTypes::FString                                          InMessage;                                               //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorBase_SendHTTPRequest_Params
    {
    public:
        BasicTypes::FString                                          InURL;                                                   //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FString                                          InVerb;                                                  //  0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FString                                          InMessage;                                               //  0x0020(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::TMap<BasicTypes::FString, BasicTypes::FString>   InHeaders;                                               //  0x0030(0x0050)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        int32_t                                                      ReturnValue;                                             //  0x0080(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorBase_OnExecutorFinishedImpl_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorBase_OnExecutorErroredImpl_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     ErroredPipeline;                                         //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bFatal;                                                  //  0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::FText                                            ErrorReason;                                             //  0x0010(0x0018)  (Parm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorBase_OnBeginFrame_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorBase_IsSocketConnected_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorBase_IsRendering_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorBase_GetStatusProgress_Params
    {
    public:
        float                                                        ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorBase_GetStatusMessage_Params
    {
    public:
        BasicTypes::FString                                          ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorBase_Execute_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineQueue*                InPipelineQueue;                                         //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorBase_DisconnectSocket_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorBase_ConnectSocket_Params
    {
    public:
        BasicTypes::FString                                          InHostName;                                              //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      InPort;                                                  //  0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0014(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorBase_CancelCurrentJob_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorBase_CancelAllJobs_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineSetting_SetIsEnabled_Params
    {
    public:
        bool                                                         bInEnabled;                                              //  0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineSetting_IsEnabled_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineSetting_BuildNewProcessCommandLineArgs_Params
    {
    public:
        BasicTypes::TArray<BasicTypes::FString>                      InOutUnrealURLParams;                                    //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::TArray<BasicTypes::FString>                      InOutCommandLineArgs;                                    //  0x0010(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::TArray<BasicTypes::FString>                      InOutDeviceProfileCvars;                                 //  0x0020(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::TArray<BasicTypes::FString>                      InOutExecCmds;                                           //  0x0030(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineSetting_BuildNewProcessCommandLine_Params
    {
    public:
        BasicTypes::FString                                          InOutUnrealURLParams;                                    //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FString                                          InOutCommandLineArgs;                                    //  0x0010(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelinePrimaryConfig_InitializeTransientSettings_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelinePrimaryConfig_GetTransientSettings_Params
    {
    public:
        BasicTypes::TArray<MovieRenderPipelineCore::UMoviePipelineSetting*> ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelinePrimaryConfig_GetEffectiveFrameRate_Params
    {
    public:
        LevelSequence::ULevelSequence*                               InSequence;                                              //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FFrameRate                                      ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelinePrimaryConfig_GetAllSettings_Params
    {
    public:
        bool                                                         bIncludeDisabledSettings;                                //  0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bIncludeTransientSettings;                               //  0x0001(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x6];                                   //  0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::TArray<MovieRenderPipelineCore::UMoviePipelineSetting*> ReturnValue;                                             //  0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelinePythonHostExecutor_OnMapLoad_Params
    {
    public:
        Engine::UWorld*                                              InWorld;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelinePythonHostExecutor_GetLastLoadedWorld_Params
    {
    public:
        Engine::UWorld*                                              ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelinePythonHostExecutor_ExecuteDelayed_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineQueue*                InPipelineQueue;                                         //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorShot_ShouldRender_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorShot_SetStatusProgress_Params
    {
    public:
        float                                                        InProgress;                                              //  0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorShot_SetStatusMessage_Params
    {
    public:
        BasicTypes::FString                                          InStatus;                                                //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorShot_SetShotOverridePresetOrigin_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineShotConfig*           InPreset;                                                //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorShot_SetShotOverrideConfiguration_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineShotConfig*           InPreset;                                                //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorShot_GetStatusProgress_Params
    {
    public:
        float                                                        ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorShot_GetStatusMessage_Params
    {
    public:
        BasicTypes::FString                                          ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorShot_GetShotOverridePresetOrigin_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineShotConfig*           ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorShot_GetShotOverrideConfiguration_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineShotConfig*           ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorShot_GetCameraName_Params
    {
    public:
        int32_t                                                      InCameraIndex;                                           //  0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::FString                                          ReturnValue;                                             //  0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorShot_AllocateNewShotOverrideConfig_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineShotConfig*           InConfigType;                                            //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieRenderPipelineCore::UMoviePipelineShotConfig*           ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorJob_SetStatusProgress_Params
    {
    public:
        float                                                        InProgress;                                              //  0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorJob_SetStatusMessage_Params
    {
    public:
        BasicTypes::FString                                          InStatus;                                                //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorJob_SetSequence_Params
    {
    public:
        CoreUObject::FSoftObjectPath                                 InSequence;                                              //  0x0000(0x0020)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorJob_SetPresetOrigin_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelinePrimaryConfig*        InPreset;                                                //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorJob_SetIsEnabled_Params
    {
    public:
        bool                                                         bInEnabled;                                              //  0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorJob_SetConsumed_Params
    {
    public:
        bool                                                         bInConsumed;                                             //  0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorJob_SetConfiguration_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelinePrimaryConfig*        InPreset;                                                //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorJob_OnDuplicated_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorJob_IsEnabled_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorJob_IsConsumed_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorJob_GetStatusProgress_Params
    {
    public:
        float                                                        ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorJob_GetStatusMessage_Params
    {
    public:
        BasicTypes::FString                                          ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorJob_GetPresetOrigin_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelinePrimaryConfig*        ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineExecutorJob_GetConfiguration_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelinePrimaryConfig*        ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineQueue_SetQueueOrigin_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineQueue*                InConfig;                                                //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineQueue_SetJobIndex_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineExecutorJob*          InJob;                                                   //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      Index;                                                   //  0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineQueue_GetQueueOrigin_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineQueue*                ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineQueue_GetJobs_Params
    {
    public:
        BasicTypes::TArray<MovieRenderPipelineCore::UMoviePipelineExecutorJob*> ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineQueue_DuplicateJob_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineExecutorJob*          InJob;                                                   //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieRenderPipelineCore::UMoviePipelineExecutorJob*          ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineQueue_DeleteJob_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineExecutorJob*          InJob;                                                   //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineQueue_DeleteAllJobs_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineQueue_CopyFrom_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineQueue*                InQueue;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineQueue_AllocateNewJob_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineExecutorJob*          InJobType;                                               //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieRenderPipelineCore::UMoviePipelineExecutorJob*          ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineQueueEngineSubsystem_SetConfiguration_Params
    {
    public:
        MovieRenderPipelineCore::UMovieRenderDebugWidget*            InProgressWidgetClass;                                   //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bRenderPlayerViewport;                                   //  0x0008(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineQueueEngineSubsystem_RenderQueueWithExecutorInstance_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineExecutorBase*         InExecutor;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineQueueEngineSubsystem_RenderQueueWithExecutor_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineExecutorBase*         InExecutorType;                                          //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieRenderPipelineCore::UMoviePipelineExecutorBase*         ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineQueueEngineSubsystem_RenderJob_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineExecutorJob*          InJob;                                                   //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineQueueEngineSubsystem_IsRendering_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineQueueEngineSubsystem_GetQueue_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineQueue*                ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineQueueEngineSubsystem_GetActiveExecutor_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineExecutorBase*         ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineQueueEngineSubsystem_AllocateJob_Params
    {
    public:
        LevelSequence::ULevelSequence*                               InSequence;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieRenderPipelineCore::UMoviePipelineExecutorJob*          ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_UpdateJobShotListFromSequence_Params
    {
    public:
        LevelSequence::ULevelSequence*                               InSequence;                                              //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieRenderPipelineCore::UMoviePipelineExecutorJob*          InJob;                                                   //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bShotsChanged;                                           //  0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_ResolveVersionNumber_Params
    {
    public:
        MovieRenderPipelineCore::FMoviePipelineFilenameResolveParams InParams;                                                //  0x0000(0x0118)  (Parm, NativeAccessSpecifierPublic)
        bool                                                         bGetNextVersion;                                         //  0x0118(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x3];                                   //  0x0119(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        int32_t                                                      ReturnValue;                                             //  0x011C(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_ResolveFilenameFormatArguments_Params
    {
    public:
        BasicTypes::FString                                          InFormatString;                                          //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieRenderPipelineCore::FMoviePipelineFilenameResolveParams InParams;                                                //  0x0010(0x0118)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::FString                                          OutFinalPath;                                            //  0x0128(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieRenderPipelineCore::FMoviePipelineFormatArgs            OutMergedFormatArgs;                                     //  0x0138(0x00A8)  (Parm, OutParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_LoadManifestFileFromString_Params
    {
    public:
        BasicTypes::FString                                          InManifestFilePath;                                      //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieRenderPipelineCore::UMoviePipelineQueue*                ReturnValue;                                             //  0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetRootTimecode_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InMoviePipeline;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FTimecode                                       ReturnValue;                                             //  0x0008(0x0014)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetRootFrameNumber_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InMoviePipeline;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FFrameNumber                                    ReturnValue;                                             //  0x0008(0x0004)  (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetPipelineState_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InPipeline;                                              //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieRenderPipelineCore::EMovieRenderPipelineState           ReturnValue;                                             //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetOverallSegmentCounts_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InMoviePipeline;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      OutCurrentIndex;                                         //  0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      OutTotalCount;                                           //  0x000C(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetOverallOutputFrames_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InMoviePipeline;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      OutCurrentIndex;                                         //  0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      OutTotalCount;                                           //  0x000C(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetMoviePipelineEngineChangelistLabel_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InMoviePipeline;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FText                                            ReturnValue;                                             //  0x0008(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetMasterTimecode_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InMoviePipeline;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FTimecode                                       ReturnValue;                                             //  0x0008(0x0014)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetMasterFrameNumber_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InMoviePipeline;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FFrameNumber                                    ReturnValue;                                             //  0x0008(0x0004)  (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetMapPackageName_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineExecutorJob*          InJob;                                                   //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FString                                          ReturnValue;                                             //  0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetJobName_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InMoviePipeline;                                         //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FText                                            ReturnValue;                                             //  0x0008(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetJobInitializationTime_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InMoviePipeline;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FDateTime                                       ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetJobAuthor_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InMoviePipeline;                                         //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FText                                            ReturnValue;                                             //  0x0008(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetEstimatedTimeRemaining_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InPipeline;                                              //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FTimespan                                       OutEstimate;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetEffectiveOutputResolution_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelinePrimaryConfig*        InPrimaryConfig;                                         //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieRenderPipelineCore::UMoviePipelineExecutorShot*         InPipelineExecutorShot;                                  //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FIntPoint                                       ReturnValue;                                             //  0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetCurrentShotTimecode_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InMoviePipeline;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FTimecode                                       ReturnValue;                                             //  0x0008(0x0014)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetCurrentShotFrameNumber_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InMoviePipeline;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FFrameNumber                                    ReturnValue;                                             //  0x0008(0x0004)  (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetCurrentSequence_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InMoviePipeline;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        LevelSequence::ULevelSequence*                               ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetCurrentSegmentWorkMetrics_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InMoviePipeline;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieRenderPipelineCore::FMoviePipelineSegmentWorkMetrics    ReturnValue;                                             //  0x0008(0x0028)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetCurrentSegmentState_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InMoviePipeline;                                         //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieRenderPipelineCore::EMovieRenderShotState               ReturnValue;                                             //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetCurrentSegmentName_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InMoviePipeline;                                         //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FText                                            OutOuterName;                                            //  0x0008(0x0018)  (Parm, OutParm, NativeAccessSpecifierPublic)
        BasicTypes::FText                                            OutInnerName;                                            //  0x0020(0x0018)  (Parm, OutParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetCurrentFocusDistance_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InMoviePipeline;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        ReturnValue;                                             //  0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetCurrentFocalLength_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InMoviePipeline;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        ReturnValue;                                             //  0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetCurrentExecutorShot_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InMoviePipeline;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieRenderPipelineCore::UMoviePipelineExecutorShot*         ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetCurrentAperture_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InMoviePipeline;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        ReturnValue;                                             //  0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_GetCompletionPercentage_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipeline*                     InPipeline;                                              //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        ReturnValue;                                             //  0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_FindOrGetDefaultSettingForShot_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineSetting*              InSettingType;                                           //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieRenderPipelineCore::UMoviePipelinePrimaryConfig*        InPrimaryConfig;                                         //  0x0008(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieRenderPipelineCore::UMoviePipelineExecutorShot*         InShot;                                                  //  0x0010(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieRenderPipelineCore::UMoviePipelineSetting*              ReturnValue;                                             //  0x0018(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineBlueprintLibrary_DuplicateSequence_Params
    {
    public:
        CoreUObject::UObject*                                        Outer;                                                   //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieScene::UMovieSceneSequence*                             InSequence;                                              //  0x0008(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MovieScene::UMovieSceneSequence*                             ReturnValue;                                             //  0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineConfigBase_SetConfigOrigin_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineConfigBase*           InConfig;                                                //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineConfigBase_RemoveSetting_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineSetting*              InSetting;                                               //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineConfigBase_GetUserSettings_Params
    {
    public:
        BasicTypes::TArray<MovieRenderPipelineCore::UMoviePipelineSetting*> ReturnValue;                                             //  0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineConfigBase_GetConfigOrigin_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineConfigBase*           ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineConfigBase_FindSettingsByClass_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineSetting*              InClass;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bIncludeDisabledSettings;                                //  0x0008(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bExactMatch;                                             //  0x0009(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x6];                                   //  0x000A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BasicTypes::TArray<MovieRenderPipelineCore::UMoviePipelineSetting*> ReturnValue;                                             //  0x0010(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineConfigBase_FindSettingByClass_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineSetting*              InClass;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bIncludeDisabledSettings;                                //  0x0008(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bExactMatch;                                             //  0x0009(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0x6];                                   //  0x000A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        MovieRenderPipelineCore::UMoviePipelineSetting*              ReturnValue;                                             //  0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineConfigBase_FindOrAddSettingByClass_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineSetting*              InClass;                                                 //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bIncludeDisabledSettings;                                //  0x0008(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         bExactMatch;                                             //  0x0009(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0002[0x6];                                   //  0x000A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        MovieRenderPipelineCore::UMoviePipelineSetting*              ReturnValue;                                             //  0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UMoviePipelineConfigBase_CopyFrom_Params
    {
    public:
        MovieRenderPipelineCore::UMoviePipelineConfigBase*           InConfig;                                                //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
