#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "OpenColorIO_FOpenColorIOColorConversionSettings.h"
#include "BasicTypes_TArray.h"
#include "Engine_FSceneViewExtensionIsActiveFunctor.h"
#include "OpenColorIO_FOpenColorIODisplayConfiguration.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::CoreUObject { class UObject; };
namespace CG::Engine { class UTexture; };
namespace CG::Engine { class UTextureRenderTarget2D; };
namespace CG::OpenColorIO { class UOpenColorIODisplayExtensionWrapper; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::OpenColorIO
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UOpenColorIOBlueprintLibrary_ApplyColorSpaceTransform_Params
    {
    public:
        CoreUObject::UObject*                                        WorldContextObject;                                      //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        OpenColorIO::FOpenColorIOColorConversionSettings             ConversionSettings;                                      //  0x0008(0x0098)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        Engine::UTexture*                                            InputTexture;                                            //  0x00A0(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        Engine::UTextureRenderTarget2D*                              OutputRenderTarget;                                      //  0x00A8(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x00B0(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UOpenColorIOConfiguration_ReloadExistingColorspaces_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UOpenColorIODisplayExtensionWrapper_SetSceneExtensionIsActiveFunctions_Params
    {
    public:
        BasicTypes::TArray<Engine::FSceneViewExtensionIsActiveFunctor> IsActiveFunctions;                                       //  0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UOpenColorIODisplayExtensionWrapper_SetSceneExtensionIsActiveFunction_Params
    {
    public:
        Engine::FSceneViewExtensionIsActiveFunctor                   IsActiveFunction;                                        //  0x0000(0x0050)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UOpenColorIODisplayExtensionWrapper_SetOpenColorIOConfiguration_Params
    {
    public:
        OpenColorIO::FOpenColorIODisplayConfiguration                InDisplayConfiguration;                                  //  0x0000(0x00A0)  (Parm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UOpenColorIODisplayExtensionWrapper_RemoveSceneExtension_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UOpenColorIODisplayExtensionWrapper_GetOpenColorIOConfiguration_Params
    {
    public:
        OpenColorIO::FOpenColorIODisplayConfiguration                ReturnValue;                                             //  0x0000(0x00A0)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UOpenColorIODisplayExtensionWrapper_CreateOpenColorIODisplayExtension_Params
    {
    public:
        OpenColorIO::FOpenColorIODisplayConfiguration                InDisplayConfiguration;                                  //  0x0000(0x00A0)  (Parm, NativeAccessSpecifierPublic)
        Engine::FSceneViewExtensionIsActiveFunctor                   IsActiveFunction;                                        //  0x00A0(0x0050)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        OpenColorIO::UOpenColorIODisplayExtensionWrapper*            ReturnValue;                                             //  0x00F0(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UOpenColorIODisplayExtensionWrapper_CreateInGameOpenColorIODisplayExtension_Params
    {
    public:
        OpenColorIO::FOpenColorIODisplayConfiguration                InDisplayConfiguration;                                  //  0x0000(0x00A0)  (Parm, NativeAccessSpecifierPublic)
        OpenColorIO::UOpenColorIODisplayExtensionWrapper*            ReturnValue;                                             //  0x00A0(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
