#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "PropertyPath_FPropertyPathTestStruct.h"

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::PropertyPath
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UPropertyPathTestObject_SetStructRef_Params
    {
    public:
        PropertyPath::FPropertyPathTestStruct                        InStruct;                                                //  0x0000(0x0050)  (Parm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UPropertyPathTestObject_SetStructConstRef_Params
    {
    public:
        PropertyPath::FPropertyPathTestStruct                        InStruct;                                                //  0x0000(0x0050)  (Parm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UPropertyPathTestObject_SetStruct_Params
    {
    public:
        PropertyPath::FPropertyPathTestStruct                        InStruct;                                                //  0x0000(0x0050)  (Parm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UPropertyPathTestObject_SetFloat_Params
    {
    public:
        float                                                        InFloat;                                                 //  0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UPropertyPathTestObject_GetStructRef_Params
    {
    public:
        PropertyPath::FPropertyPathTestStruct                        ReturnValue;                                             //  0x0000(0x0050)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UPropertyPathTestObject_GetStructConstRef_Params
    {
    public:
        PropertyPath::FPropertyPathTestStruct                        ReturnValue;                                             //  0x0000(0x0050)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UPropertyPathTestObject_GetStruct_Params
    {
    public:
        PropertyPath::FPropertyPathTestStruct                        ReturnValue;                                             //  0x0000(0x0050)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UPropertyPathTestObject_GetFloat_Params
    {
    public:
        float                                                        ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
