#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_FString.h"
#include "CoreUObject_FVector.h"
#include "BasicTypes_TArray.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::CoreUObject { class UObject; };
namespace CG::Engine { class AActor; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::ReplicationGraph
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class AReplicationGraphDebugActor_ServerStopDebugging_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AReplicationGraphDebugActor_ServerStartDebugging_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AReplicationGraphDebugActor_ServerSetPeriodFrameForClass_Params
    {
    public:
        CoreUObject::UObject*                                        Class;                                                   //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      PeriodFrame;                                             //  0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AReplicationGraphDebugActor_ServerSetCullDistanceForClass_Params
    {
    public:
        CoreUObject::UObject*                                        Class;                                                   //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        float                                                        CullDistance;                                            //  0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AReplicationGraphDebugActor_ServerSetConditionalActorBreakpoint_Params
    {
    public:
        Engine::AActor*                                              Actor;                                                   //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AReplicationGraphDebugActor_ServerPrintCullDistances_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AReplicationGraphDebugActor_ServerPrintAllActorInfo_Params
    {
    public:
        BasicTypes::FString                                          Str;                                                     //  0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AReplicationGraphDebugActor_ServerCellInfo_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class AReplicationGraphDebugActor_ClientCellInfo_Params
    {
    public:
        CoreUObject::FVector                                         CellLocation;                                            //  0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FVector                                         CellExtent;                                              //  0x000C(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::TArray<Engine::AActor*>                          Actors;                                                  //  0x0018(0x0010)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
