#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BunnyBeamLevelData_FBunnyBeamLevelData.h"
#include "M1_FM1AbilityEvent.h"
#include "Engine_FHitResult.h"

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::Skill_Bunny_Active04
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active04_C_IncreaseBeamLevel_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active04_C_GetBeamLevelData_Params
    {
    public:
        int32_t                                                      BeamLevel;                                               //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        BunnyBeamLevelData::FBunnyBeamLevelData                      BeamLevelData;                                           //  0x0008(0x0018)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         bValid;                                                  //  0x0020(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x3];                                   //  0x0021(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active04_C_JumpEndSection_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active04_C_BeamStart_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active04_C_OnAbilityEvent_4A462A1E4E1E7BE1AE84FA9C4E71DEA4_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active04_C_OnInput_B0EF358841BB5B69F2F99899295ECB10_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active04_C_BP_OnDeactivated_Params
    {
    public:
        bool                                                         bCancelled;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active04_C_BP_OnActivated_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active04_C_OnMontageEventReceived_Params
    {
    public:
        M1::FM1AbilityEvent                                          InEvent;                                                 //  0x0000(0x0040)  (BlueprintVisible, BlueprintReadOnly, Parm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active04_C_OnHit_Params
    {
    public:
        Engine::FHitResult                                           HitResult;                                               //  0x0000(0x009C)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active04_C_ServerOnReceiveEndInput_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active04_C_NetMulticastOnReceiveEndInput_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active04_C_ExecuteUbergraph_Skill_Bunny_Active04_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active04_C_OnBeamActivationChanged__DelegateSignature_Params
    {
    public:
        bool                                                         bActivated;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active04_C_OnBeamLevelIncrease__DelegateSignature_Params
    {
    public:
        int32_t                                                      CurrentBeamLevel;                                        //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0003[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        double                                                       ChargeTimeToNextLevel;                                   //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         bMaxLevel;                                               //  0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
