#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "M1_FM1AbilityEvent.h"

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::Skill_Bunny_Active02
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active02_C_EndMovingStatusEffects_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active02_C_InvokeMovingStatusEffects_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active02_C_OnChangedPlayerSprinting_Params
    {
    public:
        bool                                                         bSprinting;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active02_C_Clear_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active02_C_SetForceSprint_Params
    {
    public:
        bool                                                         bForceSprint;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active02_C_Init_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active02_C_OnUpdate_A465146F451BCF37BB62B8B01618AE07_Params
    {
    public:
        float                                                        DeltaTime;                                               //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active02_C_OnAbilityEvent_D9CE56334E000AB66C54A5B3F5F494F7_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active02_C_OnAbilityEvent_030F36AA4E14392ABD0E8B8A27E8923A_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active02_C_OnAbilityEvent_BCB05C274186D253A5A233AB42192F94_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active02_C_OnAbilityEvent_31F5712C4DCC19F80D02CF8229DC721C_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active02_C_OnInput_E1C054934884027A8F840AB031C1B55B_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active02_C_BP_OnActivated_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active02_C_BP_OnDeactivated_Params
    {
    public:
        bool                                                         bCancelled;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active02_C_OnTick_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active02_C_ApplyLocomotionLayer_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active02_C_ServerOnReceiveToggleInput_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Active02_C_ExecuteUbergraph_Skill_Bunny_Active02_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
