#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "M1Data_ENUMS.h"
#include "GameplayTags_FGameplayTag.h"
#include "M1_FM1AbilityOperationParam.h"
#include "BasicTypes_FName.h"
#include "M1_FM1AbilityEvent.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::M1 { class UM1StatusEffect; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::Skill_Bunny_Passive
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_EndDecreaseAsyncTask_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_PlayFullGuageLeavingSound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_PlayFullGuageEnteringSound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_PlayLandSound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_PlayHoldSound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_PlayDecreaseSound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_PlayIncreaseSound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_PlayDeactivationSound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_PlayActivationSound_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_UpdateLoopVFX_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_OnChangedGauge_Params
    {
    public:
        M1Data::EM1StatType                                          StatType;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_IsMoving_Params
    {
    public:
        bool                                                         Result;                                                  //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_OnRemovedStatus_Params
    {
    public:
        M1::UM1StatusEffect*                                         StatusEffect;                                            //  0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_StartHoldingGauge_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_StartDecreaseGauge_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_StartIncreaseGauge_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_OnLandingExplosion_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_MakeLandingExplosionParams_Params
    {
    public:
        GameplayTags::FGameplayTag                                   OpTag;                                                   //  0x0000(0x0008)  (Parm, OutParm, NoDestructor, HasGetValueTypeHash)
        M1::FM1AbilityOperationParam                                 OpParam;                                                 //  0x0008(0x00B0)  (Parm, OutParm, ContainsInstancedReference)
        double                                                       Radius;                                                  //  0x00B8(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        BasicTypes::FName                                            FXName;                                                  //  0x00C0(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_OnDoubleJump_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_IsStopMoving_Params
    {
    public:
        bool                                                         Result;                                                  //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_IsStartMoving_Params
    {
    public:
        bool                                                         Result;                                                  //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_Init_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_OnFinish_0D2FCA1545A6896DE5C053835CFE4803_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_OnAbilityEvent_3C54BF444F4B2DFA3DDB0ABF06D3386E_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_OnAbilityEvent_7750724D4E64E3C330A5AFAE95BBCF70_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_OnEvent_134BDA8C445F3F990A76638F4D6E5055_Params
    {
    public:
        GameplayTags::FGameplayTag                                   InTag;                                                   //  0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
        bool                                                         InAdded;                                                 //  0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_BP_OnActivated_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_OnTick_Params
    {
    public:
        float                                                        DeltaSeconds;                                            //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_BP_OnDeactivated_Params
    {
    public:
        bool                                                         bCancelled;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_OnStartMoving_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_CheckOutStartedMovingOnce_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_OnStopMoving_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_OnDecreaseDelayFinished_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_OnDeboneAttached_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_OnDeboneDetached_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkill_Bunny_Passive_C_ExecuteUbergraph_Skill_Bunny_Passive_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
