#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_FName.h"
#include "M1_FM1AbilityEvent.h"
#include "Engine_FHitResult.h"

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::SkillAbility_BeamBase
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class USkillAbility_BeamBase_C_ChangeBeamTag_Params
    {
    public:
        BasicTypes::FName                                            BeamTag;                                                 //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkillAbility_BeamBase_C_OnMontageEventReceived_Params
    {
    public:
        M1::FM1AbilityEvent                                          InEvent;                                                 //  0x0000(0x0040)  (BlueprintVisible, BlueprintReadOnly, Parm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkillAbility_BeamBase_C_BeamEnd_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkillAbility_BeamBase_C_BeamStart_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkillAbility_BeamBase_C_InitBeamComponents_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkillAbility_BeamBase_C_OnEventReceived_A43806C74BFC153D5719CE9AB981F899_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkillAbility_BeamBase_C_OnCompleted_A43806C74BFC153D5719CE9AB981F899_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkillAbility_BeamBase_C_OnBlendOut_A43806C74BFC153D5719CE9AB981F899_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkillAbility_BeamBase_C_OnEventReceived_8FDF88FA45348D44545A6FAC02900E80_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkillAbility_BeamBase_C_OnCompleted_8FDF88FA45348D44545A6FAC02900E80_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkillAbility_BeamBase_C_OnBlendOut_8FDF88FA45348D44545A6FAC02900E80_Params
    {
    public:
        M1::FM1AbilityEvent                                          Event;                                                   //  0x0000(0x0040)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkillAbility_BeamBase_C_BP_OnActivated_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkillAbility_BeamBase_C_BP_OnDeactivated_Params
    {
    public:
        bool                                                         bCancelled;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkillAbility_BeamBase_C_OnHit_Params
    {
    public:
        Engine::FHitResult                                           HitResult;                                               //  0x0000(0x009C)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkillAbility_BeamBase_C_OnChangeBeamComp_Params
    {
    public:
        BasicTypes::FName                                            NewBeamCompTag;                                          //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USkillAbility_BeamBase_C_ExecuteUbergraph_SkillAbility_BeamBase_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
