#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "Engine_FPoseLink.h"

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::Slot_2HV
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class USlot_2HV_C_UpperBody_U_R_Params
    {
    public:
        Engine::FPoseLink                                            InPose_UpperBody_U_R;                                    //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            UpperBody_U_R;                                           //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USlot_2HV_C_UpperBody_L_Additive_Params
    {
    public:
        Engine::FPoseLink                                            InPose_UpperBody_L_Additive;                             //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            UpperBody_L_Additive;                                    //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USlot_2HV_C_UpperBody_L_Params
    {
    public:
        Engine::FPoseLink                                            InPose_UpperBody_L;                                      //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            UpperBody_L;                                             //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USlot_2HV_C_UpperBody_U_Params
    {
    public:
        Engine::FPoseLink                                            InPose_UpperBody_U;                                      //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            UpperBody_U;                                             //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USlot_2HV_C_FullBody_Params
    {
    public:
        Engine::FPoseLink                                            InPose_FullBody;                                         //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            FullBody;                                                //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USlot_2HV_C_Motion_M_Params
    {
    public:
        Engine::FPoseLink                                            InPose_Motion_M;                                         //  0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
        Engine::FPoseLink                                            Motion_M;                                                //  0x0010(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USlot_2HV_C_AnimGraph_Params
    {
    public:
        Engine::FPoseLink                                            AnimGraph;                                               //  0x0000(0x0010)  (Parm, OutParm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class USlot_2HV_C_ExecuteUbergraph_Slot_2HV_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
