#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "MeshDescription_FVertexInstanceID.h"
#include "CoreUObject_FVector2D.h"
#include "MeshDescription_FPolygonGroupID.h"
#include "BasicTypes_FName.h"
#include "CoreUObject_FVector.h"
#include "MeshDescription_FPolygonID.h"

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::StaticMeshDescription
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UStaticMeshDescription_SetVertexInstanceUV_Params
    {
    public:
        MeshDescription::FVertexInstanceID                           VertexInstanceID;                                        //  0x0000(0x0004)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FVector2D                                       UV;                                                      //  0x0004(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      UVIndex;                                                 //  0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UStaticMeshDescription_SetPolygonGroupMaterialSlotName_Params
    {
    public:
        MeshDescription::FPolygonGroupID                             PolygonGroupID;                                          //  0x0000(0x0004)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            SlotName;                                                //  0x0004(0x0008)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UStaticMeshDescription_GetVertexInstanceUV_Params
    {
    public:
        MeshDescription::FVertexInstanceID                           VertexInstanceID;                                        //  0x0000(0x0004)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      UVIndex;                                                 //  0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FVector2D                                       ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UStaticMeshDescription_CreateCube_Params
    {
    public:
        CoreUObject::FVector                                         Center;                                                  //  0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::FVector                                         HalfExtents;                                             //  0x000C(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MeshDescription::FPolygonGroupID                             PolygonGroup;                                            //  0x0018(0x0004)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MeshDescription::FPolygonID                                  PolygonID_PlusX;                                         //  0x001C(0x0004)  (Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MeshDescription::FPolygonID                                  PolygonID_MinusX;                                        //  0x0020(0x0004)  (Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MeshDescription::FPolygonID                                  PolygonID_PlusY;                                         //  0x0024(0x0004)  (Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MeshDescription::FPolygonID                                  PolygonID_MinusY;                                        //  0x0028(0x0004)  (Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MeshDescription::FPolygonID                                  PolygonID_PlusZ;                                         //  0x002C(0x0004)  (Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        MeshDescription::FPolygonID                                  PolygonID_MinusZ;                                        //  0x0030(0x0004)  (Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
