#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "CoreUObject_FVector.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class UCurveVector; };
namespace CG::Engine { class UCurveFloat; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::StatusEffect_KnockBase
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UStatusEffect_KnockBase_C_CalcRecoveryAnimPlayRate_Params
    {
    public:
        double                                                       OutPlayRate;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UStatusEffect_KnockBase_C_PrintDebugString_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UStatusEffect_KnockBase_C_CalcAnimHitDirYaw_Params
    {
    public:
        double                                                       Yaw;                                                     //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UStatusEffect_KnockBase_C_CacheMonsterAnim_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UStatusEffect_KnockBase_C_CalcMoveAnimPlayRate_Params
    {
    public:
        double                                                       OutPlayRate;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UStatusEffect_KnockBase_C_GetMoveVectorCurve_Params
    {
    public:
        Engine::UCurveVector*                                        MoveCurve;                                               //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UStatusEffect_KnockBase_C_GetMoveFloatCurve_Params
    {
    public:
        Engine::UCurveFloat*                                         MoveCurve;                                               //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UStatusEffect_KnockBase_C_GetVelocityZ_Params
    {
    public:
        double                                                       VelocityZ;                                               //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UStatusEffect_KnockBase_C_GetVelocityX_Params
    {
    public:
        double                                                       VelocityX;                                               //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UStatusEffect_KnockBase_C_GetMoveDuration_Params
    {
    public:
        double                                                       Duration;                                                //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UStatusEffect_KnockBase_C_GetRecoveryAnimLength_Params
    {
    public:
        double                                                       AnimLength;                                              //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UStatusEffect_KnockBase_C_GetMoveAnimLength_Params
    {
    public:
        double                                                       AnimLength;                                              //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UStatusEffect_KnockBase_C_CalcHitYaw_Params
    {
    public:
        double                                                       OutHitDirYaw;                                            //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UStatusEffect_KnockBase_C_CalcMoveDestination_Params
    {
    public:
        CoreUObject::FVector                                         OutDest;                                                 //  0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UStatusEffect_KnockBase_C_OnFinished_EE89DF93440C9829428C249811A431CA_Params
    {
    public:
        bool                                                         DestinationReached;                                      //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         TimedOut;                                                //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x2];                                   //  0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        CoreUObject::FVector                                         FinalTargetLocation;                                     //  0x0004(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UStatusEffect_KnockBase_C_OnMoveEnded_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UStatusEffect_KnockBase_C_BP_OnActivated_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UStatusEffect_KnockBase_C_ExecuteUbergraph_StatusEffect_KnockBase_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
