#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "TypedElementFramework_FScriptTypedElementListProxy.h"
#include "TypedElementRuntime_FTypedElementSelectionOptions.h"
#include "TypedElementRuntime_FTypedElementSelectionNormalizationOptions.h"
#include "BasicTypes_TArray.h"
#include "TypedElementFramework_FScriptTypedElementHandle.h"
#include "TypedElementRuntime_FTypedElementSelectionSetState.h"
#include "TypedElementRuntime_FTypedElementIsSelectedOptions.h"
#include "TypedElementRuntime_ENUMS.h"
#include "CoreUObject_FAssetData.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::TypedElementRuntime { class UTypedElementSelectionSet; };
namespace CG::CoreUObject { class IInterface; };
namespace CG::CoreUObject { class UObject; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::TypedElementRuntime
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSetLibrary_SetSelectionFromList_Params
    {
    public:
        TypedElementRuntime::UTypedElementSelectionSet*              SelectionSet;                                            //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0008(0x0010)  (ConstParm, Parm, NativeAccessSpecifierPublic)
        TypedElementRuntime::FTypedElementSelectionOptions           SelectionOptions;                                        //  0x0018(0x0005)  (ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x001D(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSetLibrary_SelectElementsFromList_Params
    {
    public:
        TypedElementRuntime::UTypedElementSelectionSet*              SelectionSet;                                            //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0008(0x0010)  (ConstParm, Parm, NativeAccessSpecifierPublic)
        TypedElementRuntime::FTypedElementSelectionOptions           SelectionOptions;                                        //  0x0018(0x0005)  (ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x001D(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSetLibrary_GetNormalizedSelection_Params
    {
    public:
        TypedElementRuntime::UTypedElementSelectionSet*              SelectionSet;                                            //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        TypedElementRuntime::FTypedElementSelectionNormalizationOptions NormalizationOptions;                                    //  0x0008(0x0002)  (ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x6];                                   //  0x000A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        TypedElementFramework::FScriptTypedElementListProxy          ReturnValue;                                             //  0x0010(0x0010)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSetLibrary_GetNormalizedElementList_Params
    {
    public:
        TypedElementRuntime::UTypedElementSelectionSet*              SelectionSet;                                            //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0008(0x0010)  (ConstParm, Parm, NativeAccessSpecifierPublic)
        TypedElementRuntime::FTypedElementSelectionNormalizationOptions NormalizationOptions;                                    //  0x0018(0x0002)  (ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0001[0x6];                                   //  0x001A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        TypedElementFramework::FScriptTypedElementListProxy          ReturnValue;                                             //  0x0020(0x0010)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSetLibrary_DeselectElementsFromList_Params
    {
    public:
        TypedElementRuntime::UTypedElementSelectionSet*              SelectionSet;                                            //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0008(0x0010)  (ConstParm, Parm, NativeAccessSpecifierPublic)
        TypedElementRuntime::FTypedElementSelectionOptions           SelectionOptions;                                        //  0x0018(0x0005)  (ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x001D(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_SetSelection_Params
    {
    public:
        BasicTypes::TArray<TypedElementFramework::FScriptTypedElementHandle> InElementHandles;                                        //  0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
        TypedElementRuntime::FTypedElementSelectionOptions           InSelectionOptions;                                      //  0x0010(0x0005)  (ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0015(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_SelectElements_Params
    {
    public:
        BasicTypes::TArray<TypedElementFramework::FScriptTypedElementHandle> InElementHandles;                                        //  0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
        TypedElementRuntime::FTypedElementSelectionOptions           InSelectionOptions;                                      //  0x0010(0x0005)  (ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0015(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_SelectElement_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        TypedElementRuntime::FTypedElementSelectionOptions           InSelectionOptions;                                      //  0x0008(0x0005)  (ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x000D(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_RestoreSelectionState_Params
    {
    public:
        TypedElementRuntime::FTypedElementSelectionSetState          InSelectionState;                                        //  0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_OnPreChangeDynamic__DelegateSignature_Params
    {
    public:
        TypedElementRuntime::UTypedElementSelectionSet*              SelectionSet;                                            //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_OnChangeDynamic__DelegateSignature_Params
    {
    public:
        TypedElementRuntime::UTypedElementSelectionSet*              SelectionSet;                                            //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_K2_GetSelectedElementHandles_Params
    {
    public:
        CoreUObject::IInterface*                                     InBaseInterfaceType;                                     //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::TArray<TypedElementFramework::FScriptTypedElementHandle> ReturnValue;                                             //  0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_IsElementSelected_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        TypedElementRuntime::FTypedElementIsSelectedOptions          InSelectionOptions;                                      //  0x0008(0x0001)  (ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0009(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_HasSelectedObjects_Params
    {
    public:
        CoreUObject::UObject*                                        InRequiredClass;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_HasSelectedElements_Params
    {
    public:
        CoreUObject::IInterface*                                     InBaseInterfaceType;                                     //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_GetTopSelectedObject_Params
    {
    public:
        CoreUObject::UObject*                                        InRequiredClass;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::UObject*                                        ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_GetSelectionElement_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        TypedElementRuntime::ETypedElementSelectionMethod            InSelectionMethod;                                       //  0x0008(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        TypedElementFramework::FScriptTypedElementHandle             ReturnValue;                                             //  0x0010(0x0008)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_GetSelectedObjects_Params
    {
    public:
        CoreUObject::UObject*                                        InRequiredClass;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::TArray<CoreUObject::UObject*>                    ReturnValue;                                             //  0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_GetNumSelectedElements_Params
    {
    public:
        int32_t                                                      ReturnValue;                                             //  0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_GetCurrentSelectionState_Params
    {
    public:
        TypedElementRuntime::FTypedElementSelectionSetState          ReturnValue;                                             //  0x0000(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_GetBottomSelectedObject_Params
    {
    public:
        CoreUObject::UObject*                                        InRequiredClass;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::UObject*                                        ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_DeselectElements_Params
    {
    public:
        BasicTypes::TArray<TypedElementFramework::FScriptTypedElementHandle> InElementHandles;                                        //  0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
        TypedElementRuntime::FTypedElementSelectionOptions           InSelectionOptions;                                      //  0x0010(0x0005)  (ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0015(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_DeselectElement_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        TypedElementRuntime::FTypedElementSelectionOptions           InSelectionOptions;                                      //  0x0008(0x0005)  (ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x000D(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_CountSelectedObjects_Params
    {
    public:
        CoreUObject::UObject*                                        InRequiredClass;                                         //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      ReturnValue;                                             //  0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_CountSelectedElements_Params
    {
    public:
        CoreUObject::IInterface*                                     InBaseInterfaceType;                                     //  0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      ReturnValue;                                             //  0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_ClearSelection_Params
    {
    public:
        TypedElementRuntime::FTypedElementSelectionOptions           InSelectionOptions;                                      //  0x0000(0x0005)  (ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0005(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_CanSelectElement_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        TypedElementRuntime::FTypedElementSelectionOptions           InSelectionOptions;                                      //  0x0008(0x0005)  (ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x000D(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_CanDeselectElement_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        TypedElementRuntime::FTypedElementSelectionOptions           InSelectionOptions;                                      //  0x0008(0x0005)  (ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x000D(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementSelectionSet_AllowSelectionModifiers_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ITypedElementAssetDataInterface_GetAssetData_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        CoreUObject::FAssetData                                      ReturnValue;                                             //  0x0008(0x0068)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ITypedElementAssetDataInterface_GetAllReferencedAssetDatas_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::TArray<CoreUObject::FAssetData>                  ReturnValue;                                             //  0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ITypedElementHierarchyInterface_GetParentElement_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        bool                                                         bAllowCreate;                                            //  0x0008(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        TypedElementFramework::FScriptTypedElementHandle             ReturnValue;                                             //  0x0010(0x0008)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ITypedElementHierarchyInterface_GetChildElements_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::TArray<TypedElementFramework::FScriptTypedElementHandle> OutElementHandles;                                       //  0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
        bool                                                         bAllowCreate;                                            //  0x0018(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ITypedElementObjectInterface_GetObjectClass_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        CoreUObject::UObject*                                        ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ITypedElementObjectInterface_GetObject_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        CoreUObject::UObject*                                        ReturnValue;                                             //  0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ITypedElementSelectionInterface_SelectElement_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        TypedElementFramework::FScriptTypedElementListProxy          InSelectionSet;                                          //  0x0008(0x0010)  (Parm, NativeAccessSpecifierPublic)
        TypedElementRuntime::FTypedElementSelectionOptions           InSelectionOptions;                                      //  0x0018(0x0005)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x001D(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ITypedElementSelectionInterface_IsElementSelected_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        TypedElementFramework::FScriptTypedElementListProxy          InSelectionSet;                                          //  0x0008(0x0010)  (ConstParm, Parm, NativeAccessSpecifierPublic)
        TypedElementRuntime::FTypedElementIsSelectedOptions          InSelectionOptions;                                      //  0x0018(0x0001)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0019(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ITypedElementSelectionInterface_GetSelectionElement_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        TypedElementFramework::FScriptTypedElementListProxy          InCurrentSelection;                                      //  0x0008(0x0010)  (ConstParm, Parm, NativeAccessSpecifierPublic)
        TypedElementRuntime::ETypedElementSelectionMethod            InSelectionMethod;                                       //  0x0018(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0019(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        TypedElementFramework::FScriptTypedElementHandle             ReturnValue;                                             //  0x0020(0x0008)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ITypedElementSelectionInterface_DeselectElement_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        TypedElementFramework::FScriptTypedElementListProxy          InSelectionSet;                                          //  0x0008(0x0010)  (Parm, NativeAccessSpecifierPublic)
        TypedElementRuntime::FTypedElementSelectionOptions           InSelectionOptions;                                      //  0x0018(0x0005)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x001D(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ITypedElementSelectionInterface_CanSelectElement_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        TypedElementRuntime::FTypedElementSelectionOptions           InSelectionOptions;                                      //  0x0008(0x0005)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x000D(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ITypedElementSelectionInterface_CanDeselectElement_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        TypedElementRuntime::FTypedElementSelectionOptions           InSelectionOptions;                                      //  0x0008(0x0005)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x000D(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ITypedElementSelectionInterface_AllowSelectionModifiers_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        TypedElementFramework::FScriptTypedElementListProxy          InSelectionSet;                                          //  0x0008(0x0010)  (ConstParm, Parm, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
