#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "TypedElementFramework_FScriptTypedElementHandle.h"
#include "TypedElementFramework_FScriptTypedElementListProxy.h"
#include "BasicTypes_FName.h"
#include "BasicTypes_TArray.h"
#include "BasicTypes_FText.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::CoreUObject { class IInterface; };
namespace CG::CoreUObject { class UObject; };
namespace CG::TypedElementFramework { class UTypedElementRegistry; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::TypedElementFramework
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementHandleLibrary_Release_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             ElementHandle;                                           //  0x0000(0x0008)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementHandleLibrary_NotEqual_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             LHS;                                                     //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        TypedElementFramework::FScriptTypedElementHandle             RHS;                                                     //  0x0008(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementHandleLibrary_IsSet_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             ElementHandle;                                           //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementHandleLibrary_Equal_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             LHS;                                                     //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        TypedElementFramework::FScriptTypedElementHandle             RHS;                                                     //  0x0008(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementListLibrary_Shrink_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0000(0x0010)  (Parm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementListLibrary_Reset_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0000(0x0010)  (Parm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementListLibrary_Reserve_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0000(0x0010)  (Parm, NativeAccessSpecifierPublic)
        int32_t                                                      Size;                                                    //  0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementListLibrary_Remove_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0000(0x0010)  (Parm, NativeAccessSpecifierPublic)
        TypedElementFramework::FScriptTypedElementHandle             ElementHandle;                                           //  0x0010(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementListLibrary_Num_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0000(0x0010)  (ConstParm, Parm, NativeAccessSpecifierPublic)
        int32_t                                                      ReturnValue;                                             //  0x0010(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementListLibrary_IsValidIndex_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0000(0x0010)  (ConstParm, Parm, NativeAccessSpecifierPublic)
        int32_t                                                      Index;                                                   //  0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0014(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementListLibrary_HasElementsOfType_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0000(0x0010)  (ConstParm, Parm, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            ElementTypeName;                                         //  0x0010(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementListLibrary_HasElements_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0000(0x0010)  (ConstParm, Parm, NativeAccessSpecifierPublic)
        CoreUObject::IInterface*                                     BaseInterfaceType;                                       //  0x0010(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementListLibrary_GetElementInterface_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0000(0x0010)  (ConstParm, Parm, NativeAccessSpecifierPublic)
        TypedElementFramework::FScriptTypedElementHandle             ElementHandle;                                           //  0x0010(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        CoreUObject::IInterface*                                     BaseInterfaceType;                                       //  0x0018(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::UObject*                                        ReturnValue;                                             //  0x0020(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementListLibrary_GetElementHandles_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0000(0x0010)  (ConstParm, Parm, NativeAccessSpecifierPublic)
        CoreUObject::IInterface*                                     BaseInterfaceType;                                       //  0x0010(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        BasicTypes::TArray<TypedElementFramework::FScriptTypedElementHandle> ReturnValue;                                             //  0x0018(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementListLibrary_GetElementHandleAt_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0000(0x0010)  (ConstParm, Parm, NativeAccessSpecifierPublic)
        int32_t                                                      Index;                                                   //  0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        TypedElementFramework::FScriptTypedElementHandle             ReturnValue;                                             //  0x0018(0x0008)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementListLibrary_Empty_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0000(0x0010)  (Parm, NativeAccessSpecifierPublic)
        int32_t                                                      Slack;                                                   //  0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementListLibrary_CreateScriptElementList_Params
    {
    public:
        TypedElementFramework::UTypedElementRegistry*                Registry;                                                //  0x0000(0x0008)  (Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        TypedElementFramework::FScriptTypedElementListProxy          ReturnValue;                                             //  0x0008(0x0010)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementListLibrary_CountElementsOfType_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0000(0x0010)  (ConstParm, Parm, NativeAccessSpecifierPublic)
        BasicTypes::FName                                            ElementTypeName;                                         //  0x0010(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      ReturnValue;                                             //  0x0018(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementListLibrary_CountElements_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0000(0x0010)  (ConstParm, Parm, NativeAccessSpecifierPublic)
        CoreUObject::IInterface*                                     BaseInterfaceType;                                       //  0x0010(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        int32_t                                                      ReturnValue;                                             //  0x0018(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementListLibrary_Contains_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0000(0x0010)  (ConstParm, Parm, NativeAccessSpecifierPublic)
        TypedElementFramework::FScriptTypedElementHandle             ElementHandle;                                           //  0x0010(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementListLibrary_Clone_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0000(0x0010)  (ConstParm, Parm, NativeAccessSpecifierPublic)
        TypedElementFramework::FScriptTypedElementListProxy          ReturnValue;                                             //  0x0010(0x0010)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementListLibrary_AppendList_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0000(0x0010)  (Parm, NativeAccessSpecifierPublic)
        TypedElementFramework::FScriptTypedElementListProxy          OtherElementList;                                        //  0x0010(0x0010)  (ConstParm, Parm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementListLibrary_Append_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0000(0x0010)  (Parm, NativeAccessSpecifierPublic)
        BasicTypes::TArray<TypedElementFramework::FScriptTypedElementHandle> ElementHandles;                                          //  0x0010(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementListLibrary_Add_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementListProxy          ElementList;                                             //  0x0000(0x0010)  (Parm, NativeAccessSpecifierPublic)
        TypedElementFramework::FScriptTypedElementHandle             ElementHandle;                                           //  0x0010(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementRegistry_GetInstance_Params
    {
    public:
        TypedElementFramework::UTypedElementRegistry*                ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UTypedElementRegistry_GetElementInterface_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        CoreUObject::IInterface*                                     InBaseInterfaceType;                                     //  0x0008(0x0008)  (ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        CoreUObject::UObject*                                        ReturnValue;                                             //  0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ITestTypedElementInterfaceA_SetDisplayName_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::FText                                            InNewName;                                               //  0x0008(0x0018)  (Parm, NativeAccessSpecifierPublic)
        bool                                                         bNotify;                                                 //  0x0020(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0021(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ITestTypedElementInterfaceA_GetDisplayName_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        BasicTypes::FText                                            ReturnValue;                                             //  0x0008(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ITestTypedElementInterfaceB_MarkAsTested_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class ITestTypedElementInterfaceC_GetIsTested_Params
    {
    public:
        TypedElementFramework::FScriptTypedElementHandle             InElementHandle;                                         //  0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
        bool                                                         ReturnValue;                                             //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
