#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "M1_ENUMS.h"
#include "SlateCore_FGeometry.h"
#include "SlateCore_FPointerEvent.h"
#include "UMG_FEventReply.h"
#include "BasicTypes_FText.h"
#include "SlateCore_ENUMS.h"
#include "SlateCore_FFocusEvent.h"
#include "M1Data_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::AkAudio { class UAkAudioEvent; };
namespace CG::UMG { class UWidget; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::UI_Chatting
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_IsMinimalUIState_Params
    {
    public:
        bool                                                         ReturnValue;                                             //  0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_ChangeUIState_Params
    {
    public:
        M1::EM1ChattingUIState                                       InState;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_HideAllWidgets_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_ShowMaximalWidgets_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_ShowMiminalWidgets_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_InitializeWidgets_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_SetMinBGOpacity_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_PlayTextInputAkEvent_Params
    {
    public:
        bool                                                         IsEmpty;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        AkAudio::UAkAudioEvent*                                      TypingEvent;                                             //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
        AkAudio::UAkAudioEvent*                                      EmptyEvent;                                              //  0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_OnMouseButtonDown_Params
    {
    public:
        SlateCore::FGeometry                                         MyGeometry;                                              //  0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
        SlateCore::FPointerEvent                                     MouseEvent;                                              //  0x0038(0x0078)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
        UMG::FEventReply                                             ReturnValue;                                             //  0x00B0(0x00B8)  (Parm, OutParm, ReturnParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_GetFocusWidget_Params
    {
    public:
        UMG::UWidget*                                                ReturnValue;                                             //  0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_Construct_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_BndEvt__Text_Message_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature_Params
    {
    public:
        BasicTypes::FText                                            Text;                                                    //  0x0000(0x0018)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
        SlateCore::ETextCommit                                       CommitMethod;                                            //  0x0018(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_BP_MinimalUIBackgroundOpacityChanged_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_BP_MinimalUIAutoHideOptionChanged_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_BndEvt__Text_Message_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature_Params
    {
    public:
        BasicTypes::FText                                            Text;                                                    //  0x0000(0x0018)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_OnRemovedFromFocusPath_Params
    {
    public:
        SlateCore::FFocusEvent                                       InFocusEvent;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_TrySetAutoHideTimer_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_OnAutoHideWidgets_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_OnAddedToFocusPath_Params
    {
    public:
        SlateCore::FFocusEvent                                       InFocusEvent;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_BP_OnActivateChat_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_BP_OnDeactivateChat_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_OnRefreshCooltimeText_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_BP_OnRefreshChattingCooltime_Params
    {
    public:
        int32_t                                                      RemainCooltime;                                          //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_BP_NofityDirectMessage_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_BP_OnChattingTabChanged_Params
    {
    public:
        M1Data::EM1ChattingTab                                       InTargetTab;                                             //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_BP_PostReceivedChatMessage_Params
    {
    public:
        bool                                                         bDueToShowMinimalUI;                                     //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         bWasScrolledToBottom;                                    //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Chatting_C_ExecuteUbergraph_UI_Chatting_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
