#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "UMG_ENUMS.h"
#include "M1Data_FM1ScaledInteger.h"
#include "BasicTypes_TArray.h"
#include "GameplayTags_FGameplayTag.h"
#include "M1_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::Engine { class UTexture2D; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::UI_GameHP_Target
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_SetPhaseUIPlayFillOrEmpty_Params
    {
    public:
        int32_t                                                      PhaseRemainCount;                                        //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_SetPhaseUIVisible_Params
    {
    public:
        int32_t                                                      PhaseTotalCount;                                         //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_GetStateVisibility_Params
    {
    public:
        int32_t                                                      PhaseTotalCount;                                         //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int32_t                                                      CheckingPhase;                                           //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        UMG::ESlateVisibility                                        SlateVisibility;                                         //  0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_LoopPhaseImmune_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_GetPhasedHP_Params
    {
    public:
        M1Data::FM1ScaledInteger                                     CurrentHp;                                               //  0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
        float                                                        OutRatio;                                                //  0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         ReturnValue;                                             //  0x000C(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x3];                                   //  0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_StopPhaseImmune_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_RefreshPhaseImmune_Params
    {
    public:
        bool                                                         bReset;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_RefreshPhaseState_Params
    {
    public:
        bool                                                         bReset;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_SetUIPhaseView_Params
    {
    public:
        bool                                                         InPhase;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_BP_OnDeactivateDetectionIndicator_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_BP_OnActivateDetectionIndicator_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_BP_OnBerserkGaugeChanged_Params
    {
    public:
        float                                                        GaugeRatio;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_Construct_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_PreConstruct_Params
    {
    public:
        bool                                                         IsDesignTime;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_BP_UpdateWeakElementalIcons_Params
    {
    public:
        BasicTypes::TArray<Engine::UTexture2D*>                      WeakElementalIcons;                                      //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_BP_UpdateWeakAdvantageIcon_Params
    {
    public:
        Engine::UTexture2D*                                          WeakAdvantageIcon;                                       //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_BP_NotifyTagAdded_Params
    {
    public:
        GameplayTags::FGameplayTag                                   Tag;                                                     //  0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_BP_NotifyTagRemoved_Params
    {
    public:
        GameplayTags::FGameplayTag                                   Tag;                                                     //  0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_BP_InitWidgetImpl_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_BP_PlayFocusAnim_Params
    {
    public:
        bool                                                         bInForwardAnim;                                          //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_BP_PlayNameAnim_Params
    {
    public:
        bool                                                         bInForwardAnim;                                          //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_BP_InitBossMonsterWidget_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_OnEventWidgetClose_Params
    {
    public:
        M1::EM1WidgetAnimDirection                                   InDirection;                                             //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_GameHP_Target_C_ExecuteUbergraph_UI_GameHP_Target_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
