#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "M1_ENUMS.h"
#include "M1Data_ENUMS.h"
#include "SlateCore_FGeometry.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::M1 { class UM1UIData; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::UI_ItemIconButton
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_SequenceEvent__ENTRYPOINTUI_ItemIconButton_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_BP_ShowCompleteMark_Params
    {
    public:
        bool                                                         bShow;                                                   //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_SetUI_NoHold_Params
    {
    public:
        bool                                                         NoHold;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_BP_ShowStackCount_Params
    {
    public:
        bool                                                         bShow;                                                   //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_ChangeButtonUI_Params
    {
    public:
        M1::EM1ButtonUIType                                          InType;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_ChangeSelectedUI_Params
    {
    public:
        bool                                                         InSelected;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_SetEmptyDataImpl_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_BP_Selected_Params
    {
    public:
        bool                                                         InSelected;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_BP_ChangeDimmedUI_Params
    {
    public:
        bool                                                         InDimmed;                                                //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_BP_SetCount_Params
    {
    public:
        int64_t                                                      InTargetCount;                                           //  0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        int64_t                                                      InCurrentCount;                                          //  0x0008(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_BP_SetEquippedMark_Params
    {
    public:
        bool                                                         bIsEquipped;                                             //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        M1Data::EM1EquipmentSlotType                                 InSlotType;                                              //  0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_BP_SetBookmarkMark_Params
    {
    public:
        bool                                                         bIsBookmarked;                                           //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_BP_SetSelectedMark_Params
    {
    public:
        bool                                                         bIsSelected;                                             //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_BP_SetDecomposeMark_Params
    {
    public:
        bool                                                         bIsDecompose;                                            //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_BP_ChangeButtonUI_Params
    {
    public:
        M1::EM1ButtonUIType                                          InType;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_BP_PlayWarningAnim_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_BP_SetJunkMark_Params
    {
    public:
        bool                                                         bIsJunk;                                                 //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_BP_ResetButtonState_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_BP_SetResearchableMark_Params
    {
    public:
        bool                                                         bIsResearchable;                                         //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_BP_SetTrackingMark_Params
    {
    public:
        bool                                                         bIsTracking;                                             //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_SetDataImpl_Params
    {
    public:
        M1::UM1UIData*                                               InData;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_Tick_Params
    {
    public:
        SlateCore::FGeometry                                         MyGeometry;                                              //  0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
        float                                                        InDeltaTime;                                             //  0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_bp_Ak_Audio_Event_Puntin_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_BP_SetStackCount_Params
    {
    public:
        int64_t                                                      InStackCount;                                            //  0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_BP_DisplayAsPreviewItem_Params
    {
    public:
        bool                                                         bIsPreviewItem;                                          //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_BP_SetBoundStatus_Params
    {
    public:
        M1::EM1ItemBoundStatus                                       InBoundStatus;                                           //  0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_Construct_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_PreConstruct_Params
    {
    public:
        bool                                                         IsDesignTime;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_ItemIconButton_C_ExecuteUbergraph_UI_ItemIconButton_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
