#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "M1_ENUMS.h"

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::UI_InvasionDungeon_ScoreBar { class UUI_InvasionDungeon_ScoreBar_C; };
namespace CG::UI_InstanceDungeon_ScoreBar { class UUI_InstanceDungeon_ScoreBar_C; };
namespace CG::UI_Mission_Result_Slot_Item { class UUI_Mission_Result_Slot_Item_C; };
namespace CG::UI_Mission_Result_Reward_Items { class UUI_Mission_Result_Reward_Items_C; };
namespace CG::UI_Mission_Result_MasterRankProgress { class UUI_Mission_Result_MasterRankProgress_C; };
namespace CG::M1 { class UM1UIDataMissionResult; };
namespace CG::M1 { class UM1UIData; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::UI_MissionResult
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SequenceEvent__ENTRYPOINTUI_MissionResult_19_Params
    {
    public:
        UI_InvasionDungeon_ScoreBar::UUI_InvasionDungeon_ScoreBar_C* UI_InvasionDungeon_ScoreBar;                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SequenceEvent__ENTRYPOINTUI_MissionResult_18_Params
    {
    public:
        UI_InstanceDungeon_ScoreBar::UUI_InstanceDungeon_ScoreBar_C* UI_InstanceDungeon_ScoreBar;                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SequenceEvent__ENTRYPOINTUI_MissionResult_17_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SequenceEvent__ENTRYPOINTUI_MissionResult_16_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SequenceEvent__ENTRYPOINTUI_MissionResult_15_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SequenceEvent__ENTRYPOINTUI_MissionResult_14_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SequenceEvent__ENTRYPOINTUI_MissionResult_13_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SequenceEvent__ENTRYPOINTUI_MissionResult_12_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SequenceEvent__ENTRYPOINTUI_MissionResult_11_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SequenceEvent__ENTRYPOINTUI_MissionResult_10_Params
    {
    public:
        UI_Mission_Result_Slot_Item::UUI_Mission_Result_Slot_Item_C* UI_Mission_Result_SlotItem_3;                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SequenceEvent__ENTRYPOINTUI_MissionResult_9_Params
    {
    public:
        UI_Mission_Result_Slot_Item::UUI_Mission_Result_Slot_Item_C* UI_Mission_Result_SlotItem_2;                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SequenceEvent__ENTRYPOINTUI_MissionResult_8_Params
    {
    public:
        UI_Mission_Result_Slot_Item::UUI_Mission_Result_Slot_Item_C* UI_Mission_Result_SlotItem_1;                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SequenceEvent__ENTRYPOINTUI_MissionResult_7_Params
    {
    public:
        UI_Mission_Result_Slot_Item::UUI_Mission_Result_Slot_Item_C* UI_Mission_Result_SlotItem_4;                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SequenceEvent__ENTRYPOINTUI_MissionResult_6_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SequenceEvent__ENTRYPOINTUI_MissionResult_5_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SequenceEvent__ENTRYPOINTUI_MissionResult_4_Params
    {
    public:
        UI_Mission_Result_Reward_Items::UUI_Mission_Result_Reward_Items_C* UI_Mission_Result_RewardItems;                           //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SequenceEvent__ENTRYPOINTUI_MissionResult_3_Params
    {
    public:
        UI_Mission_Result_MasterRankProgress::UUI_Mission_Result_MasterRankProgress_C* UI_MasteryRankProgress;                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SequenceEvent__ENTRYPOINTUI_MissionResult_2_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SequenceEvent__ENTRYPOINTUI_MissionResult_1_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SequenceEvent__ENTRYPOINTUI_MissionResult_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SetUIMissionResult_Params
    {
    public:
        bool                                                         isFalse;                                                 //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_OnEventOpenAnimFinished_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SetMissionResultInfo_Params
    {
    public:
        M1::UM1UIDataMissionResult*                                  InResultData;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SetCurrencyData_Params
    {
    public:
        M1::UM1UIDataMissionResult*                                  InResultData;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SetItemData_Params
    {
    public:
        M1::UM1UIDataMissionResult*                                  InResultData;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SetExpData_Params
    {
    public:
        M1::UM1UIDataMissionResult*                                  InResultData;                                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_PlayAnim_Common_Mid_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_UI_InstanceDungeon_ScoreBar_Event_Params
    {
    public:
        UI_InstanceDungeon_ScoreBar::UUI_InstanceDungeon_ScoreBar_C* UI_InstanceDungeon_ScoreBar;                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_UI_InvasionDungeon_ScoreBar_Event_Params
    {
    public:
        UI_InvasionDungeon_ScoreBar::UUI_InvasionDungeon_ScoreBar_C* UI_InvasionDungeon_ScoreBar;                             //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_PreConstruct_Params
    {
    public:
        bool                                                         IsDesignTime;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_Construct_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_SetDataImpl_Params
    {
    public:
        M1::UM1UIData*                                               InData;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_WidgetAnimationEvt_UIAnim_Open_Default_K2Node_WidgetAnimationEvent_1_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_WidgetAnimationEvt_UIAnim_Close_K2Node_WidgetAnimationEvent_2_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_BP_PlayCloseAnim_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_PlayAnim_Common_End_1_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_UI_Mission_Result_SlotItem_2_Event_Params
    {
    public:
        UI_Mission_Result_Slot_Item::UUI_Mission_Result_Slot_Item_C* UI_Mission_Result_SlotItem_3;                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_UI_Mission_Result_SlotItem_1_Event_Params
    {
    public:
        UI_Mission_Result_Slot_Item::UUI_Mission_Result_Slot_Item_C* UI_Mission_Result_SlotItem_2;                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_UI_Mission_Result_SlotItem_0_Event_Params
    {
    public:
        UI_Mission_Result_Slot_Item::UUI_Mission_Result_Slot_Item_C* UI_Mission_Result_SlotItem_1;                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_PlayAnim_Common_End_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_UI_MasteryRankProgress_Event_Params
    {
    public:
        UI_Mission_Result_MasterRankProgress::UUI_Mission_Result_MasterRankProgress_C* UI_MasteryRankProgress;                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_PlayAnim_Common_Start_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_UI_Mission_Result_RewardItems_Event_Params
    {
    public:
        UI_Mission_Result_Reward_Items::UUI_Mission_Result_Reward_Items_C* UI_Mission_Result_RewardItems;                           //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_UI_Mission_Result_SlotItem_3_Event_Params
    {
    public:
        UI_Mission_Result_Slot_Item::UUI_Mission_Result_Slot_Item_C* UI_Mission_Result_SlotItem_4;                            //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_WidgetAnimationEvt_UIAnim_Open_InstanceDungeon_K2Node_WidgetAnimationEvent_4_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_BP_PlayOpenAnim_Params
    {
    public:
        M1::EM1MissionResultOpenAnimType                             InAnimType;                                              //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_WidgetAnimationEvt_UIAnim_Open_InvasionDungeon_K2Node_WidgetAnimationEvent_3_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_MissionResult_C_ExecuteUbergraph_UI_MissionResult_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
