#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>
#include "BasicTypes_TArray.h"
#include "M1_ENUMS.h"

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::UI_Mission_Result_MasterRankProgress
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Mission_Result_MasterRankProgress_C_BP_MasteryRankExpAcquiredType_Params
    {
    public:
        BasicTypes::TArray<M1::EM1UIMissionResultExpType>            InAcquiredType;                                          //  0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Mission_Result_MasterRankProgress_C_BP_SetLevel_Params
    {
    public:
        int32_t                                                      InLevel;                                                 //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Mission_Result_MasterRankProgress_C_BP_ResetAllExpProgressValue_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Mission_Result_MasterRankProgress_C_BP_SetExpProgressValue_Params
    {
    public:
        M1::EM1UIMissionResultExpType                                InType;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        float                                                        InProgressValue;                                         //  0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Mission_Result_MasterRankProgress_C_BP_ShowExpText_Params
    {
    public:
        M1::EM1UIMissionResultExpType                                InType;                                                  //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x7];                                   //  0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        int64_t                                                      InExp;                                                   //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Mission_Result_MasterRankProgress_C_UISetDefault_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Mission_Result_MasterRankProgress_C_UIMaxLevel_Params
    {
    public:
        bool                                                         MaxLevel;                                                //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x3];                                   //  0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Mission_Result_MasterRankProgress_C_PreConstruct_Params
    {
    public:
        bool                                                         IsDesignTime;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Mission_Result_MasterRankProgress_C_Construct_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Mission_Result_MasterRankProgress_C_BP_SetIsMaxLevel_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Mission_Result_MasterRankProgress_C_WidgetAnimationEvt_UIAnim_ProgressFull_K2Node_WidgetAnimationEvent_1_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Mission_Result_MasterRankProgress_C_BP_PlayLevelUpAnim_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Mission_Result_MasterRankProgress_C_ExecuteUbergraph_UI_Mission_Result_MasterRankProgress_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
