#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>

// --------------------------------------------------
// # Forwards
// --------------------------------------------------
namespace CG::M1 { class UM1UIData; };
namespace CG::AkAudio { class UAkAudioEvent; };

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::UI_Quest_Task
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Quest_Task_C_SequenceEvent__ENTRYPOINTUI_Quest_Task_1_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Quest_Task_C_SequenceEvent__ENTRYPOINTUI_Quest_Task_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Quest_Task_C_UpdateCompleteCoditionsUI_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Quest_Task_C_OnChangedTaskProgress_Params
    {
    public:
        int32_t                                                      InIndex;                                                 //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Quest_Task_C_UpdateUI_Params
    {
    public:
        M1::UM1UIData*                                               InUIData;                                                //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Quest_Task_C_BP_widget_playAkEvent_Params
    {
    public:
        AkAudio::UAkAudioEvent*                                      AkEvent;                                                 //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Quest_Task_C_SequenceEvent_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Quest_Task_C_SequenceEvent_1_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Quest_Task_C_PreConstruct_Params
    {
    public:
        bool                                                         IsDesignTime;                                            //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Quest_Task_C_SetDataImpl_Params
    {
    public:
        M1::UM1UIData*                                               InData;                                                  //  0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Quest_Task_C_BP_PlayNewQuestAnim_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Quest_Task_C_BP_PlayCompletedQuestAnim_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Quest_Task_C_WidgetAnimationEvt_Anim_SuccessQuest_K2Node_WidgetAnimationEvent_1_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Quest_Task_C_BP_OnChangedProgressAtQuest_Params
    {
    public:
        int32_t                                                      InIndex;                                                 //  0x0000(0x0004)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Quest_Task_C_BP_UpdateCompleteCoditionsUI_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_Quest_Task_C_ExecuteUbergraph_UI_Quest_Task_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
