#pragma once
#pragma warning(disable: 4267)

/**
 * ----------------------------------------
 * |        Generated By CheatGear        |
 * ----------------------------------------
 * | Game:    TFDCG                       |
 * | Version: 1                           |
 * | Date:    08/22/2024                  |
 * ----------------------------------------
 */

#include <cstdint>
#include <vector>
#include <string>

#ifdef _MSC_VER
    #pragma pack(push, 0x01)
#endif

namespace CG::UI_SkillCustomHUD_BunnyActive4
{
    // --------------------------------------------------
    // # Classes
    // --------------------------------------------------
    /**
     * 
     * Size -> 0x0000
     */
    class UUI_SkillCustomHUD_BunnyActive4_C_UpdateBeamLevelGauge_Params
    {
    public:
        int32_t                                                      BeamLevel;                                               //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0000[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        double                                                       GaugePrecentage;                                         //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_SkillCustomHUD_BunnyActive4_C_ResetWidgetVisibilities_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_SkillCustomHUD_BunnyActive4_C_ShowWidget_Params
    {
    public:
        bool                                                         bShow;                                                   //  0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_SkillCustomHUD_BunnyActive4_C_Construct_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_SkillCustomHUD_BunnyActive4_C_OnBeamLevelIncrease_Params
    {
    public:
        int32_t                                                      BeamLevel;                                               //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0001[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
        double                                                       ChargeTimeToNextLevel;                                   //  0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        bool                                                         bMaxLevel;                                               //  0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_SkillCustomHUD_BunnyActive4_C_BP_OnSkillActivated_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_SkillCustomHUD_BunnyActive4_C_BP_OnSkillDeactivated_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_SkillCustomHUD_BunnyActive4_C_Destruct_Params
    {
    };

    /**
     * 
     * Size -> 0x0000
     */
    class UUI_SkillCustomHUD_BunnyActive4_C_ExecuteUbergraph_UI_SkillCustomHUD_BunnyActive4_Params
    {
    public:
        int32_t                                                      EntryPoint;                                              //  0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
        uint8_t                                                      UnknownData_0002[0x4];                                   //  0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
    };

}

#ifdef _MSC_VER
    #pragma pack(pop)
#endif
